{
    "Nanoleaf Essentials A19 E27 smart bulb review: affordable smart lighting: A smart-home essential to take on Philips Hue": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Nanoleaf Essentials smart bulb is a much more affordable alternative to Philips Hue, and it’s brighter and more colorful too. It’s a HomeKit-compatible light that needs no extra paraphernalia to make it work, but to unlock all its best features you will need to own an Apple HomePod mini.\n\nPros\n\n+Affordable+Thread and Bluetooth connectivity+Bright and colorful\n\nCons\n\n-Slow Bluetooth performance-Lacks Alexa integration-App not intuitive\n",
        "review": "Nanoleaf announced its Essentials range in 2020, going up for pre-order on the company’s online storefront in November and available to purchase immediately from Apple. As of March 2021, the Essentials range – which currently includes the light bulb and a lightstrip – is available to buy directly from Nanoleaf and several other major retailers around the world, Apple included.\nThe Essential light bulb costs just $19.99 / £17.99 / AU$39.99 each. That's cheaper than the basic Philips Hue White Ambiance bulb that only offers – you guessed it – different hues of white/yellow light for $25.99 / £29.99 / AU$84.95.\nConsidering that the Nanoleaf bulb supports several colors and light hues, its direct competition is the Philips Hue White and Color Ambiance that costs a lot more at $64.99 / £49.99 / AU$99.95 per light globe, so there's a lot more value for money here.\nAnd if you opt to upgrade to the new Matter-enabled Essentials bulb (see update above), you won't be paying too much more either. The new Essentials bulb cost $19.99 / £19.99 / AU$39.99 and that means future-proofing your smart home setup doesn't have to cost a pretty penny.\n"
    },
    "Motorola Edge 40 Pro review: A better Pixel 7 Pro?: A confident flagship with very few flaws.": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Edge 40 Pro is the closest thing you’ll get to a Pixel-like experience without buying one of Google’s handsets, with high-end smartphone bells and whistles; including a super-high refresh rate and very fast charging. Though the camera isn’t the best, it is very good, and the versatility of its sensors plus the ability for raw capture means you can tweak results, if you so desire. If only Motorola was as good with delivering timely OS updates as Google, then this phone would have very few cons.\n\n\nPros\n\n+Slim, light, and comfortable design +Vibrant, bright screen+Super-fast charging and long battery life\n\nCons\n\n-Android updates not guaranteed -Underwhelming camera, despite specs-Annoying bloatware on setup\n",
        "review": "With the Motorola Edge 40 Pro, Motorola has once again made its Pro handset a true Android flagship. The company has packed in all the de rigeur trappings of a flagship phone – so you’re getting the best processor, all the latest connectivity standards, nicer materials, and the like.\nThe phone impresses at everything you would want it to do. Even its plain black colorway is nice to look at. The soft round edges are comfortable to grip, and the material at the rear feels nice to the touch.\nThe software is clean and well considered – it’s closer to a stock Android experience than most; with some minor additions. There are some small issues, of course – the phone insists that you choose from a selection of recommended Moto apps during the initial setup, and downloads them unless you manually unapprove each one, but after that Motorola leaves you to it. The company promises three years of software updates, but we note with trepidation that the Motorola Edge 20 and Edge 30 are still on Android 12, even as Google is prepping Android 14 for release.\nThe camera takes images quickly and the sensors capture good dynamic range, although shots overall are only just above average. The front-facing camera is decent, but smooths out the skin in portrait shots a little too much.\nThe phone excels in the battery life and charging departments, thanks to optimizations facilitated by its Snapdragon 8 Gen 2 chipset, and 125W fast-charging tech.\nThe Motorola Edge 40 Pro is a strong entry into what’s shaping up to be a competitive market for Android phones in 2023. At £799.99 (availability and pricing have yet to be confirmed for the US and Australia), it’s a little expensive, but you are definitely getting what you're paying for here.\n"
    },
    "Xiaomi 13 review: a sleek and sophisticated iPhone imitator: The Xiaomi 13 makes (almost) all the right moves": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Boasting an exceptionally bright display, phenomenal performance and a handsome (albeit unoriginal) straight-edged design, the Xiaomi 13 is an impressive Android flagship that deserves a much wider market.\n\nPros\n\n+Smart-looking design+Impressively bright display+Speedy Snapdragon 8 Gen 2 processor\n\nCons\n\n-No US availability-Memory options vary by region\n",
        "review": "The Xiaomi 13 arrives as the successor to the company’s 2022 flagship – the Xiaomi 12 – and stays true to its predecessor’s philosophy: premium performance in a compact package. \nBeyond a marginal size increase, the phone’s display is largely unchanged, but Xiaomi’s knack for brightness and vivid colors is here delivered in a much sleeker, almost iPhone-like body, which lands the Xiaomi 13 in the ‘handsome’ camp of today’s best Android phones.\nGranted, the Xiaomi 13 offers almost no originality on the design front beyond its Leica-branded camera setup (more on this below), but if, like me, you’re a sucker for Apple’s straight-sided aesthetic, then this phone’s unashamed resemblance to the best iPhones is a positive rather than a negative. \nThe Xiaomi 13’s impressive speeds are made possible by Qualcomm's Snapdragon 8 Gen 2 chipset – similar to the processor you’ll find powering Samsung’s newly-released Samsung Galaxy S23 line – and the device is offered in two memory variations: 8GB or 12GB of LPDDR5X RAM, paired with 256GB of UFS 4.0 storage (though, if you’re in the UK, you’re looking at the 8GB version only). \nThe phone’s 4,500mAh battery remains unchanged from the Xiaomi 12 – meaning you still get at least one whole day’s juice on a single charge – and the latter’s 67W wired charging, 50W wireless charging and 10W reverse wireless charging capabilities are carried over, too. \nOn paper, the biggest difference between the Xiaomi 13 and its predecessor is the former’s Leica-branded camera array. Comprising a 50MP f/1.8 main shooter with OIS (optical image stabilization), a 10MP f/2.0 telephoto camera with 3.2x optical zoom, and a 12MP f/2.2 ultrawide sensor, the Xiaomi 13’s camera setup makes the phone a much more versatile beast for photographers; primarily because Xiaomi’s Leica partnership allows for two distinct shooting modes: Vibrant and Authentic. The former makes colors look brighter and more saturated, while the latter replicates the original Leica look by encouraging bolder contrast and a greater dynamic range, which proves a nice differentiator between this and other Android phones. \nIf you’re looking for one of the very best camera phones, though, the Xiaomi 13 still doesn’t hold a candle to the photography performance offered by its Pro-grade sibling – the Xiaomi 13 Pro – or the Samsung Galaxy S23 Ultra and iPhone 14 Pro. \nThe bottom line is this: the Xiaomi 13 is an excellent flagship option for Android fans with a soft spot for Apple’s design philosophy. It doesn’t beat the competition in any one area, but Xiaomi’s latest premium offering still delivers almost everything you could want from a smartphone to an extremely high standard.\nFor those looking to spend a little more money, our hands-on Xiaomi 13 Pro review may shed some light on whether the jump up to Xiaomi’s even-more premium photography-focused handset is worth it.\n"
    },
    "Hands on: Oppo Find X6 Pro – Forget the oddball looks, this is a charging demon: For those who like their camera arrays big and their charging fast": {
        "rating": "",
        "summary_pros_cons": "The Oppo Find X6 Pro has the largest camera array we've ever seen on a smartphone. if you can get past that, this is a powerful Android 13 handset with excellent cameras and super-speedy charging. We'll see if it ever makes it around the world.\n\nPros\n\n+Triple 50MP camera array+Excellent battery life+100W fast charging\n\nCons\n\n-Massive camera bump-Pointless 120x digital zoom-USB-A charger\n",
        "review": "One thing you can say about the big and bold Oppo Find X6 Pro is that it makes an impression. Anyone who caught a glimpse of the 6.82-inch phone's back couldn't help but comment on the gigantic, circular camera array. As I see it, you can't talk about the phone without addressing this distinct piece of the phone's hardware.\nThe reality at this moment is that it's hard to write about much else on the Android 13 handset, which currently looks like it's only set to sell in China. Oppo graciously shipped me the Chinese version, which is packed with Mandarin text and is not currently capable of accepting English apps – including the Google Play Store. As a result, while I could experience the beefy hardware and lovely large screen, take countless photos (and some video), and play around with the pre-installed Chinese version of TikTok, I couldn't test much else. There's no way to benchmark the phone and run my favorite apps, not right now, anyway.\nHere's what I can tell you. This is a big, thick phone with three (count 'em three!) 50MP sensors on the back, which includes a wide, ultra-wide, and periscope telephoto (3x optical). They all get an image-processing assist from the leading-edge Qualcomm Snapdragon 8 Gen 2 mobile chipset and Oppo's MariSilicon X imaging NPU, as well as some tuning, courtesy of the company's ongoing partnership with Hasselblad.\nI was generally pleased with the phone's image capture capabilities, though it does push things a bit far with 120x (digital) super zoom that essentially turns photos into impressionistic paintings. \nThe other highlight here is the battery life and ultra-fast charging capabilities. This is one of the few smartphones still shipping with a dedicated charging adapter (it oddly still features a USB-A port), and, in this instance, it's a 100W powerhouse that – in my experience – can charge the phone from 0% to 100% in 30 minutes.\nIn China, the phone starts at CNY¥5,999 (approximately $870 / £710 / AU$1,305 when converted directly) and tops out at CNY¥6,999 (approximately $1,020 / £830 / AU$1,520) across three memory and storage configurations and reports of devices shipping from March 24.\n"
    },
    "Hands on: Samsung Galaxy A54 review – more awesome?: Samsung's new mid-range champ?": {
        "rating": "",
        "summary_pros_cons": "The cornerstone of Samsung's 2023 Galaxy A series mid-rangers packs in some nice upgrades over its predecessor; including a new 50MP primary camera promising improved low light capture and video stabilization, as well as boasting two-day battery life.\n\nPros\n\n+Modern Samsung Galaxy aesthetics+Promising new camera system+Superb long-term software support\n\nCons\n\n-Price hike in the UK versus A53-A little thick and heavy-No wireless charging\n",
        "review": "Seldom are mid-range phones as memorable as their flagship counterparts, but Samsung's Galaxy A series – and its A5X devices in particular – are often notable entrants into the mid-range market each year; unquestionably serving as some of the best Samsung phones money can buy.\nThey've seen a lot of success in past generations, with both the Galaxy A50 and Galaxy A51 being among the best-selling phones in the world, in their respective launch years; making the arrival of this newest entry for 2023 – the Samsung Galaxy A54 5G – all the more significant.\nA few days shy of a year on from the introduction of the Galaxy A53, Samsung showcased both the Galaxy A34 5G and Galaxy A54 5G alongside one another, hoping to rejuvenate the company's presence in the mid-range phone market by once again offering trickle-down premium features and long battery life in a stylish package that costs around half as much as the flagships they take inspiration from. As the numbering suggests, it's the A54 that's the fuller-featured off these two latest A-series entrants; with a more premium build, more competent cameras and more power at its disposal.\nCompared to its predecessor, the A54 has a marginally smaller 6.4-inch Full HD+ Super AMOLED display, which now peaks at 1,000nits (that's 200 more than the A53). You'll find Gorilla Glass 5 on the front and back, and the IP67-certified design embraces the floating camera aesthetics first introduced on the Samsung Galaxy S22 Ultra and subsequently adopted by the company's current flagship Galaxy S23 series, from the start of the year.\nJust a few weeks prior to the A54's debut, Samsung announced a successor to the silicon that powered 2022's Galaxy A53 – the Exynos 1380. This just so happens to be the chip that keeps the A54 ticking over, paired with 8GB of RAM in most markets (although there is also a 6GB RAM variant in some regions), alongside either 128GB or 256GB of storage, bolstered by increasingly-novel microSD expandability, up to 1TB.\nSamsung's also proud to shout about the phone's 5,000mAh battery (that's larger than both the S23's and S23 Plus' batteries), which the company promises delivers up to two-day longevity, twinned with support for 25W fast-charging – just like the standard Samsung Galaxy S23.\nWhile most numbers go up between generations, when looking at the A54's camera compared to its predecessor, the digits actually drop, but in this instance that could be a good thing. Rather than a 64MP lead snapper, the A54's camera array is fronted by a new 50MP sensor with larger pixels, improved autofocus and OIS (optical image stabilization), paired with a 12MP ultrawide, a 5MP dedicated macro camera and a 32MP front-facing punch-hole camera.\nOn the software side of things, Samsung has pulled the impressive commitment it's made with its flagship-class Galaxy S and Z phones down to the A54 too, meaning this mid-ranger – which arrives on One UI 5.1 atop Android 13 – enjoys the same four years of OS updates and five years of security updates; granting the A54 a far longer lifespan than the majority of its equivalent rivals, from a software standpoint.\nThe Galaxy A54 was announced on March 15, with a progressive rollout across European markets, starting with France. Pre-orders in the UK kicked off on the same day, with an on-sale date of April 25, while in the US pre-orders start March 30, with and on-sale date of April 6. In Australia, the A54 is available from March 31.\nUS and Australian customers will find the starting price of the A54 unchanged from its predecessor, at $449.99 and AU$699 respectively, however, in UK customers can expect a £50 price hike compared to the A53; taking the starting price from £399 to £449 for an 8GB RAM / 128GB Galaxy A54.\nStay tuned for a full review and in the meantime, why not check out our rundown of the best cheap phones, as well as our full Samsung Galaxy S23 review, Samsung Galaxy S23 Plus review and Samsung Galaxy S23 Ultra review.\n"
    },
    "Oppo Find N2 Flip review: the Z Flip 4's foil: A new challenger steps into the fold": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Oppo Find N2 Flip stirs up the clamshell foldable market with its flagship-class internals, capable cameras and zero-gap fold, all for less money than its biggest rival.\n\nPros\n\n+No gap and almost no display crease+Undercuts Samsung Z Flip 4 on price+Plenty of power\n\nCons\n\n-Cover display could do more-No wireless charging-No US availability\n",
        "review": "Although Oppo has held a small presence in the foldable space for years, the newly-launched Oppo Find N2 Flip is the company's first true global foldable, arriving in markets beyond China; including the UK and Europe.\nNot only has the N2 Flip got its sights set on new regions, as Oppo's first clamshell it's hoping to appeal to a different crowd than the company's previous foldable offerings.\nWhile the Oppo Find N and Oppo Find N2 are primarily built for productivity – with vertical hinges and squared main displays – the proposition of a clamshell folding phone is a little different. A clamshell prioritizes compactness and style.\nThat's the narrative for the Find N2 Flip, just as it was with Samsung's Galaxy Z Flip 4 in 2022 and, in truth, it looks as though the N2 Flip has been specifically engineered to outdo the Z Flip 4.\nThe design centers around a 6.8-inch 120Hz 21:9 folding AMOLED display, in a body that's 7.45mm thin and weighs 191 grams (that's a little bigger, thicker and heavier than a Z Flip 4).\nOppo has paid special attention to the Flexion Hinge running across the N2 Flip's midriff. It offers one of the least noticeable creases in a folding display to date – both to the eye and under-finger – while allowing the phone to fold closed without a gap (unlike Samsung's best foldables). The N2 Flip also has a wonderfully satisfying feel when being opened and closed, thanks to the cam mechanism in the hinge's construction.\nThe external cover screen, meanwhile, dwarves even the Motorola Razr 2022's outer Quick View display, with a 3.26-inch 17:9 AMOLED panel that naturally sits in a portrait orientation, next to the phone's main 50MP and secondary 8MP ultrawide cameras.\nAs you'd expect, it can be used as a viewfinder when snapping stills, videos and portrait shots with the phone's most powerful camera. It can be used to access quick settings and check notifications, view the weather or your calendar. The display also allows for instant access to timers and even a virtual pet, Tamagotchi-style, but there's potential for it to do so much more, and Oppo hasn't realized that functionality... yet.\nOppo has augmented the ColorOS 13 user experience on the N2 Flip with what it calls 'FlexForm Mode.' When the phone is folded between 45- and 110-degrees, you can leverage the cameras for everything from time lapse recording to video calls, without the need for a tripod.\nOn the inside, MediaTek's Dimensity 9000 Plus chipset serves up plenty of power (having already proven its worth in one of the best gaming phones out there – the Asus ROG Phone 6D Ultimate). \nIt's a shame that, outside of its home market, the Find N2 is only available in a single memory and storage configuration: 8GB RAM / 256GB. In China, the phone can also be had with 12GB RAM and the same storage or a whopping 16GB RAM and 512GB of storage.\nThere's also a colorway called Flowing Gold that isn't part of the device's international release. Instead, most consumers will have the option of either Astral Black or Moonlit Purple – creating a decidedly similar look to the Galaxy Z Flip 4's iconic purple finish.\nOppo launched the phone internationally on February 15, going on sale in various markets (including the UK) on March 2, for £849 (approximately $1,020) and Australia on March 16 for AU$1,499.\nWith the moves Oppo has made with the Find N2 Flip, it's clear that the Samsung Galaxy Z Flip 5 has its work cut out.\n"
    },
    "Hands on: Xiaomi 13 Lite review – the Civi's new suit: A Civi by any other name...": {
        "rating": "",
        "summary_pros_cons": "The Xiaomi 13 Lite certainly feels like the odd-one-out in the Xiaomi 13 series, and not only because it's a mid-ranger in what is otherwise a family of flagships. Despite packing older hardware and a borrowed design than its launch siblings, though, there are some subtle charms to this latest Lite.\n\nPros\n\n+Thin and lightweight design+Standout selfie camera setup+Fast 67W wired charging\n\nCons\n\n-Launches on the older Android 12-No IP rating or wireless charging\n",
        "review": "Xiaomi had a lot to shout about at its February 26 launch event in Barcelona. Most notably, the Xiaomi 13 and Xiaomi 13 Pro made their international debut after having previously launched exclusively in China, late last year. There was, however, one additional surprise entrant in tow that, prior to this, we'd heard very little about – the Xiaomi 13 Lite.\nAt a glance, the Lite is a bit of an oddball, an outlier in the Xiaomi 13 series. For one, it doesn't get any special Leica treatment like its series siblings – with regards to its triple rear sensor setup. It also looks very different compared to both the Xiaomi 13 and 13 Pro, with their sizeable squared rear camera bump.\nIn truth, the phone clearly takes its design cues from the previous Xiaomi 12 series more so than the company's current flagship line and there's a particular device, already within Xiaomi's portfolio, that bears more than a passing resemblance to the new 13 Lite.\nIt would seem that the Xiaomi 13 Lite looks to be a repackaged Xiaomi Civi 2, which debuted in China in the latter half of 2022. The Xiaomi 13 Lite sports the same slim and lightweight design, runs on the same Snapdragon 7 Gen 1 chipset, and boasts the same specialist features; like dual front-facing LED flashes to offer what the company calls 'Xiaomi Selfie Glow'.\nIn fact, despite running on Android 12 – while the Xiaomi 13 and 13 Pro arrive with Android 13 – the Xiaomi 13 Lite does join them on the company's latest MIUI 14 user experience.\nWhile there's no Leica involvement in the camera system, the main 50MP sensor still looks to be an impressive offering at first blush (it's the same Sony IMX766 found in the likes of the Xiaomi 12), while the secondary 8MP ultrawide and 2MP macro look a little more pedestrian and expected, considering the phone's mid-range standing.\nIn a decidedly iPhone 14 Pro-style move, the front 32MP camera is accompanied by a secondary 8MP depth sensor that together sit within a pill-shaped cutout in the top center of the display in a way that screams 'Dynamic Island'. However, don't expect iOS-like functionality here.\nIn truth, the design may be Lite's biggest selling point. Despite sitting in the middle of the Xiaomi 13 series in terms of screen size, at 6.55-inches (in between the Xiaomi 13's 6.36-inch display and the 13 Pro's 6.73-inch display), the 13 Lite is both notably thinner at 7.2mm (versus 8mm or 8.4mm) and lighter, at 171 grams (versus 185 grams and 210 grams, respectively).\nEven with that snatched waistline, the 13 Lite still manages to sequester the same 4,500mAh capacity battery as the standard Xiaomi 13, along with the same 67W fast wired charging. What you do lose out on is any form of wireless charging tech. However, with a full charge promised in 40 minutes, that seems like a minor hardship.\nProvided you don't need flagship performance or camera prowess, the 13 Lite looks to be a capable-enough mid-ranger, with some unique touches in an attractive, lightweight design. You'll have to check back for a full assessment though.\nIn the meantime, read on for more insights into what the Xiaomi 13 Lite has to offer, and why not check out our Xiaomi 13 review and hands-on Xiaomi 13 Pro review, as well as a rundown of the best Xiaomi phones currently out there.\n"
    },
    "Ulefone Power Armor 18T review: Not anything like the Power Armor 16 or 17 Pro": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Probably the best Ulefone design so far. Lots of features, a great camera, decent performance and is not overly heavy. This could be perfect for a construction worker or a vehicle engineer, or any profession that needs thermal imaging or an endoscope.\n\n\nPros\n\n+Dimensity 900 SoC+108MP Primary camera+FLIR 3.5 Thermal imaging+Endoscope option\n\nCons\n\n-Expensive-Accessory port screw\n",
        "review": "In recent months, we've ploughed through reviewing a number of rugged smartphones (opens in new tab), including the Ulefone Armour 16 Pro (opens in new tab), Ulefone Power Armor 17 Pro (opens in new tab) and here now, the 18T.\nIt would be easy to conclude that the numerical progression was a ladder of performance specifications, but that would be an oversimplification.\nThere aren’t many similarities between this and the 16 Pro and the 17 Pro, although the 18T does borrow some features from its predecessor.\nFor those curious, there is a cut-down Power Armor 18 and also a new Power Armor 19 design, but the 18T is still the flagship of this series, in our opinion.\nWhere the 16 Pro was a relatively inexpensive design with an underpowered SoC, the 18T is a high-powered solution with a premium phone price tag.\nWith a retail cost of $570, phone buyers expect plenty for their money, and the 18T has the best specification we’ve seen from Ulefone so far. \nWhere the 19 uses the less expensive MediaTek G99 SoC, the 18 and 18T use the 5G capable MediaTek Dimensity 900 SoC, delivering more processing power and double the GPU performance of the G99.\nThe choice to go with the Dimensity 900 is probably more about 5G coms than anything else, but having this power is also helpful for the FLIR thermal imaging sensor.\nWe’ve seen thermal imaging before on the Cat S63 Pro, and this is the same FLIR 3.5 that is on that phone. Very often, rugged phone makers use the cheaper FLIR 2.5 sensor, which was on the CAT S60 (opens in new tab), Ulefone Armor 11T 5G (opens in new tab) and Blackview BV9800 Pro (opens in new tab), to mention just a few.\nOn this phone, the newer FLIR 3.5 sensor offers a better resolution, achieving greater detail and clarity in the images it captures.\nThe other notable feature of this design is that it has the same accessory port as the 17 Pro, and through that, there are various specialist accessories available, including an endoscope.\nWhen you combine the ability to detect temperature distribution and having an endoscope to look at difficult-to-reach areas, the 18T starts to look like it might be ideal for those in automotive repair or similar businesses.\nThe downside to having such a powerful SoC and feature set is that this is the most expensive rugged design that Ulefone makes. The 18T is priced as a premium phone, and the customer mostly gets premium parts for their investment.\nAs this is most likely to be a second phone for most customers, is that just too much to be a practical consideration?.\n"
    },
    "Unihertz Tank review: An oddly accurate name for a rugged phone": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Another rugged design with vast battery capacity, but even heavier than the V Max. The best aspects of this design are the blinding LED light on the back and the 108MP primary camera sensor.\n\n\nPros\n\n+22000 mAh battery+108MP Rear camera with night vision+Camping lamp+66W charging\n\nCons\n\n-Huge and heavy-4G Comms-No MicroSD card slot-Only 1440p video\n",
        "review": "The parallels between the Unihertz Tank and the Doogee V Max (opens in new tab) that we reviewed recently are stark. Both are large and heavy rugged smartphones (opens in new tab), offering a 22000 mAh battery and a high degree of protection from the environment.\nBut where Doogee went for the higher ground with the Dimensity 1080 SoC and 5G comms, the Unihertz Tank went for a more price-sensitive Helio G99 and got 4G functionality.\nFor those that don’t play games or have access to 5G services, the difference between them is much less, and the Tank is $90 less for a long operating life away from a power socket.\nThe Tank comes with a 66W charger that can fill that enormous battery with power in relatively short order.\nAs feature sets go, the Tank has an excellent one. Along with the Helio G99 SoC, 8GB of RAM and 256GB of storage, this phone also sports a 108MP primary phone sensor, a 20MP night vision camera, 32MP selfie front camera and an incredibly bright Camping Lamp.\nThat last feature is a unique extra that can output 1200 lumens of light to illuminate a whole room or forest clearing, depending on what you are trying to achieve. We could see this being remarkably useful in the event of a vehicle accident at night, where other traffic needs to be aware of a stopped vehicle that might have lost power.\nThe Camping Lamp is just one of the unique features available in the Unihertz Toolbox app. These include a compass, basic flashlight, magnifier, bubble level, plumb bob, protractor, pressure gauge, height measure, speedometer, heart rate monitor, alarm and pedometer, amongst others.\nThis app talks very much to the customer Unihertz is looking to buy this device, who might be a building contractor or outdoor adventurer, or anyone who doesn’t wish to endanger their premium phone with water, dust or being dropped.\nWhile the features in this phone are generally good, the two issues here are that this is a very large and heavy device that isn’t easy to pocket. And, the asking price is at the high end of what is essentially a 2nd phone that might be reasonably expected to cost.\nIf you have a particular project in the jungle or desert and do not want to take your Samsung or Apple phone to that party, then the Unihertz Tank is a credible, if slightly pricey, choice.\n"
    },
    "Hands on: Honor Magic 5 Pro review – a versatile flagship with a potentially world-beating camera: Honor’s latest flagship is a promising beast": {
        "rating": "",
        "summary_pros_cons": "The Honor Magic 5 Pro has all the makings of being the phone to well and truly put Honor on the mobile map. Its design will divide opinion, but there are enough premium specs here to consider the Honor Magic 5 Pro a bar-raising Android handset.\n\nPros\n\n+Vivid, sleep-friendly display +Industry-leading cameras+Impressive battery life on paper\n\nCons\n\n-Impractical design-No US availability\n",
        "review": "In an interview with TechRadar at MWC 2023, Honor CEO George Zhao made no bones about the capabilities of his company’s latest flagship, the Honor Magic 5 Pro (stylized as the Honor Magic5 Pro). “If you compare [this phone] to other flagship devices, it’s better than them. No one can compete with us,” he proclaimed.\nIt remains to be seen whether that statement rings true, but in my short time spent with the Honor Magic 5 Pro – a successor to the excellent Honor Magic 4 Pro – the phone has proven a unique and feature-packed device with few obvious drawbacks.\nThe Honor Magic 5 Pro’s display is big and bright. The cameras are some of the most impressive I’ve seen. Its large battery looks, on paper, to ensure that you’ll get at least 12 hours of heavy use from the phone before needing to charge it. That said, the Magic 5 Pro’s unusual (read: impractical) design won’t work for everyone. \nBefore you read on, it’s worth noting that Honor placed a fair few caveats on my hands-on testing of the Honor Magic 5 Pro – specifically around what was and wasn’t ready for review. I haven’t been able to sample all of the phone’s camera features, or much of its software, but Honor has said these elements will be available for full testing ahead of the phone’s release later this year. \n"
    },
    "Hands on: Xiaomi 13 Pro review – a camera-led flagship for the world: Top-shelf performance and a huge Leica camera go global": {
        "rating": "",
        "summary_pros_cons": "We already knew that the Xiaomi 13 Pro had a lot to offer – having launched in China late last year. Now that it's gone global, the new Pro looks primed to surpasses expectations, with impressive hardware and design, and a heap of technology. It's the first international example of Xiaomi's recent partnership with imaging specialists Leica, paired with a massive 1-inch main camera sensor. Oh, and don't forget about the Snapdragon chipset, brilliant display, fast charging battery, and so much more.\n\nPros\n\n+Most efficient chipset, RAM and storage available+High-grade camera experience with Leica tuning+Strong, confident design\n\nCons\n\n-Fewer storage and color options compared to Chinese model-Finish attracts fingerprints-Huge camera bump-Heavy\n",
        "review": "The wait felt long but Xiaomi is finally bringing its latest flagship line – the Xiaomi 13 series – to international markets. The best phones on the global stage, like the iPhone 14 Pro Max and Samsung Galaxy S23 Ultra, have a new contender to worry about; one that doesn't mess around, based on my initial time with the Xiaomi 13 Pro.\nAlthough it's intended as a direct successor to Xiaomi 12 Pro, one of the 13 Pro's biggest selling points (that new Leica-branded camera system) is actually a direct continuation of the technology first seen in the China-exclusive Xiaomi 12S Ultra that we encountered later into 2022, in August.\nOur first taste of the company's newly-minted relationship with the optical wizards at Leica, mated with Sony's sizeable 1-inch IMX989 sensor and Xiaomi's own image processing, proved to be a recipe for success; impressing reviewer Basil Kronfli, who described the 12S Ultra as \"the best camera phone I've used.\"\nWith such lofty praise, the 12S Ultra's absence from the international market felt like a crying shame, making the Xiaomi 13 Pro's fresh international release all the more significant.\nThat killer camera setup, features a trio of 50MP rear sensors, including a 3.2x telephoto with a floating lens arrangement. The Xiaomi 13 Pro also comes with a ceramic-backed body, plus Qualcomm's latest and greatest Snapdragon 8 Gen 2 mobile chipset, with faster and more efficient memory and storage than its predecessor.\nFor charging, we get the same impressive 120W wired, 50W wireless and 10W reverse wireless charging as before, but this time paired to a larger, 4,820mAh battery. Nice.\nAlthough the verdict is still out on whether this is one of the best Android phones of the year, it certainly has the makings of a great flagship device, one that I can't wait to sink my teeth into for a full review, so don't forget to check back soon for a final verdict.\nIn the meantime, read on for my hands-on experiences with the Xiaomi 13 Pro, and if you're curious about its smaller-but-still-potent launch sibling, we also have a Xiaomi 13 review for you to enjoy too.\n"
    },
    "Saints Row review: Commitment issues": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "Volition’s return to the series is a joyful romp, brimming with charm, violence, and quippy one-liners, but only when it remembers to take itself less seriously. \n\nPros\n\n+A mayhem-filled virtual playground.+Full of quippy dialogue and moments of charming irreverence.+Over-the-top combat worthy of a WWE title fight. \n\nCons\n\n-Awkward amounts of tonal whiplash. -A grindingly dull opening section. -Though never game-breaking, bugs are not uncommon. \n",
        "review": ""
    },
    "OnePlus 11 5G review: a scrappy contender for those in the know: Maybe a price cut is all you need to be a flagship killer": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The OnePlus 11 is an affordable pick for buyers who want something unique, and offers a more artistic take on smartphone photography. Its lack of durability is a bit worrisome, though.\n\nPros\n\n+Unique photography features+Smooth performance all around+Clean and simple interface\n\nCons\n\n-Glossy and slippery-No IP68 water resistance-Camera array isn't versatile\n",
        "review": "The OnePlus 11 is a unique phone that offers an amazing amount of smartphone performance and value, if you’re willing to accept some significant trade-offs. If you’ve been a OnePlus fan in the past, and you're unsure of returning to the brand now that it’s affordable again, I can tell you that you’ll find everything you love about OnePlus here. And if you’re thinking of switching from another brand, the OnePlus 11 is a very cool alternative – but heed my warnings. \nThe best thing about the OnePlus 11 might be the price. This phone will cost you just $699 / £729 / AU$1,199 for the base model. That’s cheaper than the iPhone 14 or Samsung Galaxy S23, even though it has a display that’s as large as the one on the iPhone 14 Plus, and a battery that’s even larger than those in most Plus phones. \nThanks to tuning by photography specialists Hasselblad, the OnePlus 11 has a camera system that leans more towards the artistic than mechanical, though it isn’t as easy to use as cameras on competing handsets. The phone also has a very large screen with a large battery to match. \nThat large battery lasts a long time, and the OnePlus 11 also charges faster than almost any other phone you can buy, though you may miss not having wireless charging. \nThe big caveat with the OnePlus 11 is that, unlike rival flagships, it isn’t water resistant. While an iPhone 14 or a Google Pixel 7 can take a dip in the bathtub with you, the OnePlus 11 is certified to handle heavy rain and no more. Don’t let it sink, or you’ll be sunk. \n2022’s OnePlus 10 Pro was seemingly certified IP68 water resistant, but only phones sold by T-Mobile in the US carried the official rating. This year, there’s no water resistance, and no carrier is selling the phone – you can only buy it directly from OnePlus (or retailers like Amazon in the UK). That’s a red flag for me, but the company has a fine enough history that I’d recommend this phone to folks who know the kind of care it will require, and the risks. \n"
    },
    "Doogee V30 review: A premium rugged phone for adventurers": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Not a cheap phone, but also not underspecified for the price. Exceptional performance and features in a chunky go-anywhere design. Lots to like here with relatively few flaws. The V30 shows well how Doogee has matured as a phone maker.\n\n\nPros\n\n+eSIM and SIM support+IP68 and IP69K protection+108MP camera+5G\n\nCons\n\n-Lacks 3.5mm headphone jack\n",
        "review": "Each time Doogee comes out with a new flagship design, it moves the bar for numerous companies in the rugged phone (opens in new tab) sector.\nThe new V30 takes features exclusive to premium branded phones only months ago and delivers them in an affordable package for those that work outdoors or yearn to adventure.\nTicking the rugged phone boxes, this is an IP68, IP69K and MIL-STD-810H compliant design that can handle dust and water, including full submersion for limited periods and shallow depths.\nBut the parts of this phone that will interest the discerning customer are all inside. Specifically, the Dimensity 900 SoC, 8GB of RAM, 256GB of storage and 108MP camera.\nThese make the V30 a potent and capable phone that can connect using 5G when available and capture the world around it in astounding detail.\nOn the rear are a 108MP Samsung S5KHM2SP03 main camera (F1.79, 90-degree FOV, PDAF) a 20MP Sony IMX350 night vision camera (F1.8, 70-degree FOV) and a 16MP wide-angle & macro camera (F2.2, 130-degree FOV).\nFor selfie-takers, the front has a 32MP IMX616-AAJH5-C front camera (F2.0, 90-degree FOV).\nLike we’ve seen before with this sensor, the taking of 108MP images negates some of the special features like HDR and Bokeh, but you can get those things in a 12MP mode.\nHowever, other phones don’t offer 4K video capture, and the V30 does, along with lower resolutions.\nViewing those pictures or streamed content is easy on its 6.58-inch IPS 120Hz display with a natural resolution of 2408 x 1080, similar to one of that we’ve seen before on the Ulefone Power Armor 17 Pro.\nWith a battery capacity of 10800mAh, the V30 should operate for more than three days of normal use without needing a recharge. And, using the included 66W charger, it can recover 50% of its battery capacity from empty in around 30 minutes.\nThese features and its 5G functionality make the V30 an exceptionally good choice for anything travelling abroad, capturing images and video and then securing them over cellular or WiFi connections.\nIt might not be the cheapest rugged phone design, but the amount of technology that Doogee shoehorned into it makes it easily worth the asking price.\n"
    },
    "Samsung Galaxy S22 Ultra review: The Samsung Galaxy S22 Ultra enters the Note zone": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Our Samsung Galaxy S22 Ultra review found a big, powerful, and attractive Android phone (if you like them monolithic). It’s super-versatile, ready for important work, hand-written notes, gaming, and casual big-screen web browsing – and the cameras are a clear highlight, with the Space Zoom capabilities taking you to infinity and beyond. And, yes, you’ll pay handily for all these features.\n\nPros\n\n+Incredible cameras and zoom+Excellent little S Pen+Gorgeous butter-smooth screen\n\nCons\n\n-Pricey-No microSD slot-Battery life could be better\n",
        "review": ""
    },
    "Samsung Galaxy S22 Plus review: A middle child that’s destined to be forgotten": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Samsung Galaxy S22 Plus falls into the riptide between the compact and relatively inexpensive S22, and the flashy and feature-packed S22 Ultra, and will struggle to find much love compared to them. Perhaps it doesn’t deserve to either because useful features like its powerful processor, photography modes, and attractive appearance don’t quite offset its high price. Its design doesn’t feel comfortable in your hand, and its software feels slower than on rival phones.\n\nPros\n\n+Lots of processing power+Useful Portrait camera modes+Nice range of colors\n\nCons\n\n-Very expensive-Not particularly comfortable to hold-Software feels slow\n",
        "review": "Before getting to to the Samsung Galaxy S22 Plus it's worth noting that we now have a Samsung Galaxy S23 Plus review, as the S22 Plus's successor has been unveiled. You might also want to check out our Samsung Galaxy S23 review and Samsung Galaxy S23 Ultra review. So the S22 Plus is no longer one of Samsung's latest flagships. That doesn't mean it's not worth considering though.\nThat said, of the three members of Samsung’s 2022 flagship line, the Galaxy S22 Plus feels like the one that most people will forget about.\nThe Samsung Galaxy S22 is the one that’s easy to recommend: it’s small enough to fit comfortably in your hand, and has a low price that won’t immediately alienate buyers. And then there’s the S22 Ultra with its high price but its S Pen stylus, premium design and plentiful rear cameras which will interest those looking for a super-powerful handset.\nBetween those two phones, it’s harder to get excited for the Galaxy S22 Plus, the awkward middle child in Samsung’s 2022 family. It mostly has the same specs as the S22, and a similar design, but with a bigger screen and battery. Oh, and its price is a significant step up, too.\nLike Samsung’s other S22 mobiles, the Galaxy S22 Plus remains one of the best phones in many different fields, but its high price and lack of upgrades over the S21 Plus make it look less appealing given the competitive actions of most rivals. Compared to the Xiaomi 12 Pro, OnePlus 10 Pro or Realme GT 2 Pro, or even affordable and capable alternatives like the Moto G200, Realme GT and OnePlus Nord 2, this is a really tough sell.\nThere are certainly some points in its favor. The Galaxy S22 Plus is great for taking portrait shots, and the camera app’s Portrait mode is fantastic both at the artificial background blur and for the range of effects and filters you can utilize. The camera app is great, and Single Take (which basically picks the best picture from a burst) remains a huge selling point for the company’s phones.\nWe also have to commend Samsung for being one of the few phone companies putting out vibrantly colored phones - we tested a pink S22 Plus, and other options include green, blue and violet. How many companies are putting out pink phones these days?\nAnd in many other areas, this is a powerful phone, with a top-end chipset, decent battery life and great main camera. \nBut while in many ways it's one of the best Samsung phones, it’s not a perfect phone, and we have quite a few gripes, too. With a flat edge, it’s not particularly comfortable to hold, and OneUI remains a sluggish-feeling software that’s slightly slower than other Android forks to use. Its display quality, charging speeds, and build quality are all decidedly average, too.\nPlus, it’s exceedingly expensive - we shouldn’t be calling a phone that costs this much ‘average’ in any way, and the overall use experience of this mobile is more comparable to mid-rangers than similarly priced Android or iPhone rivals you might be considering instead.\nWith a few discounts this phone might prove popular, but at its current price, it’s hard to recommend.\nIf, however, you're looking for the perfect Samsung Galaxy S22 Plus audio partner, you may want to check out our Samsung Galaxy Buds 2 Pro review.\n"
    },
    "Samsung Galaxy S22 review: a small-form wonder: Small, brimming with upgrades, and eminently useful": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Samsung Galaxy S22 is small, fast, and offers a clean and reliable Android experience. It's an incremental update that keeps what was good in the S21, and upgrades the camera, processor, and materials to create a solid Android device.\n\nPros\n\n+Small and solidly built+Attractive design+Excellent performance\n\nCons\n\n-Not a major update-Camera system pales in comparison to its Ultra cousin-Small screen\n",
        "review": "It's hard to write a Samsung Galaxy S22 review without making reference to its big brother, the Galaxy S22 Ultra. Now there's a phone with a radical new idea. Okay, it's an idea borrowed from the Galaxy Note line, but still, the Ultra stands apart from the S22 and S22 Plus. In fact, it makes the Galaxy S22 feel a bit less-than.\nSimilarly, we need to mention that the Samsung Galaxy S23 series has now been unveiled - you can check out our complete Samsung Galaxy S23 review, our thorough Samsung Galaxy S23 Plus review, and our full Samsung Galaxy S23 Ultra review for more information. But in short the Galaxy S22 feels slightly dated compared to them.\nBut these are also more expensive phones, so we’d be comparing apples to oranges to an extent. So let’s focus on what makes the Samsung Galaxy S22 such a fun, attractive, and palm-friendly device.\nPut simply, the S22 has enough of everything. It pushes no boundaries in terms of photography, screen size, and battery life, yet it still compares favorably to Apple's $799 / £849 / AU$1,339 iPhone 14.  \nSamsung's flagship phone provides more megapixels and sensors for photos, and gives you 3x optical zoom. To get something similar on the iPhone, you'll have to jump up to the pricier Pro models.\nThe Samsung Galaxy S22 is the kind of phone you get if your tastes are upscale but your budget is a bit downrange. Its 6.1-inch screen can feel cramped if you’re coming from virtually any similarly-priced Android phone from OnePlus and Xiaomi. However, placed side-by size with an iPhone 14, the dimensions are similar – and the resemblance is uncanny. \nIt's a handset that will quickly become a trusted companion. The cameras should satisfy most average mobile photography users, and the image quality is excellent. The adaptive screen-refresh technology does a nice job of keeping everything from fast scrolls to action games looking smooth, and you’ll have no trouble shooting and editing 4K, 30fps video. The Galaxy S22 can also shoot 8K, but the screen stuttered while shooting it so we’re not ready to say this is an 8K-winner.\nLike the rest of the S22 line, the Galaxy S22 is running Qualcomm's Snapdragon 8 Gen 1 in the US, or Samsung’s own Exynos chip in the UK and elsewhere,) and both are backed by 8GB of RAM and up to 256GB of storage. The mobile CPU is snappy and capable, but that storage limit without the ability to add a microSD card is frustrating.\nOverall, if you like Samsung and Android together, this is an affordable and familiar (we see you, Galaxy S21) way to get in at the top of the Galaxy line, making it one of the best Samsung phones and even one of the best Android phones. For those who want a 5G Samsung Galaxy but want to pay hundreds less, they should look at the Galaxy A Series, including the attractive Galaxy A53.\nIf you're looking for the perfect Samsung Galaxy S22 audio partner, you may want to check out our Samsung Galaxy Buds 2 Pro review.\n"
    },
    "Scuf Reflex Pro review - Highly customizable but costly: Pimp my pad": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Scuf Reflex Pro is a noticeable improvement on the DualSense controller upon which it’s built. Unlike some third-party PS5 controllers, it keeps everything that makes Sony’s official gamepad special and it adds a vast array of customization options. However, the high price for what’s on offer makes it hard to recommend to general audiences, given some upcoming alternatives. \n\nPros\n\n+Four remappable paddles work well+Lots of customization options+The grip feels great \n\nCons\n\n-Premium price tag-Middling battery life\n",
        "review": "You want a custom-designed PS5 controller\n\nIf you’ve dreamed of a particular color combination with your controller, then you’re getting excellent build quality and a vast array of options here\nRemappable paddles are essential for you \nIf you want to free up those face buttons then the paddles provide an excellent way to keep your hands where it matters in competitive gaming \n"
    },
    "Ulefone Power Armor 16 Pro review: An inexpensive rugged phone with some unique options": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "An inexpensive design that offers a few unique options. It’s heavy, underpowered and has a speaker designed to annoy others, but it’s cheap enough to take on an adventure and not be overly concerned about what happens to it.\n\n\nPros\n\n+Android 12+9,600 mAh battery+IP68 and IP69K+Endoscope option (no, really)\n\nCons\n\n-Intentionally loud-Heavy and Underpowered-Only 4G-Accessory port\n",
        "review": "We’ve seen several Chinese phone makers going after a particular slice of the rugged smartphone (opens in new tab) market, and the Ulefone Armor 16 Pro is playing to that specific audience.\nMaybe in Asia, people who party down at the beach each night are a substantial number, but that is what this design seems best able to please.\nWhere on other phones, the cameras or processing power is the primary focus, the back of this design is dominated by a speaker that the makers claim can generate 122db.\nJust to be clear, according to UK government advice, noise above 70 dB over a prolonged period of time may start to damage your hearing. And a loud noise above 120 dB can cause immediate harm to your ears. That’s potentially permanent damage, not just temporary deafness.\nFor those thinking that hearing is a lifestyle choice, this phone also sports a vast 9,600mAh battery so the disco can keep going, a large 5.93-inch display, IP68/IP69K dust/water resistance, and multiple 16MP cameras.\nGetting all that phone and protecting it inside an abuse-resistant shell has elevated the weight of this phone to a whopping 405g, making it the ideal weapon of choice if your bassline overdrive doesn’t dissuade bandits or zombies.\nAs with most rugged designs making it fully waterproof becomes increasingly difficult since the USB-C port needed for charging is under a rubber plug. Ulefone has provided pogo pins on the rear that can be used instead of the port, although these can’t give power to other devices like that port.\nOther than its mass and sonic damage potential, the main weaknesses of this design are a processor and GPU that aren’t ideal for gaming and limited RAM and storage by current standards.\nBut at well below $200 and some unique accessories, like an endoscope camera, some customers might find this hardware remarkably useful and great value for money.\n"
    },
    "iPhone X review: The rebooted iPhone we'd been waiting for": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The iPhone X was a huge gamble from Apple, yet one that really paid off six months into our testing. Losing the home button and altering the design was a dangerous move, but one that was sorely needed after years of similarity and the premium design, extra power, all-screen front mix together to create - by far - the best iPhone Apple's ever made. It's impossible to give a perfect score to something that costs this much - but this is the closest to smartphone perfection Apple has ever got.\n\nPros\n\n+Great screen+Premium, strong design+TrueDepth camera is powerful\n\nCons\n\n-The most expensive flagship phone around-Metal rim can scuff without case\n",
        "review": "It’s almost pointless to discuss the iPhone X price – it launched as the most expensive flagship phone on the market, but iPhone users are more willing than most to look past cost. \nBut, while the focus here is going to be on the technology, we still need to at least mention the price and release date. It's out now, having launched worldwide on November 3 2017. The price - at least at launch - was harder to swallow. \nAt launch, the iPhone X cost $999 / £999 / AU$1,579 for the basic, 64GB model. If you wanted the larger 256GB model it cost $1,149 / £1,149 / AU$1,829.\nSince then of course numerous newer models have landed, and Apple has discontinued the iPhone X. You can still find it at third-party retailers, but usually only refurbished models. The prices here vary but this has dropped from a high-end price to more of a lower mid-range one now.\n"
    },
    "Samsung Galaxy Z Flip 4 review: Samsung tightens its grip on the foldable clamshell crown": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Samsung has addressed some of the Z Flip 3's biggest pain points with its 2022 successor; mainly by way of a larger battery that fits into a more compact form factor, but there's still plenty of room left for further improvement. Price versus performance remains unmatched in the market, especially when you consider this is still one of the only water-resistant foldables out there.\n\nPros\n\n+Larger battery & faster charging+Great long-term software support+Impressively compact design+Excellent performance\n\nCons\n\n-Occasional camera inconsistencies-Minor year-on-year upgrades-Battery life underwhelms-Still highly priced\n",
        "review": "Samsung didn't reinvent its clamshell-style foldable, but the Samsung Galaxy Z Flip 4 does all that it needs to do for the company to hold onto its foldable crown.\nSamsung's mid-year Unpacked event delivered everything we expected. We got new Galaxy Buds 2 Pro, a duo of smartwatches across the Galaxy Watch 5 and Galaxy Watch 5 Pro, and a pair of foldables in the Galaxy Z Fold 4 and Galaxy Z Flip 4.\nAt first glance, both new foldables look like their respective predecessors, with the Z Flip 4 rocking a familiar two-tone clamshell form factor, a dual rear camera, and an external cover display. So what is new?\n\nFor the Fold 4 and Flip 4, iterative refinement seems to be the name of the game, but that's especially true for the Flip. At a glance, it looks and handles almost identically to its predecessor.\nSamsung, however, has been keen to highlight the influence of user feedback and how that dictated what areas of the Z Flip formula the company focused on in refining 2021's still-compelling Samsung Galaxy Z Flip 3.\nThe Samsung Galaxy Z Flip 4 may look and feel like its predecessor, but it's dressed up with a smattering of small improvements that demonstrate Samsung's ability to listen to feedback.\nExisting Z Flip 3 owners shouldn't feel left behind, based on the additions and enhancements its successor offers. For anyone else looking to make the move to a modern foldable, even with the slight year-on-year price hike in some markets, the Z Flip 4 looks like the best foldable for the price.\nSamsung has left plenty of wiggle room for the Flip 5 (or whatever it'll be called), however. And bigger camera hardware advancements, higher resolution displays, dust resistance and faster charging are all areas it'd be great to see further improved.\n"
    },
    "Nothing Phone 1 review: Made to start a conversation": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "At first blush, the appeal of the Nothing Phone 1 rests on its standout design and the strength of its story. The company clearly learnt lessons from its first product and the level of polish applied to the Phone 1 surpasses expectations, while unique features like its transparent back and glyph lighting marry novelty and functionality in a way that's absent from most other phones.\n\nPros\n\n+Clean Nothing OS Android-based user experience+Head-turning transparent design and glyph lighting+Good price / performance balance\n\nCons\n\n-User interface requires refinement-Older, mid-range chipset might put some off-Underwhelming battery life\n",
        "review": "Reading this, you're either here curious about who Nothing is and what the Phone 1 brings to the table compared to more well-known offerings, having never heard the name before or you're already clued-in on the story of the London-based startup and the existence of the Phone 1, wondering how the company's quick cultivation of talent and hype manifests when distilled into a smartphone.\nThe Phone 1 is Nothing's second ever physical product released in its short existence, following on from 2021's Ear 1 true wireless earbuds and preceding the Nothing Ear (Stick) wireless earbuds, which arrived in October 2022.\nThose inaugural buds set the tone for the kind of products the company aspires to make, defining a clear design aesthetic for both the brand and its wares that's been carried through to the Phone 1 and beyond.\nAhead of launch, Nothing CEO and co-founder Carl Pei (of OnePlus repute) stated early on in the Phone 1's development that it was being made to help inject some joy back into the mobile market. So does it fulfill its purpose?\nNow that the Phone 1 is here, it's clearly been made using more than just a check-list of me-too features; with a rear design unlike anything else on the market, functionality – like the Glyph Interface lighting on its back – that offer intrigue and whimsy, and an otherwise well-rounded and capable pairing of software and hardware.\nSure, the cameras aren't class-leading and battery life leaves something to be desired, but on a technical level, it's more than capable of serving as your everyday companion and it's far more interesting than practically every other phone around its price point.\n"
    },
    "Samsung Galaxy SmartTag Plus review: Convenient tracking for Samsung owners": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Samsung Galaxy SmartTag Plus is a cheap way of tracking anything you want to attach it to. That's providing you have a Samsung Galaxy phone already and want to embrace the ecosystem.\n\nPros\n\n+Long battery life+Compact size+Can control smart home devices\n\nCons\n\n-Only works with Samsung phones-Not the lightest of tags-Less water resistance than some\n",
        "review": "For those of you that have a habit of losing things then the Samsung Galaxy SmartTag Plus will be an instantly appealing gadget to you, provided you use a Samsung smartphone running AndroidOS 8 or later.\nThese item trackers can be attached to a keyring or tucked inside a bag or a wallet, and then once you’ve paired them with a compatible smartphone you’ll be able to use your handset to hunt your tagged things down if they go missing. If they’re lost around your home you can rely on the Ring feature that makes the Galaxy SmartTag Plus let out a continuous siren until you hit stop, and you can use the Search nearby tool to know how strong the signal from the tag is – like a high-tech version of Hot and Cold.\nIf your smartphone supports Android 11 or later, and comes with ultra-wideband (UWB) support (which includes devices like the Samsung Galaxy S21 Plus, Samsung Galaxy S21 Ultra, and the Samsung Galaxy S22 family of products) you’ll be able to find the tag with much more high-tech tracking that includes onscreen directions to your lost item. \nThis feature is super helpful and only comes with the more premium Samsung Galaxy SmartTag Plus tracker which sells for $39.99/£39.99 (around AU$55); those of you content without UWB tracking can save some cash and opt for the cheaper (but less feature-full) Samsung Galaxy SmartTag for $29.99/£29.99 (roughly AU$40).\nThese trackers are also super easy to set up using the SmartThings app too, and thanks to this app you can unlock a few extra features that aren’t offered by typical trackers. This includes the surprisingly convenient option to use a button on the tag to switch your Philips Hue lamps on and off.\nSamsung’s SmartTags have their faults though. Chiefly they’re only compatible with Samsung devices – so if you have a different Android smartphone or one of the best iPhones you’ll be out of luck. That said if you use Samsung and plan to stick with it then the Samsung Galaxy SmartTag Plus tracker could be the best option for you.\n"
    },
    "Samsung Galaxy A53 review: Attractive but slow": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "An attractive phone with a good-looking screen and impressive cameras for the price, the Samsung Galaxy A53 offers good value for money overall; but with its slow charging and stuttery performance, it’s not for everyone.\n\nPros\n\n+Good cameras for price+Attractive design+Good-looking screen\n\nCons\n\n-Slow to charge-Slow to navigate-Battery life could be better\n",
        "review": "You’re about to see a whole lot of two different adjectives: ‘attractive’, and ‘slow’. While conducting the testing for this Samsung Galaxy A53 review, we found many aspects of the phone could easily be described by one of those two adjectives.\nThe A53 is, for all intents and purposes, a 'lite' version of the Samsung Galaxy S22. Samsung wouldn't call it that, but it makes sense to us because the Galaxy A series typically brings lots of the Galaxy S features to a lower price point. The A53 is a great example of one of the best Samsung phones in an more affordable package.\nLike the Galaxy S22 family members, the A53 has an attractive screen. In fact, since the Samsung Galaxy S22 Plus and the A53 have the same resolution and refresh rate, with only a 0.1-inch difference in screen size, we imagine that most people won’t be able to distinguish the A53 from the larger Galaxy S22 Plus without comparing both phones side-by-side.\nIt’s possible the A53 provides the best camera experience you can get on a phone at this price point – its four rear snappers combine with a long list of photography and videography modes that Samsung offers to let you take some surprisingly attractive pictures.\nSure, the A53's snaps won’t compare to those produced by the Galaxy S22 Ultra, but pictures were bright and vibrant, perfect for sharing on Instagram or other social platforms. That was the case for selfies too, and at a significantly cheaper price than Samsung's top phones.\nAnd since we’re sharing our favorite things about the phone, let us also mention what other people loved: the look. While we were testing the peach version of the phone, people constantly told us how good it looks. And we mean constantly – everyone who saw it had to let us know how attractive they found it. Admittedly, this isn’t scientific proof that the peach A53 is a good-looking phone, but we’d say it’s pretty convincing that this handset is attractive.\nYou can get all of that for a relatively low price tag: the handset starts at $449.99 / £399 / AU$699, which leans toward ‘affordable’ in the mid-range market. Phones at this price usually have a few strong suits and a few weak ones, and that’s the case here.\nFirst of all, the Galaxy A53 is slow to charge, with its 25W charger taking up to two hours to fill up the device. Considering that cheaper phones than this come with much, much quicker powering – the Redmi Note 11 Pro Plus is more affordable and has 120W charging, for example – 25W feels far too slow.\nAnd speaking of slow things, the phone itself drags from time to time. It didn’t stop us from doing what we needed to do on the phone, but frequently, the device stuttered, with apps freezing or scrolling slowing – more so than on other handsets at this price, which is why we raise the issue.\nIn this two-minute review, we used the words ‘attractive’ and ‘slow’ five times each. Those terms really do embody the device: its design, display and cameras all tick the ‘attractive’ box, but the charging speed and performance are decidedly slow.\nIf you’re ok with that, this mid-range Samsung phone should be on your wish list. But if you prefer performance over photography or want something a little faster, there are better options out there for you.\nAlternatives that you might want to consider include the aforementioned Redmi Note 11 Pro Plus, the cheaper Samsung Galaxy A33, and - if you're not on such a tight budget - the premium Samsung Galaxy S22, among others.\nIt's worth noting also that we might see the Samsung Galaxy A54 within the first few months of 2023, so if you're not in a hurry then it could be worth waiting to see how that turns out.\n"
    },
    "Asus Zenfone 9 review: A small phone with a big price": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Asus Zenfone 9 has a lot to like, but it’s ultimately disappointing. It has an easy-to-use small form factor and 3.5mm headphone jack, but its screen is too small to justify the powerful processor, the camera experience is mixed and the price is just too high for what you’re getting.\n\nPros\n\n+Easy to use one-handed+Neat navigation tricks+3.5mm headphone jack\n\nCons\n\n-Price too high-Only two rear cameras-Unnecessarily high-end specs\n",
        "review": "It took a week of testing for this Asus Zenfone 9 review before we realized that our struggles to ‘get’ this phone stemmed from the device’s own identity issues.\nThe Zenfone 9 is a cheap phone playing dress-up as a premium one; it’s two middling phones standing on each others’ shoulders in a trench coat and pretending that they’re comparable to the Samsung Galaxy S22 or iPhone 14.\nThe phone simply shouldn’t cost as much as it does. Asus has given it a similar price to flagships from Samsung and Apple as well as the Xiaomi 12 and OnePlus 10 Pro, but the user experience just doesn’t justify this cost.\nThat’s most evident in the camera - there’s a 50MP main and 12MP ultra-wide, but no third lens like Samsung’s telephoto or Xiaomi’s telemacro in their respective flagships. This means the photography experience is more limited than it is in other phones at this price.\nThe chip is also an issue. Asus packs in the top-end Snapdragon 8 Plus Gen 1, which is great for things like gaming or video editing - in theory.\nHowever, one of the Zenfone’s key features is its small size - that makes it easy to use one-handed, and truly pocket-sized… but when the display is this small, who’s going to be buying the phone for gaming anyway? The chip just doesn’t make any sense, and the phone would have been better off using a mid-range processor.\nThe phone is just ‘fine’ in many other aspects too - a statement that wouldn’t be as scathing if it wasn’t for the price. The battery life is fine, the display is fine, the front camera is fine. Fine, fine, fine - but not great.\nThis is a shame because on the surface, there are things to like about the phone. Its small form factor is fantastic for people who find modern phones too big, as you can easily reach all parts of the phone’s display, and pocket the device without trouble.\nToo few brands are making small phones these days - possibly because too few people are buying them but there’s definitely a vocal audience for compact devices like this.\nThe phone also has some neat navigation tricks. You can double-tap the back of the phone or swipe up or down on the power button and you can map these shortcuts to certain tasks.\nPlus, the phone has a 3.5mm headphone jack - how many premium phones have one of those nowadays? Not many!\nWith these pleasing features in mind, it’s hard not to be disappointed that the Asus Zenfone 9 has so many rough edges.\nIt’s not competitive in terms of price or specs and that makes it very hard to recommend, but people who desperately want a small phone might look past those issues - or consider waiting for the Asus Zenfone 10, which might fix them when it launches, probably around mid-2023.\n"
    },
    "Doogee S96 GT review: A new flagship rugged design from Doogee": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The S96 GT is a rugged design for those that want a better platform and a lighter phone but are willing to trade battery life to get that. A more practical design than the S89 Pro, although it still has some of the same weaknesses.\n\n\nPros\n\n+Powerful SoC+4K video capture and Night vision camera+Wireless charging+Inexpensive\n\nCons\n\n-Not 5G-Odd resolution screen-Still a hefty device\n",
        "review": "If we can ignore the gold paint on our review hardware, the Doogee S96 GT (opens in new tab) is one of the more elegant designs that Doogee has released.\nIt’s comfortable to handle even if it's on the heavy side, and the smooth underside allows for wireless charging.\nWhere this design shines is through the MediaTek G95 SoC, a chip that delivers plenty of performance together with an effective GPU. This silicon can deliver up to 50% more performance than the G85-powered phones and puts the S96 GT within striking distance of the Snapdragon 480  phones, such as the AGM Glory GS1.\nWith that power combined with 8GB of DDR4 RAM and 256GB of flash storage, this gives the S96 GT a premium phone feel and plenty of computational grunt to exploit the excellent camera sensor selection.\nFive camera sensors include a 48MP main rear sensor alongside supporting cameras for wide-angle, macro and night vision modes. Even the front sensor is 32MP, providing the best quality selfies for those that can cope with that level of inspection.\nThis is one of the few recent rugged designs that can capture 4K video on the rear sensor, and it even has a basic slow-motion video mode (720p).\nWhile the cameras are great, they could be even more wonderful if Doogee would take the time to create a more impressive camera application to exploit this potential.\nBeing less chunky than the Doogee S89 Pro (opens in new tab) has been achieved by reducing the battery capacity to only 6350 mAh, though this does shave about 200g off. That’s about half the battery capacity of the S89 Pro, making the S96 GT less suitable for that week away in the wilderness, away from a charger.\nThe other issue that confronts this design is that it only offers 4G LTE and not 5G, a technology Chinese phone makers seem reluctant to embrace for numerous reasons.\nIf you are willing to accept those limitations, the S96 GT isn’t an expensive phone and represents excellent value.\n"
    },
    "Blackview BV7100 review: An affordable heavy metal mobile": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "An affordable design that delivers ruggedness and functionality. The cost reduction manifests itself in the camera sensors and RAM capacity. Not many would pick this as their main phone, but useful for camping.\n\n\nPros\n\n+Affordable+Huge battery+Robust\n\nCons\n\n-Heavy-Not 5G-Only 1080p video capture\n",
        "review": "Blackview has produced some excellent rugged designs, and the BV7100 is a notch up in terms of the quality of construction.\nThe chassis of this phone appears to have been machined from a solid block of alloy that gives it significant solidity but also makes it weigh a hefty 430g.\nBut the construction isn’t the whole story on the weight because the other factor in that equation is the enormous battery Blackview put inside it.\nThere may be a bigger battery out there, but 13,000mAH in the BV7100 is beyond all the recent rugged phone designs we’ve encountered.\nTo get a battery of that capacity charged isn’t easy, though Blackview did enable 33W fast charging on this device, and the USB-C port on it can transfer power to other devices using an OTG cable if required. Total charging time is around 200 minutes using the included charger, but because the battery is segmented into two cells, a half-charge can be achieved in a little over an hour.\nWhen fully charged, the BV7100 has a standby specification of an incredible 1152 hours or 48 days.\nObviously, more active use reduces the running time, but Blackview is still claiming 70 hours of music, 50 hours of calling and 15 hours of video playback.\nLike many Chinese phone makers, Blackview uses the Helio G85 MediaTek SoC alongside 6GB of DDR4 RAM combined with up to 4GB of eMMC 5.1. The G85 CPU is the same that we saw in the AGM H5 Pro (opens in new tab) and Ulefone Armor 14 Pro (opens in new tab), and it combines two performance cores with six efficiency designs with a maximum clock speed of 2GHz.\nThe SIM tray is a dual type that allows either two Nano SIMs to be used or one with up to a 1TB MicroSD card. But the slightly disappointing aspect of the mobile comms on this phone is that it is only capable of 4G and LTE, and not 5G.\nThe BV7100 isn’t a bad phone, though the relatively low pricing has an impact on what you can realistically expect from this device in terms of features.\n"
    },
    "Motorola Moto G62: Budget 5G and a smooth screen": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Moto G62 is a solid, good-value 5G phone. It’s a sound buy if you’re happy to make do with its pedestrian camera and limited gaming performance.\n\nPros\n\n+A friendly route to low-cost 5G+Solid stereo speakers+Decent 120Hz display+Generous storage\n\nCons\n\n-Slow charging-Often produces anemic photos-Somewhat limited maximum display brightness\n",
        "review": "The Motorola Moto G62 is an affordable 5G phone with a reasonably large screen and stereo speakers. These three characteristics make it seem made for entertainment, rather than just the basics. \nIt’s a rock-solid phone for people who want an upgrade that opens them up to the 5G mobile internet speeds that are now standard in phone contracts in many countries. The Moto G62 also has a few of the characteristics that have made the Moto G series phones easy to recommend for so long. \nOverall, battery life is good, the design is unlikely to turn anyone off, the software is tasteful and uncluttered, and the price is right. \nCompromises naturally creep in when you deal with a tightly restricted budget, though. The Moto G62 does not have a particularly impressive camera array. Night images are poor, daytime pictures can look undersaturated or at least a little cool, and video is limited. \nThe Moto G62 is similarly so-so for gaming, as its Snapdragon 480 Plus is a poor fit for graphically-intensive titles, like Fortnite. \nIn these two areas — the camera and high-end gaming — you’ll get much better results if you spend a little more money. However, if you’re interested in the Moto G62, it’s probably because you don’t want to spend more. If that’s the case, this phone is one of the best to buy right now.\nCheck out our rundown of the best Motorola phones and best cheap phones right now for more insight and alternatives.\n"
    },
    "Lower price, lower temperature? Sony Xperia 5 IV review: Can Sony's compact flagship for 2022 keep its cool in the face of stiff competition?": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Sony's Xperia 5-series has long been a fan-favorite, cramming some of the best bits from the larger Xperia 1-series into a more compact body – and the Xperia 5 IV gets a lot very right. Its battery lasts for ages, its screen is glorious, and its cameras are beautifully tuned for pros who want to tinker. There's still a heat issue when taking photos and shooting video, and the phone doesn't have the latest in 2022 power of the Xperia 1 IV's periscope zoom. Its auto mode also misses the mark in the dark – so won't be for casual point and shooters. Still, it's a mighty, compact option that's a great buy for a certain kind of user.\n\nPros\n\n+Premium design and feel+Excellent quality display+Long-lasting battery+Wireless charging\n\nCons\n\n-The camera causes overheating-Pricey for a 128GB phone-Poor low-light camera-No periscope zoom\n",
        "review": "The Sony Xperia 5 IV is a great, compact phone – one of the better options for anyone who wants an easy-to-handle, classically styled, premium device. Its design benefits from a frosted glass back which is rich to the touch and does a great job of repelling fingerprints, and the phone's flat sides are comfortable to hold too. \nSony's a traditionalist, and that ethos applies to its phone design. There's a headphone jack and a camera button, and the overall style and design language haven't changed much over the years. It's pretty obvious why Sony fans are so loyal. Sony is very consistent compared to many other brands whose year-on-year launches barely resemble one another.\nSony's also consistently punchy with its prices, and the Xperia 5 IV costs $999 / £949 / AU$1,399. That's less than an iPhone 14 Pro, but more than a Pixel 7 Pro. Thankfully, the Xperia's design quality doesn't undermine its price tag.\nThe Sony Xperia 5 IV's screen is something of a standout for its size. Normally, smaller screens don't pack the quality larger ones do, but the compact Xperia's is a bright, bold, deep, vibrant canvas that makes the content displayed on it look great.\nThe 21:9 aspect ratio won't be for everyone, and the fact Sony misses a trick with no dynamic refresh rates also holds it back on paper, but in the flesh, the 120Hz panel is smooth, brighter than its predecessor, and supremely customizable.\nThe cameras on the Sony Xperia 5 IV are, in a break from tradition, dialed back when compared to those of the 1 IV. You still get the same 12MP main and ultra-wide cameras, but the telephoto which featured a continuous zoom is now a fixed 60mm, 12MP camera. That means roughly 2.5x zoom, vs up to 5.2x on the Sony Xperia 1 IV.\nScaled-back specs don't mean you can't grab excellent photos from the Xperia 5 IV, but it misses the mark when the lights drop. Sony does add a bunch of photo and video modes geared towards experts and enthusiasts, but for most point-and-shoot mobile owners, you might be better off with a cheaper alternative like the Pixel 7.\nIt's also worth noting, the camera on the Sony Xperia 5 IV gets hotter than we'd like it to, and shuts down after around nine minutes of 4K 120fps recording on a cool day, and five minutes on a warm day.\nStrangely, performance wasn't an issue when it came to heat management. The Snapdragon 8 Gen 1 kept its cool when gaming, even at high graphics settings. The phone didn't drop too many frames and in turn, makes for a nifty gaming device.\nRunning Android 12, Sony hasn't quite got the latest version of Google's mobile OS onboard, but this is promised soon, app support is excellent, and Sony loads up some customizations like Side Sense to make everything feel more... Sony. Stock Android fans will be a little underwhelmed with the lack of Material You and other stock highlights, but Sony fans should know exactly what to expect.\nThere's 128GB of storage, and given the Sony Xperia 5 IV's price, we would have loved to see it ship with 256GB as standard, but the inclusion of a microSD card slot is some compensation.\nAs for the battery life of the Xperia 5 IV, it's excellent. By ditching the periscope camera, Sony frees up space to include a large 5,000mAh capacity cell, helping the phone last a full day and then some when the screen is set to 60Hz, or a comfortable full day when set to 120Hz.\nAdd 30W wired charging to the mix, as well as wireless charging, not to mention Sony's smart battery care tech, and the Xperia 5 IV is feature-packed, even if it isn't the camera zoomer its larger sibling is.\n"
    },
    "Doogee S89 Pro review: A Batman phone for the darkest knights": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "You will either love or hate the styling, but the basic phone technology here is solid. Plenty of RAM, storage and battery capacity advantages are offset by a questionable GPU and the sheer bulk of this construct. Not the most elegant phone Doogee has ever made.\n\n\nPros\n\n+Affordable+Huge battery+Nightvision camera\n\nCons\n\n-Heavy-Not 5G-GPU is lacklustre\n",
        "review": "Doogee has a good reputation for making, but affordable if over-engineered ruggedised phones, and the S89 Pro doesn’t stray far away from those paths.\nThis already substantial design is made even larger by a hard plastic protective case that comes preinstalled. This serves to enhance a ‘Bat’ motif that the S89 Pro has that might, from certain angles, be associated with Batman. We just hope they have a licencing deal with DC or Warner Brothers to justify using that trademark in this context.\nMore certain is that this is the first Doogee design to ship with a 65W charger, something that the 12,000 mAh battery will need to recharge quickly. According to Doogee, using this charger the phone can get 15% of its power back in 20 minutes, which would infer that a full charge would take around 2 hours and 15 minutes.\nThe downside of having so much battery is that this is a heavy phone that exceeds 750g, making it not something you would ideally put in a jacket pocket.\nAvailable in Volcano Orange and Classic Black colour schemes, and back of the phone has two glowing “DOOGEE Eye” used to indicated a message when the phone is placed face down. And, you can set the colour of these eyes and how they animate.\nInternally, this is yet another Mediatek platform, the P90 octa-core processor with the IMG PowerVR GM 9446 GPU. While this isn’t the most powerful SoC that Mediatek has made or IMG GPU, the platform is power efficient and workable for most tasks other than serious gaming.\nA highlight is the camera cluster that combines a 64MP main sensor with F/1.8 optics with two 8MP Samsung-powered sensors for Wide angle and macro photography. And, if those weren’t wonderful enough, it also has a 20MP Sony IMX350 sensor set for night vision mode.\nFor those that like to make video calls, the front sensor is a 16MP one made by Samsung that’s perfect for selfies along with face-time.\nCaptured images and video can be viewed on the 6.3\" FHD+ DotDisplay, protected with  Corning Gorilla Glass that has a natural resolution of 1080 x 2340.\nAs you might already suspect, this phone is fully IP68 and IP69K rated, enabling it to cope with being immersed in water to a depth of 1.5m for up to 30 minutes, and dropped onto concrete from 1.5m without breaking.\nTo help with the waterproofing, Doogee supports wireless charging on this device, so you don’t need to keep pulling the rubber plug out that covers the USB-C port.\nOverall, an impressive phone from Doogee that ticks many boxes but suffers from the physical scale and weight of this bulky hardware.\n"
    },
    "Motorola Razr 2022: Honing its skills": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Motorola Razr 2022 shows that the company recognizes the challenges its predecessors have faced and addresses them all to make a truly worthwhile addition to the series; even if it's not quite as competitive as its main rival.\n\nPros\n\n+Good battery life & rapid charging+Rich user experience w/ useful features+Barely-there display crease\n\nCons\n\n-Performance and camera jitters-Limited update support-High price\n",
        "review": "After a two-year hiatus, Motorola serves up its third-generation foldable Razr. It's a slightly different beast than its predecessors that highlights the company's awareness of – and ability to address – the most prominent pain points of the previous two models; delivering across-the-board hardware improvements while also lowering the price.\nThere's something of a loss of identity to the Razr 2022's design; ditching the iconic chin of the last two generations in the pursuit of a cleaner and better-proportioned layout. However, not everyone will appreciate the jump in size – driven by the shift from a 6.2-inch display to a much larger 6.7-inch notch-free Full HD+ pOLED panel.\nIt's great for split-screen multitasking and media – thanks in part to HDR10+, DCI-P3, and 10-bit color support. The switch from plastic to UTG (ultra-thin glass) between generations, paired with the most refined take on the modern Razr series' ingenious teardrop zero-gap folding design, makes for one of the hardest-to-see and feel creases on an inward-folding phone's screen yet.\nThe display's 144Hz peak refresh rate is also well-suited to gaming, supported by a powerful Snapdragon 8 Plus Gen 1 chip, although the phone stutters unexpectedly from time to time, despite the horsepower available; which could suggest poor optimization. It also comes with 8GB (as tested) or 12GB RAM.\nSoftware-wise, the Razr 2022 arrives on an Android 12-based user experience, which is a little behind the times, as Android 13 is already out in the wild. It's an omission that particularly stings, as, despite the phone's premium feel, Motorola has only committed to a minimum of two years of OS updates (one of which would be Android 13).\nThe silver lining is that Motorola's typically-clean user experience and well-thought-out assistive features are available in spades, with a particular highlight being Moto Gametime (which is where you can unlock that peak 144Hz refresh rate, while gaming). The breadth of functionality available from the Razr 2022's external Quick View display is impressive too – if a little unpolished – with the same to be said for the new Flex View functionality; which lifts a page right out of Samsung's Galaxy Z series' playbook.\nDespite the phone's 3,500mAh battery capacity sounding relatively small compared to a lot of modern flagships, the Razr 2022's longevity surprised in real-world use; making this a far more reliable all-day device than its predecessors. This battery capacity is paired with astoundingly-quick partial charging (usually reaching over 90% charge in the first 30 minutes) from what you'd expect would be more pedestrian 30W speeds. No wireless charging, though.\nOn paper, the camera experience is far more competitive than anything we've seen from previous models; with a secondary ultrawide finally joining what was once a lone primary camera. The Razr gives you big numbers too: a large 50MP wide sensor with OIS (optical image stabilization), twinned with a 13MP ultrawide that doubles as a macro snapper, while the in-display selfie camera uses a 32MP sensor to capture 8MP pixel-binned shots.\nWith features like 8K video capture, dual capture, and the Razr-exclusive Tripod View, there's a lot of versatility to the camera experience; if only image quality could rise to meet it. The camera system has its moments, but image processing problems, underwhelming low light performance, and inconsistencies in color between the main and ultrawide sensors hold it back from where the photography should be for a device at this level.\nAs mentioned up top, it's clear that Motorola is taking its efforts in the foldable market more seriously than ever before and the result is the most competitive Razr to date; helped by expanded functionality, improved performance, and a lower price.\nIf the Samsung Galaxy Z Flip 4, is currently the standard by which other clamshell foldables are measured, the Razr 2022 comes the closest and has equally as broad an appeal (sorry Huawei P50 Pocket). However, a lack of polish, a bulkier design, limited update support and absent features (like wireless charging) hold it back from being at the head of the pack.\nIt still finds a place on our rundown of best foldables and best Motorola phones, however.\n"
    },
    "AGM H5 Pro review: A phone designed to annoy everyone around you": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Plenty of phone for your money, but the positioning of the cameras and a few other quirks slightly take the shine off the H5 Pro. A phone for those who assume everyone likes their musical choices, like DJs.\n\n\nPros\n\n+Good camera sensors+IP68 and IP69K+Deafening speaker\n\nCons\n\n-Gigantic phone-Lacks 4K video capture-Only 4G\n",
        "review": "Back in June 2022, we reviewed the AGM Glory GS1, a fully featured ruggedised smartphone that came at a premium price.\nThe AGM H5 Pro is a new design that borrows heavily from the Glory, specifically the Glory Pro version, to deliver something with a slightly different flavour but in familiar packaging.\nWhere the Glory series has more of an industrial use profile, the H5 Pro comes with more lifestyle-pleasing features like a waterproof loudspeaker and an animated LED light ring.\nIt’s certified with IP68, IP69K and MIL-STD-810H standards, giving it the potential to survive a drop of 1.5m onto a hard surface and 1.5m underwater for up to 30 minutes. But, this assumes that the rubber plugs covering the USB port are in position.\nThe core SoC is an Helio G85 sporting an octa-core chipset with 8GB RAM and 128GB storage, and you can expand storage using a MicroSD card in the SIM tray.\nThat’s a powerful platform, and when combined with the 7000mAh battery, it will operate for up to 400 hours on standby, output 150 hours of non-stop music and 32 hours of video.\nThe main rear camera uses the excellent 48MP Samsung S5KGM2SP sensor with  f1.79 optics, and alongside that are a macro sensor and night vision. Front-facing captures use the reliable 20MP Sony IMX376 sensor.\nAs with many modern Chinese-made phones, the H5 Pro has excellent specifications and, for around $320, represents good value for money.\nThe only caveats are that this is a monster phone with a  6.5-inch screen that won’t easily fit into a trouser pocket, and the dual SIMs only support 4G LTE, not 5G comms.\nAnd, if someone near you has this phone, and you don’t like their musical tastes at 109 dB, then it might prove triggering.\n"
    },
    "Google Pixel 7 Pro review: The Google Pixel 7 Pro is simply a brilliant phone at everything it does": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Google Pixel 7 Pro is every bit as good as the best smartphones from Apple and Samsung. It looks great, takes amazing photos, and stands out in a crowd. Google made lofty promises for this phone, and it delivers on the most important, even though some features aren’t as good as we’d hoped (and others have yet to arrive). Google implements software features as art, and the Pixel 7 Pro improves the smartphone in areas we’d forgotten needed improvement. \n\nPros\n\n+Intuitive and easy to use+Photo Unblur truly fixes older photos+Snappy and responsive interface\n\nCons\n\n-Lacks the deep feature set of best competition-Battery and charging time could be better-Macro Focus didn’t blow us away\n",
        "review": ""
    },
    "Google Pixel 7 review: Great-value Google smarts": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "You feel the absence of features that are exclusive to the Pixel 7 Pro, but what the standard Pixel 7 does offer – from its distinct design to its creative and capable camera and intelligent user experience – make it a great value-for-money flagship buy.\n\nPros\n\n+Unique color options and design+Same Tensor G2 performance as Pixel 7 Pro+Great camera with creative features\n\nCons\n\n-90Hz display feels dated at this level-Lacks the zoom camera of the Pro-Faster charging would be nice\n",
        "review": "Following last year's landmark Pixel 6 series, the Pixel 7 range looks like an iterative update by comparison, but it doubles down on what makes Google's phones stand out.\nLike the Pixel 7 Pro, the Pixel 7 arrives with Google's latest Tensor G2 chipset, which, paired with Google's own take on an Android 13, delivers a satisfying user experience, with everyday tasks made that little bit easier.\nWhile Google's Tensor platform doesn't usually compare all that favorably in side-by-side benchmarks with equivalent flagship processors, that's because it's built with a different focus in mind: AI and machine learning. This remains true for the new Tensor G2, and it enhances a number of facets of the Pixel 7 user experience, from camera quality to call quality, speech recognition and beyond.\nThe Pixel 7 sports a design that, while divisive, feels considered and premium. The cameras sit within an imposing aluminum band that helps the phone stand out from the crowd, especially in its price range, and the smaller 6.3-inch display size and thinner bezels (compared to the Pixel 6) mean the Pixel 7 is more comfortable to hold, and more pocketable, than before.\nThe biggest shortcomings are most notable in areas where this phone, by design, trails behind the Pixel 7 Pro, with its slower 90Hz peak refresh rate display (versus 120Hz on the Pro) and the absence of a dedicated telephoto camera chief among them.\nEven so, the user experience feels polished, the AI-supported features are unique and competent, and the promise of more functionality via forthcoming 'feature drops' mean this Pixel is only likely to get better with time.\n"
    },
    "iPhone 14 Pro Max review: The biggest and best of everything in an iPhone": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The iPhone 14 Pro Max is truly the best of everything in the current iPhone world. It’s got the best design, the biggest screen, the best cameras, and the smartest display. You’ll pay for all of that but, if you’re determined to get an iPhone and want the absolute apex device, this is clearly the handset for you. If you can live with a slightly smaller display, and want less weight in your pocket, we might recommend the more compact 6.1-inch iPhone 14 Pro, instead.\n\n\nPros\n\n+Great design and build+Incredible camera quality+Dynamic Island is clever and innovative\n\nCons\n\n-3x zoom leaves you wanting more-Still waiting for ultra-fast charging-Battery life is weaker than last year\n",
        "review": "Ahead of launch, we ran an informal Twitter poll (opens in new tab) on which new Apple iPhone 14 people wanted.\nThe iPhone 14 Pro Max was the clear favorite... and by a wide margin. It’s not just the bigger 6.7-inch display or the potential for more battery life, it seems current iPhone buyers want all the features that come with Apple’s premium handset.\nAnd good news: this is the ultimate iPhone. \nIt’s no more powerful than the identical-but-smaller 6.1-inch iPhone 14 Pro, but noticeably more so than the new iPhone 14 and its big brother, the 6.7-inch iPhone 14 Plus.\nFor the first time in a while, Apple chose to put its best, fastest, and possibly most efficient silicon in just half of its new phones. The iPhone 14 and 14 Plus get the A15 Bionic chip found in the iPhone 13 Pro and 13 Pro Max (it has one more GPU core than the A15 Bionic in the standard iPhone 13), while the iPhone 14 Pro and 14 Pro Max get the all-new 4-nanometer process A16 Bionic.\n$899 / £949 / AU$1,579 for a 6.7-inch iPhone 14 Plus might sound good on paper, but consumers will, apparently, gladly pay $1,099 / £1,199 / AU$1,899 for the full-featured iPhone 14 Pro Max – what they consider the best iPhone, even in these cash-strapped times. \nAt least Apple and its carrier partners are offering some decent iPhone 14 deals.\nThere are even $1,000 trade-in deals in the US, though Apple and the carriers have to verify the trade-in value – and don’t expect to get that kind of cash for an iPhone 6 or even an iPhone 8.\nIf we’re talking about value, though, the iPhone 14 Pro Max earns its keep with snappy performance, a truly radiant screen that now can reach a sun-beating 2,000-nit brilliance, while also delivering new low-power 1Hz always-on display functionality that’s just there for a quick glance.\nThe thing people will be talking about is the new Dynamic Island. Count us among those who were completely surprised by Apple’s unusual solution for the notch, an ‘island’ of flexible display floating just a few millimeters from the top edge of the screen.\nThis island still contains the front camera (upgraded with autofocus) and sensors for 3D measurement as part of Face ID, but some technology, like the proximity sensor, is now hidden behind the display. What’s left is actually a pair of cutouts – one pill shaped, and one a circle – but with a small area of active screen between them. \nAltogether, it looks like a smaller cylinder and can appear all-black when it isn’t active with some animation or notification. However, it has the remarkable ability to transform based on screen activity and gestures.\nThere is some reasonable concern about what so much swiping across the front-facing camera might mean for selfies, but at least there’s an oleophobic coating to reduce smudges on the lens.\nAn always-on display that can refresh at just 1Hz to save battery has been a long time coming. Apple has been well behind the competition in implementing this feature, but as ever it’s done it in its own way. \nIt’s nice to be able to see the time, date, and information-filled widgets on your iPhone’s screen without having to touch and unlock it - although it does kill the battery somewhat.\nThe upgraded camera array finally brings pixel binning to the iPhone – a favorite feature on numerous Android devices, which combines brightness and color data from four (or more) pixels on the sensor for improved low-light performance and color accuracy.\nFor the main camera, Apple has gone with a 48MP sensor (a far cry from, say, the Samsung Galaxy S22 Ultra’s 108MP sensor), although this is more of a technological advancement than a headline number, as you'll see below.\nThis sensor is, by the way, paired with an excellent lens. You can also shoot in 48MP ProRAW mode, which is great for pro-shooters (you’ll need to turn this option on in the settings).\nThe 12MP ultrawide camera still offers a field of view of 120 degrees, which is 'wide enough' in our books, and the quality is enhanced with a much larger sensor and more focus pixels. This is reflected in brighter and more vibrant wide-angle photos and much-improved macro photography, which also uses the new ultrawide lens.\nApple can’t, however, seem to figure out how to give us more than 3x optical zoom, even as competitors are offering 10x optical and 100x (albeit highly interpolated) ‘Space Zoom’. We would have settled for 5x optical zoom. \nInstead of greater zoom, you get an additional in-between level of 2x optical zoom, which is more useful than it sounds, especially because the zoom is really just employing a central chunk of the full 48MP sensor; no compression, just a marquee from the main sensor that gives you enough information to get closer without losing any quality, as you would with a digital zoom.\nPowering the whole show is the new A16 Bionic chip. It’s an upgrade from the A15 Bionic (which, as mentioned, lives on in the iPhone 14 and 14 Plus), with 16 billion transistors and a smaller, more efficient 4-nanometer process.\nThe benchmarks, and the real-world performance, appear to bear out the strength of this new Apple silicon, which reaches into almost every corner of iPhone 14 Pro Max performance (photos, the always-on display, and the Dynamic Island).\nBetween the new display technology more efficient A16 Bionic, and the size of the 14 Pro Max, we expected more than the 13 hours of mixed-use battery life we got - although this can be improved when removing the always-on display.\nFurther testing indoors with the screen kept on all day and mostly streaming video resulted in essentially double that 13-hour figure, and much closer to Apple’s estimated 29 hours of streaming video performance.\nThis, by the way, is Apple’s first eSIM-only iPhone (in the US, at least – the SIM slot lives on in other markets). It’s weird, but also pleasing to lose the SIM tray, and thankfully the eSIM setup was remarkably easy.\nWhile we could experience the new eSIM, we did not – for obvious reasons – test the new crash-detection feature, nor the new emergency satellite SOS. We did see the latter in action though – more on that in the full review further down.\n"
    },
    "iPhone 14 Pro review: This may be the perfect iPhone": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The iPhone 14 Pro is the sweet spot for the best of Apple’s iPhone technology. This 6.1-inch device isn’t too big, and its front has been transformed with the new Dynamic Island and an excellent always-on display. It maintains the performance lead or rivals with a faster and more efficient A16 Bionic chip, and the updated camera array should please all but the most demanding smartphone photogs. If, however, you need the biggest iPhone screen available, paired with the performance of this phone, you’ll want to go for the pricier 6.7-inch iPhone 14 Pro Max.\n\n\nPros\n\n+Exquisite design and excellent build+High-quality cameras and 48MP main sensor+Always-on display+Clever and impressive Dynamic Island\n\nCons\n\n-Still just 3x optical zoom-No USB-C-Premium price\n",
        "review": "If you’ve come here directly from our iPhone 14 Pro Max review, then let us provide you with a TL;DR: the iPhone 14 Pro is essentially the same as the Pro Max, other than the size and battery life. Practically all specs and, essentially, the respective performance, apply here. This phone is a little cheaper, and more pocketable.\nIf, on the other hand, this is the first iPhone 14 series review you’re reading, buckle up – there’s a lot to cover.\nIn many ways, the iPhone 14 Pro is the best iPhone out there. It has a bunch of fresh new features, and is the first (along with the Pro Max) iPhone in five years without the notch (it has something new!), while an always-on display, improved adaptive-refresh-rate screen, and pixel binning for photography finally bring the iPhone 14 Pro series into alignment with Android competitors.\nNo doubt some of this feels like Apple playing catch-up, but we’re sure Apple doesn’t see it that way – and perhaps it shouldn’t. Apple brings features to its iPhone line when it feels they’re ready, and will best serve users. It’s worth noting that Apple doesn’t turn it to 11 on most of these features. We get more zoom options on the cameras, but not greater zoom range. We’ve got pixel binning, but at four pixels-per-large-pixel and not, say, nine, as you’d find on Samsung’s Galaxy S22 Ultra.\nThere are areas, like zoom capability, where we really wanted more; and others, like the 48MP sensor on the main camera, where we’d say Apple got the mix right.\nThe iPhone 14 Pro is not, though, without fresh innovation. First, there’s the slightly risky decision to forgo SIM slots on all US iPhone 14 devices, and instead use eSIMs. The switch appears to work fine, but we look forward to hearing from purchasers later this month to see if they feel similarly.\nWe consider the new Dynamic Island to be the biggest innovation. It’s a clever way of retiring the TrueDepth module notch, introduced with iPhone X, while retaining most of the technology that’s made Face ID, selfies, and front-facing AR operations so effective.\nA combination of hardware and software, the Dynamic Island floats a few millimeters away from the top edge, is touch-sensitive, and is remarkably fungible. Watching it transform when, for instance, a call comes in might make you look twice and wonder ‘How’d Apple do that?’\nAs a whole, this is another excellent iPhone. It looks completely familiar, but also, thanks to the new screen technology – including off-the-charts brightness and, finally, an always-on display that runs at 1Hz (when awake, the screen can adaptively go from 10Hz to 120Hz) – entirely fresh. The photography is top-notch, even if Apple still refuses to give us more than a 3x optical zoom.\nPerformance, thanks to the A16 Bionic processor, is smooth and fast; and battery life – thanks to a more efficient CPU – appears good for all-day use.\nIt’s kind of funny that we’re cheering Apple for not raising prices (in the US, at least), but taking into account supply issues and constraints, as well as the rising cost of everything (even for Apple), it’s a nice surprise.\nYes, this is the phone we want to carry with us all the time.\n"
    },
    "iPhone 13 mini review: Improvements all around in a miniature form": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The iPhone 13 mini is the best iPhone for those who want a smaller device on Apple’s iOS platform. In fact, it’s arguably still the best small phone on the market. It’s powerful, the camera is top-tier, and the battery life is better than that of the iPhone 12 mini. It isn’t the best iPhone outright, but if you’re looking for a smaller device then you’re in luck.\n\nPros\n\n+Gorgeous compact design+Better battery life than iPhone 12 mini+Starts at 128GB of storage\n\nCons\n\n-Only 60Hz screen-Higher price than 2020 model-Limited charging compatibility\n",
        "review": "The iPhone 13 mini is Apple’s smallest iPhone, despite it being a year old, and that's because Apple opted to ditch the mini for its iPhone 14 line. Instead, an iPhone 14 Plus was launched in its place, with a big display yet lower specs.\nThat makes the iPhone 13 mini the second and last member of Apple's small-body line, though it's not a huge upgrade over the iPhone 12 mini. Nearly all of the upgrades are inside the one-hand-friendly phone, so it doesn’t look much different to the previous device.\nArguably the most welcome of the upgrades here is that, during our extensive testing, we found the iPhone 13 mini battery life to have improved significantly year-over-year. Rest assured, small phone users: you can now go all day using this phone, even if, unsurprisingly, the battery life isn’t as good as you’ll get from the larger iPhone 13 or iPhone 13 Pro Max.\nYou’ll spend less time charging this phone and more time snapping better photos, thanks to the improved camera sensors that are part of the iPhone 13 mini’s mostly familiar-looking dual-camera system. The main wide camera lets in 47% more light, according to Apple, and sure enough, all the night mode photos we shot looked bright, with markedly less noise than images captured on the iPhone 12 mini.\nPhotos look better partly thanks to the upgraded sensor, and Sensor-shift OIS technology that was previously exclusive to the iPhone 12 Pro and its Pro Max partner, and partly due to the advancements in computational photography.\nThere’s also good news if the iPhone 13 mini inspires you to take more photos: Apple has bumped up the storage tiers from 2020’s devices, so gone is the severely limiting 64GB entry-level size. Say hello to 128GB, 256GB and 512GB minis – but also, say hello to higher prices for the phones in most regions.\nThere are cosmetic upgrades you may miss at first blush. The screen notch is smaller, but most certainly hasn’t gone away (and on a smaller phone, it feels like it eats away at the screen real estate even more than on the iPhone 13 Pro Max). And the overall display brightness has been amped up, peaking at 800 nits for comfortable viewing when you're outdoors on a bright day and 1200 nits for HDR content.\nThe iPhone 13 mini will be the last small iPhone from Apple, for a while at least, due to underwhelming sales of the iPhone 12 mini. That’s a shame, because with this second-gen upgrade Apple fixed a lot of what turned us off from the iPhone 12 mini, and this small model could be the best iPhone for fans of compact devices. \n"
    },
    "iPhone 14 Plus review: A larger screen and battery without the Pro price tag": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The iPhone 14 Plus is a great option for those after a bigger handset, with a design, display, cameras and build quality that are all excellent, if a bit last-generation. It's also a more affordable way to get into Apple’s big-screen smartphone world, without having to shell out $1,000 / £1,000-plus.\n\nPros\n\n+Attractive design, quality build+Big screen and bigger battery+eSIM (US models only) and satellite+Good price for a big iPhone\n\nCons\n\n-The notch is now very dated-A15 Bionic isn't Apple's best chip-Not a huge upgrade\n",
        "review": "Everything you read about Apple’s iPhone 14 is true of the iPhone 14 Plus. You're getting the same processor, display technology, and dual camera array on the back. What sets this phone apart from its smaller sibling is, obviously, its screen size and battery life; and for some, that will be reason enough to choose it over the iPhone 14.\nThe 6.7-inch iPhone 14 Plus is a newcomer to the iPhone lineup, supplanting the adorably small iPhone 13 mini, which apparently failed to inspire buyers. With this more affordable plus-sized smartphone, Apple hopes to attract those who aspire to the big-screen excitement of the iPhone 14 Pro Max, but don’t have the budget to afford it; or who perhaps just don't need the power afforded by the iPhone 14 Pro Max’s 48MP sensor and leading-edge A16 Bionic CPU.\nComing with most of the same limitations as its non-Pro sibling, the iPhone 14 Plus might seem like just another good-enough handset; but don’t underestimate the benefits of a big screen and excellent battery life. These things matter, and getting them for $899 / £949 / AU$1,579 (for the base 128GB phone), as opposed to the $1,099 / £1,199 / AU$1,899 you’d pay for the iPhone 14 Pro Max, means this is a smartphone worth considering.\nTaken by itself, the iPhone 14 Plus is a somewhat staid but attractive smartphone. The design is virtually unchanged from the iPhone 13 lineup, except for its Pro-level-without-being-Pro size. There's no Dynamic Island upgrade for the iPhone 14 or 14 Plus, with the notch that Apple made 20% smaller with the iPhone 13 sticking around for another generation. It’s still an excellent, 458ppi display with 2,000,000:1 contrast ratio; just note that there’s no always on-display or adaptive refresh rate here, and you'll be happy enough with the tasteful 60Hz OLED panel.\nThe best iPhone of this generation, sadly not, but it's still a brilliant option and offers a nice middle ground between the standard 14 and the 14 Pro Max, without the 14 Pro's price premium.\nEven though we don't get a telephoto lens or a 48MP primary sensor on the iPhone 14 Plus, the two 12MP cameras on the back (the main and ultra-wide) are a step up from the iPhone 13’s array. Part of this is due to better sensors and lenses, but there’s also the new Photonic Engine, which applies Apple’s Deep Fusion image technology to uncompressed images. Even the front 12MP camera gets an upgrade, with a better sensor and autofocus.\nThese are characteristically above-average cameras that we think will satisfy most casual photographers and videographers.\nPerformance is excellent; in benchmarks the A15 Bionic (the same version of the chip as found in last year’s iPhone 13 Pro) is a tick below what you'd get from the iPhone 14 Pro series’ top-of-the-line A16 Bionic, but we challenge anyone to tell the difference in real-world use.\nBattery life is, as you might expect with a phone of this size, exemplary. In one video rundown test we got a solid 25 hours, although your mileage, obviously, may vary.\nWhile it can be difficult to avoid fixating on what the iPhone 14 Plus doesn't have, we think many will look at what the iPhone 14 Plus brings to the table: big-screen iPhone fun, performance, and battery life at a more affordable price than the equivalent Pro. And where the iPhone 14 offers no compelling reason to upgrade from the iPhone 13, the appeal of the iPhone 14 Plus is visibly obvious.\n"
    },
    "A surprise new iPhone 14 and Galaxy S22 rival – Motorola Edge 30 Ultra review: Moto shows Apple and Samsung how it’s done": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Motorola Edge 30 Ultra is the best-value flagship phone of 2022, with super-fast charging, a powerful processor, a premium design, a good-looking screen, clean software and more. It’s hard to find negatives with the device because Moto has gone all-out in every department.\n\nPros\n\n+Premium design+Super-fast charging+Powerful processor\n\nCons\n\n-Zoom camera could zoom further-200MP is just unnecessary-It makes other phones feel rubbish\n",
        "review": "If, at the beginning of 2022, we’d told you that one of the best premium phones of the year was to be made by Motorola of all brands, you probably wouldn’t have believed us – after all, the mobile stalwart is best known for making reliable cheap phones and the odd mid-ranger now and then.\nBut the Samsung Galaxy S22, iPhone 14 and Xiaomi 12 have all been put in their place in spectacular fashion, because the Motorola Edge 30 Ultra beats out all those popular flagship phones in almost every department, despite costing the same or less. \nIt’s hard to truly emphasize just how much of a surprise this phone is. Sure, Motorola’s low-end phones are good, but the brand’s line of higher-end phones, the Edge line, hasn’t impressed us in a good few years.\nYet, the Motorola Edge 30 Ultra is such a good phone, with a fantastic value-for-money proposition and collection of specs, that it’ll make your Samsung Galaxy S22 Ultra green with envy.\nThe feature that Motorola is shouting about most is the 200MP cameras – this is the first globally-launched smartphone to boast a sensor with this many pixels, and it rounds out an already-pixel-packed array with three other snappers.\nThe phone is good for photography, especially thanks to its inclusion of a telephoto lens (something we don’t always see, even at this price point), but the super-high-res camera isn’t even in the top three features of the phone.\nPerhaps our favorite aspect of the phone is its design. The ‘waterfall’ curved-edge display makes it feel fantastic to hold, although the textured glass rear and perfectly proportioned width help too.\nThe display is top-notch, with a 144Hz refresh rate giving it an edge over the competition, and combined with a top-end Snapdragon 8 Plus Gen 1 processor the phone is fantastic for gaming or other power-hungry processes.\nTalking of power, the phone charges incredibly quickly at 125W and, unlike most other fast-charging phones, actually has a good battery life, easily lasting for a day of use between charges.\nEvery aspect of the Motorola Edge 30 Ultra is utterly premium, making for a fantastic user experience, and unlike most other amazing phones like this, you’re not paying an arm and a leg to get it.\nIf we had to point to a weak area of the phone, it’d probably be the camera. It’s not bad, but 200MP is just unnecessary and we’d have loved to see a zoom lens with a longer zoom than just 2x. But this is just a wish list for an even more impressive phone, and they’re not even that important, given that the phone is already so impressive.\nIt’s going to be hard for other phones to seem impressive, or even interesting, in the wake of the Motorola Edge 30 Ultra and all the ways it wows us. One thing’s for sure, Apple and Samsung both need to take note because Motorola has proven that it knows how to make an amazing smartphone.\n"
    },
    "Motorola Moto G82: An affordable blend of sought after features": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "A phone that slightly undercuts most of its rivals on cost yet still includes a punchy OLED display and stereo speakers – but it isn’t top of the class for camera quality or gaming performance.\n\nPros\n\n+Solid value for a 128GB phone w/ 5G+Vibrant OLED display+Stereo speakers\n\nCons\n\n-Camera OIS isn’t as useful as hoped-Weak for video and night-time photography-More power is on offer if you spend a little more\n",
        "review": "The Moto G82 is part of a venerable family. For years, the Moto G series made our job pretty easy. Looking for a budget Android? Then buy the latest Moto G – advice that has stood for years.\nIn 2022, though, there have been too many Motorola phones released for the average person to keep up, and there’s now much greater competition from brands such as Realme, Xiaomi and OnePlus. \nHowever, the essence of the old Moto G spirit lives on in the Moto G82. It’s a sensible, reliable and uncluttered phone that comes with a fairly large OLED screen, 5G mobile internet, a decent amount of storage and stereo speakers, all at an appealing price. \nThis particular model is spiced up with OIS (optical image stabilization), but this doesn’t elevate the camera to anything like the level of the Pixel 6a. While OIS counters against taking blurry images indoors, the Moto G82 camera doesn’t perform brilliantly at night, plus has weaker hardware than some of its slightly pricier competitors. \nThe phone’s Snapdragon 695 SoC is also soundly beaten by the Qualcomm and MediaTek chipsets seen in phones that cost just slightly more. \nIf camera image quality in more challenging scenes is a priority, or performance in demanding games such as Fortnite, for that matter, you should check out alternatives such as the Google Pixel 6a, the OnePlus Nord 2T, Realme Neo 3T and Xiaomi Poco X4 GT before considering a Moto G82. \nHowever, we can’t ignore that all of those devices typically cost more than the Moto G82, which should help turn down the volume on the numerous slightly weaker points detailed in this review. \n"
    },
    "This Android phone tries to follow the Samsung Galaxy S22 Ultra but with one problem – our Vivo X80 Pro review: A premium phone that can’t catch a break": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "Despite being a good phone, the Vivo X80 Pro is hard to recommend. It has a good-looking screen, powerful processor and fast charging, but alternatives from Samsung and Apple have better cameras, while the flagships from Motorola and Google offer better value for money. If you can find the phone on offer, it’s certainly worth considering, but at its recommended retail price, it’s not quite worth it.\n\nPros\n\n+Good-looking display+Fast to charge+Powerful processor\n\nCons\n\n-Price is too high-Lots of bloatware-Zoom camera is too low-res\n",
        "review": "The Vivo X80 Pro is another entry into the growing roster of super-premium, super-pricey Android phones offering top camera tech and powerful internals. It’s Vivo’s first member of this premium tier that’s gone on sale globally, instead of just in the company’s home region of China, and like many other phones from many other companies, it’s vying to knock the Samsung Galaxy S22 Ultra off top spot on our list of the best smartphones.\nHowever, like ZTE which recently launched its premium Axon 40 Ultra, Vivo has seemingly forgotten one key thing in launching a super-expensive Android powerhouse to rival the S22 Ultra - that it isn’t Samsung.\nSamsung can get away with launching Ultra phones at an eye-watering price because it’s the biggest smartphone seller in the world. People trust the Galaxy branding, and they’re comfortable giving this well-established company huge amounts of money.\nThe same can’t be said for Vivo which, despite being big in China, barely has a presence in Europe. \nThe X80 Pro is, by all accounts, a decent phone. It has a premium design, with a curved-edge screen that sits snug in the hand, and a giant camera bump that just screams ‘I’m a camera phone’ (a message reinforced by the multiple Zeiss logos across the back).\nIt ticks all the boxes of a top-end phone: it has a powerful processor, a good-looking screen, fast charging and a selection of high-res cameras on the back. But while it matches lots of other high-end phones in most departments, it doesn’t do anything to get ahead.\nA good example is in the camera department because while the phone has the same combination as the Galaxy S22 Ultra – a main, ultra-wide, telephoto (for portrait shots) and periscope (for zoom shots) – the resulting pictures just aren’t as good. The periscope lens is paired with a sensor that’s too low-res, and the phone’s AI image optimization doesn’t pull its weight.\nAnother example is in the software. While Vivo’s FunTouch feels like stock Android did for many years, it’s missing the new features and design changes that Android 12 brought (and it has lots of bloatware packed in, which isn’t great).\nIn theory, the Vivo X80 Pro is a fine phone, but there are far more enticing options on the market. So unless you’ve got some aversion to the Samsung Galaxy S22 Ultra, iPhone 14 Pro Max, Sony Xperia 1 IV and others, we can’t see many people picking the Vivo X80 Pro over its rivals.\n"
    },
    "Sony Xperia 1 IV review: Sony Xperia 1 IV is great - if you can see past some flaws": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Sony Xperia 1 IV brings some stellar creative features, with its continuous optical zoom wowing for photography and its ability to shoot 4K 120fps footage on all three cameras a great tool for video. It’s also a well-rounded phone with a good-looking display, powerful processor and long-lasting battery. However it’s rough around the edges with a fingerprint scanner that struggles to pick up your print, and a price that will likely put off many buyers.\n\nPros\n\n+Continuous camera zoom is fantastic+Good-looking display+Impressive battery life\n\nCons\n\n-Temperamental fingerprint scanner-Playback issues for recorded videos-Incredibly high price\n",
        "review": "It’s hard to know whether to class this Sony Xperia 1 IV review as an analysis of a consumer-grade smartphone or a professional-level creativity tool designed for working artists As the former, it’s almost impossible to recommend, but if you treat it as the latter, it’s hard to put down.\nThis is an obscenely expensive phone that just can’t compete with rivals like the Samsung Galaxy S22 Ultra or iPhone 13 Pro Max for ‘average’ phone fans - it has a clunky design and unassuming software, and it doesn’t rely on AI to take vibrant and captivating photos.\nBut Sony knows that, and it isn’t aiming at the kind of consumers who buy the first handset they see on a store shelf. No, the Xperia 1 series is aimed at professional ‘content creators’ (for lack of a better, not-cringe-inducing term) with a range of bespoke photography, videography and, new to the Mark 4, audio recording features.\nThis is the fourth-gen version of Sony’s top-end line of Android smartphones (what gave it away?), following on from the Sony Xperia 1 III, and accompanied by a mid-range Xperia 10 IV. These premium devices rarely have huge changes over their predecessors. Sony instead opts to tweak specs and bring useful new features for creatives.\nThe big new feature here is the continuous optical zoom, with the telephoto lens moving between 3.5x and 5.2x without having to use digital zoom (which is basically just cropping). It’s a really useful mode for photographers who like long-range shots.\nOther big upgrades include the rollout of 4K and 120fps video recording on the three rear and one front-facing camera, an audio recording app that lets you layer, clean and mix sound, functions for mobile games streaming and a bigger battery than before.\nSony’s phones are already considered some of the best devices for creatives, and the new additions to the Xperia range ensure that Sony is keeping head-to-head with Samsung and Apple for that crown - though admittedly the Xperia’s camera is designed for more technically-minded users than the Galaxy or iPhone point-and-shoots.\nThere are also some rough edges that even creative users can’t overlook, which means we can’t give this phone a wholly glowing review - you’ve already seen that 4/5, haven’t you?\nThe big problem we found was that the side-mounted fingerprint sensor was incredibly inaccurate, and it failed to unlock the phone more times than it succeeded. This has been a consistent problem with Sony’s flagships and it boggles the mind that the company hasn’t fixed it yet.\nThere were also a few software issues, like video playback not working on some of the key video-recording apps, apps crashing and the inclusion of bloatware that we wouldn’t expect on a pricey device.\nYep, this is an expensive phone - it will even cost you more than some Ultra-suffix devices or foldable phones. Even our ‘price and availability’ section below isn’t for the faint of heart. Sure, you get lots of unique and useful creative features for that price, but given the cost of living crisis around the world, it seems a bit much. How many ‘starving artists’ have $1,600 to spend?\nWe enjoyed our time testing the Sony Xperia 1 IV, but likely wouldn’t recommend it to the vast majority of our friends, at least the ones who aren’t creatively inclined. But for the minority who’d enjoy the Cinema Pro apps, the continuous camera zoom or the 120fps recording, and could also afford that price tag, we’d wholeheartedly recommend this device.\n"
    },
    "Asus ROG Phone 6D Ultimate: MediaTek's true gaming debut": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Asus and MediaTek have proven that flagship gaming phone power isn't a one-horse, Qualcomm race with the ROG Phone 6D Ultimate. A reimagining of the excellent 6 and 6 Pro and launching alongside both. With a new heat dissipation system, the phone games cooler than anything we've tested. Also packing excellent speakers, a mighty screen, and a fun, gaming-optimized UI. While the camera isn't going to blow you away, for a gaming phone, the 6D hits its mark. \n\nPros\n\n+Best-in-class heat management+Smooth, punchy, expansive screen+Loud speakers with customizable tuning+Gamer-centric UI is a lot of fun\n\nCons\n\n-Camera performance could be better-Pricier than iPhone 14 Pro-Not available in the US-No wireless charging \n",
        "review": "If you thought Asus was done launching flagship gaming phones in 2022 after the excellent ROG Phone 6 was announced just two months ago – think again. The ROG Phone 6D and 6D Ultimate supplement the current line with MediaTek power, a mechanical air vent, and even a Batman Edition.\nVery similar to the 6 and 6 Ultimate, the 6D series features a virtually identical design, except for the fact it now ships in a gunmetal grey. In its Ultimate edition,\nthe 6D also sports a flap around the back that raises when you hook up the AeroActive Cooler fan for improved airflow and heat management.\nAdvanced cooling may only be reserved for the Ultimate edition, but both the ROG Phone 6D and 6D Ultimate get a color screen around the back and are powered by MediaTek's new Dimensity 9000 Plus chipset.\nThe first time we've seen a mainstream smartphone maker pick MediaTek for a flagship experience in the West, the Dimensity 9000 Plus has big shoes to fill. After all, the ROG Phone 6 introduced the Snapdragon 8 Plus Gen 1 to the market – now the gold standard for Android performance.\nThankfully, in our time with the ROG Phone 6D Ultimate, MediaTek's chip performed incredibly well. And that winning impression was helped along by the phone's huge 6,000mAh battery and ample 512GB storage.\nThe ROG Phone 6D series has the same camera whether you get the vanilla version or the Ultimate, and it's the same camera mix introduced in the ROG Phone 6. That means it's good enough, but isn't best-in-class, especially in the Ultimate, which costs £1,199 (roughly $1,370 / AU$2,040).\nThe phone also misses out on wireless charging and has a relatively low-resolution Full HD+ screen. That said, those last two omissions make sense on a gaming phone. After all – wireless charging crams the chassis with more elements, which isn't great for heat management, and games are output in 1080p for Android, so the resolution is actually well-optimized for gamers.\nAnd so, just as the ROG Phone 6 was the best gaming phone we'd tested, the ROG Phone 6D and 6D Ultimate are more of the same, with the 6D being a bit more affordable, and the 6D Ultimate being a bit pricier (and cooler).\n"
    },
    "iPhone 12 mini review: The iPhone 12 mini is a dainty (yet powerful) delight": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The iPhone 12 mini is built for those who have been dreaming of a small phone but don’t want to compromise on quality, and Apple has done an exceedingly good job at making that a reality. It isn’t perfect, with middling battery life and a high price for just 64GB of storage, but if you can put those negatives aside you’ll love what the iPhone 12 mini can do in its miniature package. The camera is versatile, the screen is fantastic, it comes with reams of power and the added benefits of 5G and MagSafe mean this is a phone that will last you for years to come.\n\nPros\n\n+Smaller design looks great+Fantastic display +Futureproofed with 5G\n\nCons\n\n-64GB isn’t enough for some-Wireless charging is slower-Middling battery life\n",
        "review": "Apple’s iPhone 12 mini is a triumph, with top-end tech and a premium design combining to produce a phone that can compete with some of the very best handsets on the market, and all in a smaller body than you’d expect for a flagship device.\nIt's also a symbol of a different time, back when Apple made small phones. After the iPhone 13 mini, the company did away with these compact mobiles, and the iPhone 14 family doesn't have such a device.\nYou won't find this iPhone 12 mini review to be wildly different from our coverage of the iPhone 12, but it has a smaller form factor that will suit those looking for a more compact phone than top-end manufacturers – including Apple – have been able to offer for the past few years.\nThis is the smallest iPhone since the iPhone 5S, and you’ll notice it as soon as you pick it up. Even comparing this phone to the iPhone SE 2020 makes it feel small, but it doesn’t lose any of that premium edge we found with the iPhone 12.\nYou will get a slightly improved experience with the iPhone 12 Pro or iPhone 12 Pro Max thanks to their more powerful engines, bigger batteries and a variety of other tweaks, but if you’re after a small iPhone you no longer have to worry about missing out on the best features.\nThe 5.4-inch Super Retina XDR OLED display is pin-sharp, and it’s markedly better than the LCD display on the iPhone 11. You’ll particularly see the improvements when watching video that supports HDR.\nThe iPhone 12 mini also has a premium design, with a protected glass design called Ceramic Shield and angular aluminum edges that will pull your mind back to the days of the iPhone 4 as soon as you first handle it. It comes in a choice of five colors (black, white, red, green or blue).\nIt may feel like an iPhone for the nostalgists, but it’s anything but when it comes to spec. The A14 Bionic chipset that powers this device might not be the fastest chipset for iPhones any more but we found it to work nearly flawlessly, whatever we threw at the phone. Plus, you've got a top-end camera array with two 12MP rear shooters that perform just as well as those on the iPhone 12.\nThen there’s the addition of next-gen 5G connectivity technology, allowing you to experience faster speeds and easier connection when using mobile data. This is great futureproofing technology to have on board, but at launch 5G isn’t widely available in many areas, meaning it won’t be a transformative experience for most people right away.\nThere’s also MagSafe, Apple’s new magnetic docking tech, which enables you to connect a wireless charger and other accessories (just a couple at launch) by simply snapping them to the rear of the phone.\nThe iPhone 12 mini isn’t without its frustrations, as the battery life isn’t as powerful as some may hope for, and 64GB of storage doesn’t feel like enough for a phone in 2021. That said, these are minor issues that many who like the choices Apple has made elsewhere will be able to live with.\nThe iPhone 12 mini is built for those who have been longing for a smaller iPhone that is easy to use in one hand, and if you want Apple’s full-on smartphone experience in a more compact package, this is the iPhone for you. In short, it's one of the best iPhones.\nEven if you're committed to Apple phones, the iPhone 12 mini has little competition if you're after a small yet high-end handset. The closest Android gets is the likes of the 5.9-inch Asus Zenfone 8, with most flagships such as the Samsung Galaxy S21 and OnePlus 9 ranges being above 6 inches.\n"
    },
    "iPhone 12 review: The iPhone 12 is still a solid phone taking great photos": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "It’s easy to dismiss the iPhone 12 as just 'more of the same', especially when you consider the new and compact iPhone 12 mini is also an option, and you can always go for the iPhone 13 series now. However, 5G networks are continuing to roll out across the globe, and the MagSafe addition is a useful addition to the iPhone arsenal – these things, combined with an improved design and screen, mean the iPhone 12 will become more useful the longer you own it. It's no longer the latest iPhone thanks to the iPhone 13, and it doesn’t come with a charger in the box; yes, there are environmental benefits to this, but you may need to factor buying a new charger into the cost of your new iPhone on top of the higher price.\n\nPros\n\n+Colorful OLED display+Future-proofed with 5G+MagSafe is intriguing\n\nCons\n\n-Cameras are similar to iPhone 11's-Battery life only okay-Hike in price over iPhone 11\n",
        "review": "The iPhone 12 is a more expensive phone than 2019's iPhone 11, with Apple adding $100 / £100 to the price; it does, however, bring a number of new features that make for a more premium handset, including an OLED display, a slightly upgraded camera, a new design and – the big hitters – 5G and MagSafe connectivity.\nIt's also important to note this is just one member of the iPhone 12 family, which has a record four phones, including the iPhone 12 mini, iPhone 12 Pro and iPhone 12 Pro Max. Ideally, there's an iPhone 12 for anyone – but the phone for nearly everyone may just be the standard model, because - as our iPhone 12 review explains below - this packs the best parts of the range at a lower price than the Pro models.\nThe iPhone 12 is the oldest phone in the official Apple lineup even now that the iPhone 14 models are here, as it takes the place of a slightly more affordable option without the handful of extra bells and whistles in the new phone.  This is typical of Apple, which has kept 2019's phones and discounted them as cheaper alternatives, so we expect the iPhone 12 to not just be viable but crucial to Apple's strategy going forward. The phone got more features with iOS 15 and we can count on it getting newer updates for years to come.\nStarting with the iPhone 12 headliners, 5G brings faster speeds and more robust connectivity to the new iPhone, but as 5G networks aren't yet fully deployed around the world, coverage is still a bit patchy. When it works, it's incredibly fast – we easily managed 200Mbps on the go – but there are still too many places, even in big cities, where it's hard to get full coverage.\nThat said, given that many are holding onto their phones for three or four years nowadays, this is a feature that will only become more useful over time – the iPhone 12 can connect to a huge range of 5G frequencies too, meaning that if there’s a 5G signal where you are you should be able to connect to it, whether on sub-6 or mmWave networks.\nThe new (to iPhones) MagSafe connector on the rear of the iPhone 12 is a really interesting proposition – this magnetic connection tech not only enables you to attach things to your phone, such as a charger or a case, but can also tell what's been connected through a special chip.\nMagSafe enables faster and more accurate charging, which is neat in itself – but the magnetic connection opens the door to a new range of accessories (like a wallet clip-on or camera mount) but, just as 5G will become more useful over time, we're pretty certain that the MagSafe accessory range is going to expand massively as third-party manufacturers get their hands on the technology.\nThat means we could see some cool clip-on accessories like games controllers, photo printers and huge extra batteries coming soon. If these MagSafe mounts turning your iPhone 12 into a proper camera are anything to go by, the sky's the limit. \nThe performance of the iPhone 12 has been upgraded once again: the A14 Bionic chipset is the most powerful in any smartphone, and the benchmarks bear that out as it annihilates the competition - and weirdly, doesn't get outperformed by the theoretically more powerful iPhone 12 Pro. \nThe decision to start with 64GB inside is stingy though, and you might start butting up against that barrier in the not-too-distant future if you like taking photos and videos at full resolution.\nThe iPhone 12 design has been tweaked, with squared-off edges that are highly reminiscent of the iPhone 4 and iPhone 5 from yesteryear, and a new Ceramic Shield front that’s allegedly four times harder to shatter than the iPhone 11 (not that we were willing to drop-test our review sample).\nThe display has been upgraded too: it’s now an OLED screen, the same tech that’s used on the iPhone 12 Pro, and offers rich colors and deep blacks, as well as bringing true HDR to the mix for compatible content. It sounds like a small thing, but perhaps the slick 120Hz display tech would have been a boon here too; however, you are still getting a sharp and colorful viewing experience on the iPhone 12.\nCameras-wise, you're again getting the 12MP duo of the wide and ultra-wide cameras here. The former is even better in low-light on this model, and both can now be used with Night Mode. This feature can improve your snaps in a way that’s genuinely staggering; however, it's also available on the iPhone 11, and we would have liked to have seen it upgraded in 2020.\nThe video capabilities, including the ability to record in Dolby Vision in 4K, sound impressive, but for most this will be a rarely-used feature. That said, the output is strong to look at and something you'd be keen to share.\nBattery life is only average on the new iPhone 12; with heavier use your phone should see you through most of a day – around 17-18 hours at a push. Lighter usage will see you easily sail through to the night, but it's not quite as good as 2019's model.\nThe iPhone 12 feels like it's packed with potential – but Apple is relying on others to make it a success to a large extent. We need to see wider deployment of 5G, and others need to get on board with MagSafe accessories quickly, to really make the new phone an appealing buy.\nThose things aside, and while the upgrades to the display and design are nifty, the iPhone 12 doesn’t feel massively different to the iPhone 11– and doesn't feel like it outperforms its higher price tag in the same way that phone did. Still, despite all that it just about ranks among the best iPhones, though it's not quite one of the very best smartphones anymore.\n"
    },
    "iPhone 13 Pro review: Minor upgrades, but a great-looking package": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The iPhone 13 Pro is one of 2021’s best smartphones, even if it doesn’t quite do enough to warrant upgrading from the 12 Pro. The battery life is the best we’ve seen in Apple’s Pro iPhone, and you’re also getting top-level performance, a great camera package and a super-smooth 120Hz screen. While on their own none of the upgrades for 2021 are huge, they add up to offer a fantastic smartphone experience.\n\nPros\n\n+Great performance+Strong battery life+Interesting macro photography mode\n\nCons\n\n-Limited design changes-Very expensive-4K ProRes limited in 128GB\n",
        "review": "For a while there, the iPhone 13 Pro was one of Apple's best iPhones, but the release of the iPhone 14 Pro changed that. This device has an always-on display, punch-hole cut-out for the front cameras, and a new 48MP main camera.\nThat's a fairly big upgrade as far as iProducts go, making the new phone much more tempting, but its year-old sibling might appeal to people who don't need all the newest bells and whistles.\nA lot of what makes that newer smartphone great is also available here, for a slightly cheaper price of $999 / £949 / AU$1,699.\nIf you already have an iPhone, as you'll learn by diving deeper into our iPhone 13 Pro review, it makes for a big upgrade – unless you currently own last generation's iPhone 12 Pro or Pro Max – with improvements to almost every feature.\nOne exception is the design, which remains similar to that of the iPhone 12 Pro. There’s a matte finish on the rear of the phone and stainless steel edges, which make the handset feel appropriately premium.\nThe new A15 Bionic chipset paired with 6GB of RAM delivered more than enough power to run even the most demanding apps you’ll find in the Apple App Store, while the phone starts at 128GB of storage, with options up to 1TB for those who need lots of space.\nThe iPhone 13 Pro also offers a fantastic camera experience, with a versatile array of cameras that can handle both daytime and night shooting with ease. The telephoto and macro cameras mean you can shoot at a variety of distances, too.\nBattery life is one of the biggest upgrades, and we found that the iPhone 13 Pro was capable of lasting a full day, no matter what we threw at it. It won’t last quite as long as the iPhone 13 Pro Max, but it will last longer than any iPhone you’ve used before.\nSo the iPhone 13 Pro is a remarkably good smartphone – but so are all the iPhone 13 handsets, and if your budget won’t quite stretch to the Pro, the ‘standard’ iPhone 13 misses out on only a few of its specs and features, so you may find the cheaper handset suits you just fine.\nBut if your head has been turned by everything the iPhone 13 Pro offers – the 120Hz screen, improved cameras and a touch more RAM or storage – then it may well be the best iPhone for you, especially if you don’t want or need the larger screen size of the iPhone 13 Pro Max.\n"
    },
    "iPhone 13 review: Everything on the iPhone 13 is just a bit better": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The iPhone 13 isn’t a game changer for Apple’s series of smartphones, but it’s an important iteration that offers better battery life, a better processor and an upgraded camera setup than iPhones that have gone before it. If you’re looking for a fast and capable smartphone, and don’t need the extra features of the pricier Pro model, this is a top choice.\n\nPros\n\n+Strong battery life+Great design+Powerful internals\n\nCons\n\n-Minimal design changes-No 120Hz screen-No Ceramic Shield on rear\n",
        "review": "The iPhone 13 is no longer Apple's newest smartphone, though it may well be a more tempting buy than its successor. The iPhone 14 series is out, and the main device in the series is pretty similar to the 13 with the same cameras, display, chipset  and design. You can check out our iPhone 14 review to find our full notes on the device.\nThat's a shame, because in our initial iPhone 13 review, we noted that it didn't bring a huge number of features over the iPhone 12, though it did have a few tweaks here and there.\nOn paper, you’d be hard pressed to find a reason why Apple didn’t call the iPhone 13 the iPhone 12S. The design is largely the same, the specs don’t look hugely different, and there aren’t many headline-grabbing new features.\nIf you do want a bigger upgrade then you might not have long to wait, as we're expecting to see the iPhone 14 on September 7, along with the iPhone 14 Max, iPhone 14 Pro, and iPhone 14 Pro Max, so bear that in mind before buying this.\nThat said, everything on the iPhone 13 is a touch better than before – and some elements are significantly better.\nThe highlight of the iPhone 13 is its battery life. Previously, iPhones haven’t been synonymous with strong battery life, but during every day of our testing we’ve been hard-pressed to run the iPhone 13 out of juice.\nApple has finally cracked it when it comes to battery life, and it's now far better than it has been on previous iPhone iterations.\nThe iPhone 13’s new A15 Bionic chipset, meanwhile, is incredibly powerful, and paired with 4GB of RAM it’s capable of running multiple apps and tasks quickly and efficiently.\nA new duo camera for the iPhone 13 improves clarity in images, while the introduction of the company’s Sensor Shift optical image stabilization (OIS) technology, previously only available on Apple’s Pro Max handsets, is a big deal for those who want to shoot quickly without losing their subject in a blur.\nEven the screen on the iPhone 13 is a touch better than what we’ve seen on previous ‘standard’ iPhones, and that’s a big deal if you’re upgrading from an iPhone XS or older. The OLED technology here enables a brighter picture than ever, and the picture quality is simply fantastic.\nOne disappointment, however, is that Apple hasn’t included a 120Hz refresh rate on the iPhone 13, so you’re not getting as smooth an experience as on the iPhone 13 Pro or iPhone 13 Pro Max.\nAs ever, Apple’s new iPhone will cost you, with the iPhone 13 price starting at $799 / £779 / AU$1,349 – although this year that gets you 128GB of storage, rather than the 64GB of the base-model iPhone 12.\nWhile at first glance the iPhone 13 may not seem like a great leap forward for Apple, the improved battery life, performance, screen and camera all add up to be a worthwhile upgrade for anyone who’s coming from an older iPhone, or looking to make the switch from Android. In fact, it's good enough to rank near the top of our best iPhone guide.\n"
    },
    "Google Pixel 5a: Google Pixel 5a is a solid mid-range camera phone": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Google Pixel 5a isn’t much different than its predecessor aside from a bigger battery and a rating for water and dust resistance, making it an underwhelming upgrade, but still a solid mid-range phone with fantastic cameras. If you don't mind going without the Pixel 5's zoom camera, it’s a good if unexciting choice. \n\nPros\n\n+Great cameras and software+Good specs for the price+Big battery\n\nCons\n\n-Few improvements over predecessor-No zoom camera-Low-powered in-box battery charger\n",
        "review": " Our Google Pixel 5a review is finally here, and it’s… a lot like the Google Pixel 4a 5G that came before it, in both looks and internal specs. There are a few upgrades this time around, but it feels like the slightest refresh of the older model.\nAt least the Pixel 5a’s price hasn’t gone up from the 4a 5G, and for owners of the Google Pixel 4a (without 5G) – and even more so if you have an older Pixel phone – there’s plenty of reason to pick up the new Pixel 5a. It’s a great mid-range phone at a reasonable price. You can also check out our complete rundown of the best cheap phones. \nThe Pixel 5a has the same Snapdragon 765G chipset, 6GB RAM and 128GB storage as the Pixel 4a 5G, so there’s no advancement in its specs. The Pixel 5a also has the same cameras as its predecessor: a 12MP main camera and 16MP ultra-wide shooter on the rear, along with an 8MP front-facing camera.\nWhat’s different? The battery, for one: the power pack in the Pixel 5a has more capacity (4,680mAh) than the one in the Pixel 4a (3,140mAh) or the Pixel 4a 5G (4,080mAh). The phone is also slightly bigger, with a 6.34-inch Full HD Plus OLED display (compared to the 4a 5G’s 6.2-inch screen), and – in a first for Google’s cheaper ‘a’-series phones – it has a dust and water-resistant rating (IP67, so your phone will be safe submerged up to one meter of water for 30 minutes).\nIn short, then, the phone brings few improvements over its predecessor, but it’s still one of the best mid-range devices you can buy. It’s unlikely to impress anyone who’s looking for true innovation, but it’s probable that Google is keeping back the big upgrades for the Tensor chipset-powered Google Pixel 6. Google's flagship is one of the phones we cover in our list of the best Android phones. \n"
    },
    "Xiaomi Poco X3 Pro review: The Xiaomi Poco X3 Pro is a budget gaming monster phone": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Xiaomi Poco X3 Pro is the best gaming phone you can get for the cash at the time of review, with impressive power and a sharp, smooth screen, but camera quality takes a hit in return.\n\nPros\n\n+Superb gaming performance+Long battery life+Impressive 120Hz screen\n\nCons\n\n-Relatively weak camera -No 5G-Large and heavy\n",
        "review": "The Xiaomi Poco X3 Pro sounds like the upgraded version of the brilliant and affordable Xiaomi Poco X3 NFC, right?\nIt is. And it isn’t.\nThe Xiaomi Poco X3 Pro has a much better processor than the Poco X3 NFC. This has to be one of the very best Fortnite/CoD/Insert Game Here phones you can get at the price.\nHowever, in some respects the Poco X3 NFC is better. Its camera is superior, and not just because it has more pixels, 64MP to the Poco X3 Pro’s 48MP. The Pro tends to smudge fine detail, and demonstrates poorer mid-tone contrast than the best in this class.\nIs it a flat-out bad camera? No, but you can get much better.\nAll this really means is you don’t get the Xiaomi Poco X3 Pro’s excellent Snapdragon 860 chipset for free. There are compromises.\nThankfully, they are largely found in the camera. As we'll get into more deeper in our Xiaomi Poco X3 Pro review, its 120Hz screen is great, battery life is excellent and, as you’d hope, there are no basic performance problems in Android.\nSure, we wish it had 5G. It doesn’t. You can now buy the Moto G 5G Plus for similar money, and it has 5G. But will being able to play games at similar frame rates as the previous year's top-end phones matter more to many? Of course it will.\nThe Poco X3 NFC is arguably a better-balanced phone than the X3 Pro, and as such it ranks among the best cheap phones. Camera quality counts for a lot, but this is yet another demonstration of the sheer value you get with a Poco-series Android.\n"
    },
    "Samsung Galaxy Z Flip 3 review: The Samsung Galaxy Z Flip 3 is a foldable for the mainstream": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Samsung Galaxy Z Flip 3 is the best clamshell foldable you can buy, with specs and a price comparable with flagship phones. Its relatively small battery holds it back, as does its lack of a telephoto camera lens, and wary consumers may want to wait to see what innovations come in the Flip 4 – but if you want a phone that folds up to fit in more bags and pockets, while offering the same performance as flagship phones, the Z Flip 3 is a good option.\n\nPros\n\n+Good lower price+Good specs+Refined design and displays\n\nCons\n\n-No telephoto lens-Middling battery-Outer display still not terribly useful\n",
        "review": "The Samsung Galaxy Z Flip 3 was officially unveiled at Samsung Unpacked on August 11, 2021 and went on sale on August 27 of the same year, in the US and UK. Those in Australia had to wait until September 10, 2021. \nIt comes in two storage sizes: 128GB, which costs $999 / £949 / AU$1,499, and 256GB, which will set you back $1,049 / £999 / AU$1,599 \nFor comparison, the original Galaxy Flip cost $1,380 / £1,300 / AU$1,800, and the 5G model was even more at $1,449 / £1,399 / AU$2,599, so the Flip 3 was much cheaper at launch; around the price of flagships, like Apple's iPhone 13 Pro. On the other hand, both the original Z Flip and the Z Flip 5G have gotten much cheaper since launch, and are currently more affordable than the Z Flip 3, unless you find it on discount.\nThe Z Flip 3 is also a whole lot cheaper than its larger sibling, the Samsung Galaxy Z Fold 3, a true foldable phone that starts at $1,799 / £1,599 / AU$2,499. With twice as much display and S Pen support, the Z Fold 3 is an impressive alternative – but one that’s meant for productivity, not portability.\n"
    },
    "Sony Xperia 10 IV review: Another solid, affordable Xperia from Sony": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Sony Xperia 10 IV is a smartphone that excites and frustrates in almost equal measure. When everything is taken into consideration though, it ends up with credit in the bank – and it's going to appeal to fans of both compact handsets and the Xperia series.\n\nPros\n\n+Great battery life+Advanced camera features+Solid build quality\n\nCons\n\n-Average performance-Some camera inconsistencies-60Hz display refresh rate\n",
        "review": "The Sony Xperia 10 IV is a bit of a mixed bag: it does really well in some areas, and not so well in others, and it arrives at a price point that's reasonable enough for what you get in return. Taking all of that into consideration, it's likely to appeal to some, without really standing out in its price bracket.\nThis is the cheapest of the Xperia range for 2022, positioned alongside the flagship Sony Xperia 1 IV (it's that last number that goes up each year). There should be a phone in the middle, but at the time of writing there's still no sign of the Sony Xperia 5 IV.\nStarting with the good, the battery life on this smartphone is among the best we've seen lately, and the Xperia 10 IV can stretch to a couple of days quite easily. That's a key consideration for a lot of phone buyers, although the slow charging speed and lack of wireless charging should also be noted.\nAs is usual from Sony, the build quality and the screen quality are both at a premium level, even in this budget phone. Again though, there are caveats, because its construction relies on a lot of plastic, and the screen's refresh rate tops out at 60Hz.\nCamera quality continues to be a big factor when choosing a phone, and on the whole, the Sony Xperia 10 IV performs better than a lot of other similarly-priced handsets. However, occasional inconsistencies and only average low-light performance mean it's not all positive.\nFrom that summary you can see some of the pluses and the minuses that you're dealing with when weighing up whether or not to go for this phone. Whether or not you already own a Sony Xperia handset will probably play a part too – if you like the style and finish of this phone series, you'll find the 10 IV follows a familiar pattern.\nOf course, your budget plays a part too – this is a solid handset for the price, but there are a lot of value-for-money offerings in the same sort of bracket (or even less, if you take a look at our rundown of the best cheap phones, available right now). As always, it's important to do plenty of research before making a final decision.\n"
    },
    "Honor 70 review: A premium phone with a budget price tag": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Honor 70 is an attractive phone with good specs for the price, particularly in the camera, processor and design departments - it feels like a premium phone in most ways. Sure its design may be divisive, but the main drawbacks - like the lack of a telephoto camera or wireless charging - are things you don’t really expect from a mid-range phone anyway.\n\nPros\n\n+Eye-catching design+Good-looking screen+Quick charging\n\nCons\n\n-Decal may be divisive-No zoom camera-No headphone jack\n",
        "review": "We should begin this Honor 70 review with one very simple fact: it was hard to populate its ‘cons’ list. TechRadar’s house style dictates that we need to provide three and it was a challenge to even come up with one.\nThat’s not to say that the Honor 70 is perfect, but it does all you expect and more for the price. Could it have a telephoto lens, wireless charging, or even a higher-res display? Sure, but at the price, none of those are things you’d really expect.\nSo, the Honor 70 is a competitive mid-range phone, in fact, it feels a lot more like a flagship phone than most other handsets we see at this price. And that premiumness - whether deserved or otherwise - can’t help but endear you to the device.\nThe phone has an eye-catching design, with a back that boasts both a reflective diamond pattern and a sparkly effect. Some, particularly those who like their nondescript black phones, might find this a little gauche, but the sheer number of compliments it received while we were testing is hard to ignore.\nIt also has a curved-edge display, something you rarely see in non-premium phones. That gives the phone both another premium element and also makes it comfortable to hold in the hand.\nThe screen is just as attractive as the design of the phone - it’s bright and bold, and you’ll be happy watching TV shows or playing games on it.\nWe also want to highlight the device’s impressive battery life. If anything, this is the trait that flags the Honor 70 as a mid-range phone instead of a premium one, as we’re so used to seeing pricey phones with disappointing battery lives. The fact that the Honor 70 waltzes through a day of use signposts it as a mid-ranger, but we’re happy with that distinction.\nWe do need to point out one thing that some could consider an elephant in the room, though we don’t. On paper, the Honor 70 doesn’t seem too different from its predecessor, the Honor 50. (What happened to the 60? No idea.)\nThe new phone’s chipset is only the ‘Plus’ version of the older one’s, while the 70’s main camera is lower-res than the 50’s, and the charging speed, screen resolution and front camera are the same on both.\nHowever, the specs list doesn’t actually do justice to the user experience, and the Honor 70 feels like a step up in all departments. The cameras are noticeably better, and the phone feels faster than its older relative.\nDespite the fact that the new phone costs more and has a specs list that seems similar to the Honor 50, trust us, the Honor 70 is a worthy step up, and it makes the phone a lot more tempting compared to the stagnant-feeling mid-range market in 2022. The rough edges of the 50 have been sanded down, resulting in one of the best Android phones this year.\n"
    },
    "Google Pixel 4a review: Google's impressive single-camera smartphone photography arrives in an affordable, one-hand-friendly design": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The compact size, clean interface and great point-and-shoot camera of the Pixel 4a will appeal to those looking for an affordable, reasonably sized handset with enough grunt to handle the basics, plus the ability to capture some excellent pictures.\n\nPros\n\n+One-handed use possible+Powerful single camera+Headphone jack\n\nCons\n\n-Mediocre battery life-No 5G (yet) or wireless charging-Cheaper-feeling design\n",
        "review": "This Google Pixel 4a review was written when the phone was new; since then, we've seen the Pixel 5 and Pixel 6 generations, as well as the Pixel 5a and Pixel 6a. But if you're fine with buying an older phone, there's still a lot to like here.\nThere's slick Google Assistant integration, a clean Android interface with three years of guaranteed updates, and a seriously impressive photography experience considering the Pixel 4a has just one rear camera.\nHowever, pull out the spec sheet and compare it to similarly priced rivals and the Google Pixel 4a doesn't seem like such a great deal, with less power, less RAM, fewer cameras, a smaller screen and no 5G connectivity - although the Pixel 4a 5G variant is coming in mere weeks with even better specs albeit at a higher price, alongside the Google Pixel 5 (which will also be 5G enabled).\nBattery life is mediocre, with the phone just about lasting a day on a single charge – and if you really push it you'll be reaching for a charger come late afternoon.\nThe design will be divisive. On the one hand it's a cutesy, curvy polycarbonate handset that sits comfortably in the palm, and its lightweight frame makes it easy to hold and use. There's a rear-mounted fingerprint scanner, there's almost no screen bezel, and there's even a headphone jack.\nOn the other hand, it feels a little cheap, and it lacks the premium gloss of other handsets in its price bracket.\nIf you're thinking about getting the Google Pixel 4a you'll need to carefully consider what's important to you when it comes to a new smartphone. If you're looking for maximum bang for your buck, and features galore, the Pixel 4a is unlikely to whet your appetite.\nThat said, its compact size, clean interface and great point-and-shoot camera will appeal to those looking for an affordable, reasonably sized handset with enough grunt for social media, web browsing and emails, plus the ability to capture some excellent pictures.\nCheck out our special Google Pixel 4a unboxing video below\n"
    },
    "Google Pixel 6 Pro review: The first top-tier Google Pixel phone": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Google Pixel 6 Pro is an exciting challenger to some of the very best smartphones on the market, and it’s the first genuinely top-tier handset from the company. If you want to experience Android software in its purest form, this is the handset to buy right now. Plus, it has a beautiful screen and a superb camera – and it all comes for a price that’s a touch lower than its main competition.\n\nPros\n\n+Multitalented camera+Big and beautiful screen+Comes running Android 12\n\nCons\n\n-Contentious design-Limited storage-Average battery life\n",
        "review": "The Google Pixel 6 Pro is the company’s first serious attempt at a top-end device that can take on the very best smartphones currently on the market, such as the Samsung Galaxy S22 Ultra, OnePlus 10 Pro and iPhone 13 Pro Max.\nLaunched alongside the standard – and considerably cheaper – Google Pixel 6, this new Pro variant is designed to be the very best from the company, packing its new Tensor chipset and other high-end internals, a great camera setup, and a variety of other improvements.\nIt’s also designed to be the perfect showcase for Android 12 and its future variants, and it’s safe to say that Google has nailed it with this iteration of its smartphone.\nThe design of the Google Pixel 6 Pro is strikingly different – although it’s not unique, as it shares a look with the Google Pixel 6 – with a camera band that spans the entire width of the phone and houses its powerful new camera array.\nIt’s a look you’ll either love or hate, and Google has paired the design with some bold color choices for those who are bored of smartphones that look like small gray rectangles.\nGoogle’s display technology here is particularly impressive, and we guarantee that this will be one of the best smartphone displays you’ve ever used. It offers great picture quality, the brightness levels are consistently impressive, and it’s huge at 6.7 inches.\nThe new Tensor chipset inside the Pixel 6 Pro is another standout feature. We’ve yet to see it deliver any significant improvements over phones that use more traditional chipsets, but it’s still easily powerful enough to boot up your favorite apps and games, and that’s what really matters.\nThe Pixel 6 Pro’s camera setup is another highlight; it’s a versatile array that enables you to capture a wide variety of subjects in a few different ways.. The main camera’s sensor is a step up from what we’ve seen from Google before, and new software upgrades only heighten the experience.\nThe Pixel 6 Pro’s battery life is passable – it’ll see you through a full day of typical use, but not much more. It comes with fast-charging and wireless charging technology, but neither of these are particularly impressive either. \nWhile the Pixel 6 Pro isn’t the best smartphone money can buy right now, it comes pretty close. Google has stepped up its smartphone game lately, and this next-gen Android headliner is its crowning achievement.\nA particularly strong camera, a fantastic screen and a great software experience all add up to a genuinely top-tier package. It doesn’t sport the best battery life or power, but those minor shortcomings aside, the Pixel 6 Pro finally sees Google take its place at the smartphone industry’s top table, with the device easily ranking among the best Android phones.\n"
    },
    "Motorola Edge 30 Pro: Premium performance at a mid-range price point": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "As Motorola's current flagship, the Edge 30 Pro maintains the company's reputation for delivering quality phones at good prices. The Edge 30 Pro is up there with the best when it comes to performance, battery life and display, however, some cost-cutting measures will occasionally remind you that it is indeed a mid-tier device.\n\nPros\n\n+Ultra-smooth 144Hz OLED display+Excellent performance+Super-fast 68W charging\n\nCons\n\n-Only Gorilla Glass 3 on front-Cameras sound better than they are-Only 3 years of security updates\n",
        "review": "Having settled into its niche of providing smartphone experiences that straddle the line between mid-range and premium, Motorola has once again delivered on that approach with its latest flagship, the Motorola Edge 30 Pro.\nIt's a phone that absolutely keeps up with the big players when it comes to performance, even managing to outmatch Samsung's premium Galaxy S22 series, which shares the same Snapdragon 8 Gen 1 chipset. \nThrow in an ultra-smooth 144Hz FHD OLED display and near-stock implementation of Android 12, along with lightning-fast 68W charging capability and commendable battery life, and what you have is a surprise contender for our best phones of 2022 roundup – and all at a very reasonable price.\nThat said, the Edge 30 Pro's aggressive price point does come with some significant trade-offs in other areas. For starters, its 50MP primary camera isn't as great as it sounds on paper – particularly when tested in low light scenarios. \nAnd, in terms of toughness, the Edge 30 Pro cuts costs by offering a plastic frame and older Corning Gorilla Glass 3 protection on its display, making it great against scratches but more susceptible to shattering if dropped. \nIt's also worth noting that while the Edge 30 Pro has ditched the headphone jack this time around, it still only carries IP52 certification, meaning it will survive splashes of water but not a full submersion.\nAnd, if you're looking for a device that will go the distance, you should know that Motorola only promises three years of security updates for the Edge 30 Pro, and just two major Android updates.\nStill, there's plenty to love about Motorola's latest flagship – if you're happy with merely a decent camera experience, and don't mind replacing your handset after a few years, the Edge 30 Pro's exceptionally snappy performance and brilliant display make it well worth the asking price.\n"
    },
    "Hands on: Xiaomi 12s Ultra: Xiaomi's mightiest flagship marks a breakthrough in camera technology": {
        "rating": "",
        "summary_pros_cons": "The Xiaomi 12s Ultra is a showcase piece that highlights just how far Xiaomi has come as a brand and a smartphone maker. Partnerships with Leica and Harmon Kardon, world-first camera tech, and excellent real-world results make the phone a mighty option. While it's no doubt frustrating that it isn't available in the West, it should ensure photography enthusiasts keep Xiaomi firmly in their sights going into 2023.\n\nPros\n\n+Best-in-class camera hardware+Premium styling and build+Quality 120Hz AMOLED display+Mighty performance\n\nCons\n\n-No Western release planned-A thick profile and heavy weight-Inconsistent quality across cameras-Pre-installed bloatware\n",
        "review": "Considering the Xiaomi 12s Ultra is a flagship camera phone with the latest Qualcomm Snapdragon 8 Plus Gen 1 power, you'd expect it to be one of the priciest smartphones on the scene. But phones generally cost less in China than in the UK or US, especially Chinese phones. That's why the Xiaomi 12s Ultra costs less than the Samsung Galaxy S22 Ultra and iPhone 13 Pro Max, even if you import it.\nThe Xiaomi 12s Ultra comes in two colors, Classic Black and Verdant Green, with the latter looking more like a light grey. Both flavors pack leather-styled backs and cost the same.\nWith no availability in the UK or US, import prices will likely vary wildly. If you're thinking about picking one up, shop around and check reviews of the importer you use to make sure you get a legitimate Xiaomi 12s Ultra.\n"
    },
    "Hands on: Motorola Edge (2022): Moto aims for the middle": {
        "rating": "",
        "summary_pros_cons": "The Motorola Edge (2022) is remarkably light for such a huge battery, which makes it especially appealing at this price. \n\nPros\n\n+Very large 5,000mAh battery+Incredibly light to hold\n\nCons\n\n-Underpowered cameras-Not a RAZR\n",
        "review": "There is one new Motorola Edge for 2022; no numbers or Pro or Plus or Max attached. It's set to go on sale in the coming weeks on T-Mobile first, for $498. If you’re an international reader, it can be hard deciphering Motorola’s model numbers, but here in the US it is very simple.\nMotorola isn’t giving us a specific timeline, but after T-Mobile, the Edge will show up on AT&T, Verizon, Spectrum Mobile, UScellular, and Visible. No word on Dish Network’s new Boost Infinite, which will also launch this fall. Boost has offered Motorola Edge devices in the past, though. \nThe new Motorola Edge (2022) will also eventually be available unlocked at Best Buy, Amazon, and Motorola.com, for $499.99.\n"
    },
    "OnePlus Nord review: The OnePlus Nord is an emphatic return to the mid-range": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "With the OnePlus Nord, OnePlus has made an emphatic return to the mid-range market – it's an affordable smartphone that's packed with features. There's a great screen, plenty of power, and a set of capable cameras, all wrapped up in a package that belies its affordable price.\n\nPros\n\n+Affordable with flagship qualities+Premium design+Plenty of camera features\n\nCons\n\n-Average battery life-Limited notifications space-No IP rating for water resistance\n",
        "review": "The OnePlus Nord represents an emphatic return to the combination of style, features and affordability that made the brand stand out when it arrived on the smartphone scene in 2014 with the OnePlus One. \nIt offers an almost-flagship experience - as our OnePlus Nord review will go on to detail - at a comfortably lower price tag than the OnePlus 8 series, blending premium design, slick performance and great cameras for a heady mix of smartphone satisfaction.\nThis isn't the newest OnePlus phone, and it even has a few follow-ups. There's the Nord N10 5G, a cheaper version of the Nord, and the N100, a really low-cost iteration of the same idea. There's also the Nord CE and Nord 2, two 2021 smartphones that succeed the original device. \nBut if you're still interested in the phone that started the OnePlus Nord range, you're in the right place.\nThe difference between 2014, when the OnePlus One was released, and 2020 is that the market has moved on significantly, and OnePlus is no longer the challenger brand looking to upset the apple cart. The OnePlus Nord finds itself in a crowded mid-market filled with equally feature-rich devices, making it tougher for the phone to stand out.\nWith rival devices such as the Google Pixel 4a, Poco F2 Pro, Realme X50 5G, Moto G 5G Plus and Mi Note 10 Lite, there's never been a better time to be in the market for an affordable flagship device - and it makes the Nord's job that much harder.\nThe OnePlus Nord price is eye-catching though, and the handset offers plenty for your money. OnePlus says the Nord is \"pretty much everything you could ask for\", and it's got a point.\nThere's a sizable display offering a smooth user experience, enough power under the hood, and plenty of cameras, all wrapped up in a premium design. It looks good, it feels good in the hand, and it performs superbly.\nWith so many cameras – OnePlus has possibly gone a little over the top here – you get a wide range of photography options from portrait and macro to ultra-wide and nightscape modes, plus 4K video recording at 30fps with both the front and rear cameras. There's also up to a 10x zoom, plus slow-motion video recording at 1080p and 240fps.\nThe negative points on the OnePlus Nord are minor: there's no headphone jack, no IP rating for dust and water resistance, and no wireless charging on offer. \nThe battery life is average – it should see you through a day, but this is a phone you'll need to be charging every night – and there's not much room for notification icons across the top of the display, thanks to the dual selfie cameras.\nThe bigger point here is, where does the Nord leave the firm's top-tier handsets? If the OnePlus Nord really is \"pretty much everything you could ask for\", why should anyone (especially OnePlus' price-conscious fans) fork out considerably more cash for the OnePlus 8 or OnePlus 8 Pro? It'll be interesting to see how the Nord's arrival affects future sales of the brand's flagship devices.\nRight now though, if you're in the market for an affordable smartphone that offers a near-flagship experience, the OnePlus Nord delivers... but so do plenty of others. Still, it was undeniably one of the best OnePlus phones at launch.\nBelow is our video review of the OnePlus Nord\n"
    },
    "Samsung Galaxy Z Fold 3 review: The best foldable phone – so far": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Samsung Galaxy Z Fold 3 is the first foldable phone that we recommend to people who would normally call themselves ‘early adopters’, yet held off on buying 2020’s Z Fold 2 for good reason. Those fence-sitters will be swayed by the Z Fold 3’s S Pen support, greater durability and water-resistance in an otherwise familiar-looking foldable design with unchanged cameras. It’s still mighty expensive, and therefore not for the average consumer, but it starts at a slightly lower price than its predecessors, making it ideal for those who've been looking to buy into the form factor but have been waiting on the sidelines.\n\nPros\n\n+S Pen support – finally+More durable design+Slightly cheaper than Fold 2\n\nCons\n\n-Still very expensive-Cameras could be better-No front-screen S pen support\n",
        "review": "The Samsung Galaxy Z Fold 3 is designed to convince you that the third time's a charm when it comes to buying into the future of foldable phones, and without a Galaxy Note 21, there's a lot of pressure on Samsung to make good on that adage.\nBefore we get to the review though, it's worth noting that Samsung has since unveiled the Samsung Galaxy Z Fold 4, along with the Samsung Galaxy Z Flip 4, so if you want the company's latest foldables then they're worth a look - though their launch could soon mean price drops for this model.\nWe conducted weeks of testing for this Samsung Galaxy Z Fold 3 review and it quickly became the first foldable phone that we could recommend to those who would ordinarily consider themselves early adopters, but who passed up on the first two iterations of Samsung’s foldable.\nWe've been closely evaluating its familiar 2-in-1 design, determined to fold and unfold the 7.6-inch flexible display until we could do it in our sleep in order to properly test its durability. \nThe result? This version of Samsung’s foldable phone feels stronger than its two predecessors: it’s waterproof this time, while its mini-tablet-sized inner screen withstood our meanest stylus strokes with the new S Pen and S Pen Pro.\nS Pen support makes perfect sense on a screen of this size, and it was something that people were clamoring for with the first two Folds. There’s more writing and drawing real estate here than on any Galaxy Note smartphone, yet not so big that it’s inconvenient like a full-sized traditional tablet that has to be stowed in a  bag. The Galaxy Z Fold 3 can be closed to half and stuck in a pocket.\nIt may well change the way you use your phone day to day, especially if you spring for the S Pen and a case to carry it in – unfortunately, the stylus is sold separately and doesn’t tuck inside the phone. That inconvenience will be jarring for long-time Note fans, even if we found the new stylus bigger and easier to use than the Note’s toothpick-sized S Pen. \nAlso, you’ll need to dial back your camera expectations: this is yet another foldable with cameras that are good, but which lack the zoom-in oomph of the Samsung Galaxy S22 and 2020's Note 20 Ultra. There is one standout camera perk: an under-the-screen camera neatly obviates the need for punch-hole on the more seamless inner display, although the 4MP camera quality loss is noticeable.  \nThe big hook to the Galaxy Fold 3 is its slightly cheaper price compared to the Galaxy Z Fold 2. Those who had their doubts about the first two generations of Samsung’s foldable, were right to hold ‘em, but now it may be time to fold ‘em, as this truly is one of the best Samsung phones, and will likely still remain a worthwhile machine, event when its successor, the Galaxy Z Fold 4, arrives.\n"
    },
    "iPhone 12 Pro: The iPhone 12 Pro is still a top iPhone with great specs": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "At first glance, the iPhone 12 Pro looks like a phone that's caught between two stools. With the same dimensions and chipset as the iPhone 12, it’s easy to wonder whether the Pro is worth the extra cash – especially when the iPhone 12 Pro Max and iPhone 13 range are out there with better features. There are some useful upgrades here – not least the camera, and the jump to 128GB of storage in the cheapest model, and it also comes in more muted, premium-looking colors. It's the more mature iPhone for sure – but it's tough to say it's got enough to encourage you to upgrade.\n\nPros\n\n+Nice color choices+Most powerful smartphone out+MagSafe technology works well\n\nCons\n\n-No charging block in box-5G still an expensive luxury-Battery could be better\n",
        "review": "The iPhone 12 Pro was one of the most feature-rich iPhones you could buy when it launched. It offered some of the greatest features inside and was a tempting proposition for anyone needing more raw power than the iPhone 12.\nWhile it's no longer the best Apple handset you can get now that the iPhone 13 Pro has been released, given how few features have been added, you're safe opting for the iPhone 12 Pro instead if you can find it a bit cheaper. Apple has taken the 12 Pro off its official lineup, though, so you'll only be able to buy it at third-party retailers.\nAnnounced alongside the iPhone 12, iPhone 12 mini and iPhone 12 Pro Max, the iPhone 12 Pro's key upgrades over the standard iPhone 12 are subtle: there's slightly more RAM, but the same chipset inside. There are three camera sensors on the rear, not two, so you can now get closer to subjects and scenes with 2x optical zoom. \nThe addition of LiDAR - that's a new sensor on the rear camera to judge distance - brings more focusing options, and paves the way for more advanced augmented reality features in the future. But otherwise, the Pro is largely the same as the 'standard' iPhone 12 – it has exactly the same size, shape, screen technology and resolution, and debuts 5G and Apple's MagSafe tech on an iPhone too.\nThe iPhone 12 Pro design is both futuristic and retro at the same time: the 6.1-inch OLED display is clear, bright, and extends further to the edges of the phone, meaning the 12 Pro is actually smaller than the iPhone 11 Pro in the hand.\nHowever, you'll notice instantly that the curved edges are replaced with stark, flat, industrial-looking sides – you lose the feel of the phone nestling into your hand when you pick it up, but it does feel more compact.\n5G is an interesting addition. Apple clearly knows that it needed to bring the super-fast connectivity standard to the non-Android masses, and by including it in every new iPhone, it's given the still relatively new tech a big shot in the arm.\nHowever, we're 5G still isn't available everywhere, and it's a noticeable drain on battery life – as 5G becomes more prevalent, and cheaper, so will the iPhone 12 Pro become a more useful phone.\nThe same can be said about the new MagSafe ring inside the rear of the phone. This lets you connect a variety of accessories to your iPhone, and it'll intelligently know what those are. Currently you're limited to a fast wireless charger, cases that tell the phone what color they are, and a clip-on credit card holder, but we're excited about the potential for this technology – and, as with 5G, as more MagSafe items are made, so will the utility of the 12 Pro improve.\nThe key thing you'd buy the Pro for is its cameras, and both the photos and videos they capture are superb. The vibrancy of the movies we shot, and the clarity and smart processing of the snaps, made us eager to share them with friends, and encouraged us to experiment more with the camera. Night mode is absolutely stunning too, if not a little slow to process your snaps.\nIn our iPhone 12 Pro review we found that battery life could be better – it's distinctly average in the 2020 smartphone environment. It's fine if you're not moving around too much, but if you're on the go and using the phone moderately, you'll see the charge meter dropping a little faster than you'd like. It feels like a tradeoff for the addition of 5G, so you'll need to decide whether that's a compromise you want to make.\nThat said, if you're upgrading from a iPhone from several generations earlier, you'll still see an improvement in battery life.\nWe've been struggling to see what in particular is great about the new iPhone 12 Pro, especially compared to the iPhone 12. The camera experience is the main thing that stands out, and the extra hardware in the form of the 2x zoom and the LiDAR feel like good reasons to spend a bit more.\nIf those things aren't important to you, the iPhone 12 is probably a better buy; but, if you want those things and more, you might want to spend extra and opt for the iPhone 12 Pro Max instead.\nOf course, if you're not married to Apple there are also Android alternatives to consider, such as the Samsung Galaxy S21 and OnePlus 9 ranges, which also offer compelling flagship experiences. But the iPhone 12 Pro largely holds up well against them - despite these phones being newer than Apple's.\nIt remains one of the best iPhones, but if you just want the best phone from any brand then consider the Samsung Galaxy S22 Ultra.\n"
    },
    "iPhone 12 Pro Max review: Still one of the best big iPhones on the market": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "If you’re looking for one of the best iPhones on the market, the iPhone 12 Pro Max is still worth checking out: it’s powerful, has the longest battery life on an iPhone we tested in 2020 and the camera is top-notch. You'll need to be ready to carry the extra heft, as this is a large iPhone indeed, and the cost isn't to be sniffed at, but we're adding an extra half star for all those iPhone fans that just want the best Apple can bring – the iPhone 12 Pro Max manages to do that rather well.\n\nPros\n\n+Great screen+Longer battery life+Powerful camera\n\nCons\n\n-Feels almost too large-The most expensive iPhone-Camera not hugely better than the 12 Pro\n",
        "review": "The iPhone 12 Pro Max was the biggest iPhone Apple had ever made when it launched and it was easily the best. It was also very expensive at $1,099 / £1,099 / AU$1,849 although it's now a touch trickier to track down as Apple no longer sells it directly. \nSure, this iPhone 12 Pro Max review is now a little old given that the iPhone 13 Pro Max is here, but for cost or availability reasons, you might still be considering Apple's top-end mobile of 2020.\nWhile Apple keeps around older basic models in its lineup, it typically quietly retires the larger versions, meaning you'll be able to find the iPhone 12 Pro Max at other retailers, probably at a discount, but not directly from Apple. \nThe design of the 12 Pro Max mirrors that of the other handsets in 2020's iPhone 12 family: there’s a new flat-sided frame, which looks more industrial, and is a little less comfortable to hold than last year's model. It's a whole new look that's actually a bit old, given it debuted in the iPhone 4 a decade ago, but made a comeback in recent iPad Pro models. \nGiven how incremental the upgrades are on the iPhone 13 Pro Max, though, we'd still recommend the iPhone 12 Pro Max as a top choice for fans of big Apple phones. The arrival of iOS 15 also adds plenty of new functionality, from improved Apple Maps to more nuanced Messages functionality to watching or listening to media with others via SharePlay. \nThe iPhone 12 Pro Max is decked out in premium-looking, more muted colors though, and we're fans of the shiny metal rim around the edge (despite the fact that it's a real fingerprint magnet). It gives the big phone a modern and industrial look.\nWhile the iPhone 12 Pro Max is actually only a very small amount bigger than 2019's 11 Pro Max, the bezels around the OLED display have been shrunk to allow Apple to increase the screen size to 6.7 inches – and it's a compelling reason to pick up the new larger iPhone.\nImages are clearer and more visible on the larger display, you can see more of a web page or image in daily use – and as a movie-watching machine it was the best iPhone ever at launch. It's one of the best displays on the market, able to render both colorful scenes and more subtle tones with ease.\nThe headline feature on the new iPhone 12 Pro Max is the camera array: there are three cameras, all upgraded with a better image processor. While the camera block protrudes from the rear of the phone more than on recent iPhones, the main 12MP sensor has been upgraded to capture a lot more light, and enhancements have been made to the image processing too – some of the photos we took were really impressive.\nHowever, the 12 Pro Max wasn't that far ahead of the iPhone 12 Pro's camera performance in our tests, which was surprising – images were, on the whole, clearer and brighter from the 12 Pro Max, but not by a huge amount.\nIf you're a budding movie-maker, we'd say it's definitely worth looking at the 12 Pro Max – it's packing Dolby Vision recording at 4K and 60 frames per second, so if you’re a content creator looking for a phone that can record high-quality footage, the 12 Pro Max can definitely do that.\nHDR will also make your movies look better, with improved brightness and color; however, it can look a little artificial, and clips will take up more storage space on your phone. It's not a feature that most should look to upgrade for.\nThe 12 Pro Max starts at 128GB of storage, which is the bare minimum we’d expect, as the cameras will fill it up quickly – and with 5G on board you'll be able to download content faster, making it easier to fill up your phone with movies and music too.\n5G is the future of mobile connectivity, but it's not in itself a reason to buy the iPhone 12 Pro Max... yet. Many parts of the world still don't have 5G coverage, so many users will find this feature redundant for now. In the next few years connectivity will become much more widespread though, so buying a 5G iPhone is more about future-proofing than enjoying next-gen speeds right now, unless you live in the heart of a major city.\nAnd 5G mostly just brings faster speeds (though it’s faster than even Wi-Fi for most), so you might not feel like that's something that’s missing from your life right now.\nApple has also added the innovative MagSafe tech to the iPhone 12 Pro Max, which enables you to magnetically clip chargers, cases and accessories to your new iPhone. We like this addition, and more accessories are appearing all the time right now; MagSafe will only get better as time goes on, and getting the iPhone 12 Pro Max will future-proof you as more accessories appear on the market.\nAlong with the larger display, one of the big reasons to go for the iPhone 12 Pro Max is the battery life – it has the biggest battery of all the new iPhone 12 range thanks to having the largest chassis. We easily crested a day of use in our testing, and even on days when we really pushed the battery hard we got to 7:30pm before we needed the charger – if you've read our iPhone 12 Pro review, and have concerns about whether it'll last long enough, we advise moving up to the Max.\nIf you want the best of all things in an Apple smartphone, the iPhone 12 Pro Max is it. The large and bright display, the enhanced camera, the longer battery life and awesome grunt inside make this a compelling smartphone. If your hands can cope with the extra heft (and your wallet with the heftier price), this is the model to go for.\nHowever, if the Pro Max feels a bit more than you need, or is beyond your budget, the iPhone 12 Pro offers a similar feature set and performance for less (although without the extended battery life) – and the difference between the cameras isn't as marked as we expected.\nIf you're open to Android then there are also a few other top-flight phones to consider, most notably the Samsung Galaxy S21 Ultra, which at the time of writing tops our list of the best smartphones. You might also want to take a look at the OnePlus 9 Pro, which matches or beats the iPhone 12 Pro Max in many areas while coming in at a slightly lower price.\n"
    },
    "Xiaomi Poco F3 review: The Poco F3 puts on an awesome display": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "With class-leading performance, an outstandingly bright and fluid display, and a tidy design, the Poco F3 might just have you renouncing flagships for the foreseeable future. Only a mediocre camera and the usual MIUI quibbles threaten to sour an outstanding deal.\n\nPros\n\n+Bright and responsive display+Great performance within its class+Solid, classy build\n\nCons\n\n-MIUI is full of annoyances-Mediocre camera-No wireless charging\n",
        "review": "The Xiaomi Poco F3 is a considerable step up from the Poco X3 NFC in virtually every regard, including price. But it still represents a bit of a bargain considering what you’re getting.\nWith an extremely fast Snapdragon 870 chipset and an impeccable 120Hz AMOLED display, it gets closer to that flagship feeling than the vast majority of sub-£400/$500 phones.\nGamers and media fiends on a budget, in particular, will want to bump the Poco F3 to the top of their wish list. We simply can’t think of a more capable phone for the money - not with such a responsive display and near-flagship levels of performance, at any rate.\nBattery life is strong, too, with the Poco F3 capable of standing up to a day of intensive usage. Meanwhile, the provision of a 33W fast charger is both more generous and more rapid than any current offering from Apple or Samsung.\nCompromises have been made to hit that lower-mid-range price point, of course. You’ll have to make do with a plastic frame rather than a metal one, there’s no wireless charging, and you’ll have to get by without an IP rating.\nBut the most consequential rollback is the phone’s camera system, which is somewhat disappointing. While images look sharp and natural using the 48MP main camera in good lighting, the Poco F3 lacks photographic chops in every other area. Its ultra-wide offering is mediocre at best, and there’s no telephoto camera to call upon. Night shots, too, lack definition.\nElsewhere, MIUI (Xiaomi's Android skin) continues to be a bit of a mixed bag. It’s highly customizable and plenty fluid, but it’s not without bloatware, and there are a couple of irritating rough edges that you simply don’t get with a more stock Android-oriented UI.\nNone of that is enough to stop the Xiaomi Poco F3 from being a deeply compelling option at the price and ranking among the best Xiaomi phones. Using the phone day to day simply feels more flagship-like than any of its contemporaries, whether that’s the Samsung Galaxy A52 5G or the Google Pixel 4a.\n"
    },
    "Google Pixel 6a review: A budget blower with a big drawback": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Google Pixel 6a has features that might appeal to Pixel fans including its smaller form and faster fingerprint scanner, but those are largely cancelled out by its weak battery life and slow charging. It’s priced a little too high to truly compete with the Pixel 6 too, so it’s not going to turn heads as much as Google likely hoped.\n\nPros\n\n+Snappy fingerprint scanner+Relatively compact size+Clean software\n\nCons\n\n-Poor battery life-Slow charging speed-A touch too expensive\n",
        "review": "We found it hard to review the Google Pixel 6a. Normally, cheap alternatives to flagship phones are interesting, thanks to their competitive price points and feature sets - but one major and one minor issue makes the new phone hard to recommend.\nLet's start with the minor one - it's the existence of the Google Pixel 6, to which the 6a is purportedly a budget alternative. Thanks to nine months of price reductions and deals, the older model costs pretty much the same as the newer one - in some regions, the Pixel 6 has actually been cheaper - despite the older phone having more impressive specs.\nSo it’s hard to recommend the lesser phone when the more premium one won’t set you back much more, though some of the Pixel 6a’s features, like the smaller size and improved fingerprint scanner, may appeal to some.\nThe bigger issue is the phone’s battery life. We’re not going to mince words here, it’s absolutely dreadful. Getting the phone to last for a full day of use was almost impossible- in fact, we didn’t always get it through a full waking day even when battery saver mode was turned on.\nRarely when testing phones do we get such battery anxiety - though technically ‘battery anxiety’ is when you’re worried your phone won’t last through the day, and we had no worry since we were certain it wouldn’t. The charging speed doesn’t help either, with the 18W powering being one of the slowest we’ve seen on a phone of this price.\nSince battery life is such a core aspect of a phone, it’s hard to recommend the Google Pixel 6a, despite there being some strong qualities to the phone.\nAs we’ve mentioned, the phone is smaller than its siblings, making it easier to hold and use without stretching your fingers. It’s also got a snappy and intuitive fingerprint scanner, fixing an issue that many people had with the Pixel 6 and 6 Pro.\nIt’s also a decent little alternative to its siblings in its own right, with the same chipset, a good-looking screen and many of the same AI-powered camera features that made the Pixel 6 Pro one of our favorite camera phones.\nIt’s a real shame that the Google Pixel 6a’s battery life is such an Achilles’ heel, because if the phone lasted even just a little bit longer - and if the price was a little more competitive - it’d be a really great budget handset.\nThe battery life issue won’t ruin the phone for everyone, but it does make you stop and think “can I use a phone that needs charging multiple times per day?” If you can, that’s great. But we imagine lots of people will rule out the phone based on this simple issue.\nLooking for the perfect audio pairing for the Pixel 6a? Check out our review of Google Pixel Buds Pro.\n"
    },
    "Xiaomi Poco X4 Pro 5G review: Not the Poco you know": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Xiaomi Poco X4 Pro doesn’t feel like a Poco phone but is a sound buy if you’re looking for a strong screen, battery life and speakers, and can live with its limited gaming power and inconsistent camera.\n\nPros\n\n+Vibrant OLED screen+Less bulky than its predecessors+Long battery life\n\nCons\n\n-Inconsistent camera; poor Auto HDR-Weak gaming performance for a Poco phone-Annoying charging and app-closing bugs\n",
        "review": "The Xiaomi Poco X4 Pro 5G isn’t a typical Poco phone. Headline-grabbing Poco handsets of the past have had truly exceptional characteristics in one area. That was performance in the Pocophone F1, Poco F3 and Poco X3 Pro; and at the time, the Poco X3 NFC was almost unbeatable for its sheer value.\nXiaomi’s direction with the Poco X4 Pro is less clear, not helped by it effectively being a near-replica of the Xiaomi Redmi Note 11 Pro, with a few tweaks.\nYou don’t get the standard-setting performance of the classic Poco models. And while the 108MP camera is solid enough by the standards of the series, it doesn’t challenge a Google Pixel 5a or OnePlus Nord CE 2 5G. \nWith the Poco X4 Pro, Xiaomi is aiming for a balance that has rarely been the focus of the Poco series. \nDoes it work? Somewhat. The design is less of an eyesore over some Poco phones. Its OLED screen is largely excellent, the stereo speakers well above average, and battery life is great. A glass, rather than plastic, rear is a nice touch, too. \nHowever, there are some issues. The Xiaomi Poco X4 Pro has an annoying habit of closing down any apps running in the background, which isn’t helpful if you stream audio through your phone.\nIts charging behavior is strange, too, with a bug causing the screen to continually light up. Plus, the Snapdragon 695 processor doesn’t really belong in a Poco phone, as they’re typically more powerful than that.\nThe often very cheap Poco X3 Pro is almost three times as powerful as the Poco X4 Pro 5G by some gaming metrics. While the 108MP camera appears to make up for it on paper, this doesn’t pan out in practice due to a weak Auto HDR mode that too-frequently results in overexposure and dull-looking pictures. \nThis phone may get better all-round with successive software updates. But if the aforementioned issues are tied to the compromises inherent in its Snapdragon 695 processor, it may well not. There’s plenty to like here, but we can’t help but feel that Poco series fans will end up disappointed by the Poco X4 Pro 5G. \n"
    },
    "Xiaomi Poco M4 Pro 5G review: An appealing budget phone with 5G": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "There's no doubt that the Xiaomi Poco M4 Pro 5G gives you an Android phone that's great value for money at the budget end of the market – but it perhaps cuts one too many corners for it to truly stand out in what is an increasingly competitive part of the market.\n\nPros\n\n+Very decent price+Strong design aesthetic+Ready for 5G\n\nCons\n\n-Not a huge upgrade-Average camera quality-Not the best Android skin\n",
        "review": "Like the Poco M3 Pro 5G before it, the Poco M4 Pro 5G is a budget handset from Xiaomi that aims to squeeze the maximum amount of value out of not much money: £219 / AU$450 (around $300) and upwards, to be exact.\nFor a lot of people, cost is the first and most important consideration when it comes to picking a smartphone, and when it comes to affordability the Xiaomi Poco M4 Pro 5G definitely delivers.\nIn return for your cash you get a decent-looking smartphone with a big, bright screen. While performance isn't spectacular (and not much of an improvement over its immediate predecessor), the handset will do everything you need it to do with the minimum of fuss (and with plenty of time between battery charges as well). For some, that might be all they need to know.\nDig a little deeper though, and you can see where Xiaomi has made its savings. The camera setup on the Poco M4 Pro 5G isn't fantastic, and you're also missing out on extras like Wi-Fi 6, waterproofing and wireless charging. It's really a question of what your priorities are and how much you're willing to spend on your next smartphone.\nXiaomi's MIUI isn't one of our favorite takes on Android, though that's more of a personal point of view than an objective assessment – there's just a bit too much bloat and extraneous flotsam for our tastes, though it's fair to say that the software is very customizable. You do at least get the bonus of 5G with this phone, so you're all set for the next-gen connectivity revolution.\nIf you're shopping for the best budget phone, then the Xiaomi Poco M4 Pro 5G has to be in the conversation at some point. However, with middling performance and only satisfactory camera quality, it's really the low price of the phone, the display, and the battery life that sells it the most.\nIn terms of direct competitors, the £170 / $200 / AU$299 Moto G31, the £229 /$279 (around AU$365) Samsung Galaxy A32 5G and the £199 / $299.99 /AU$449 Nokia G50 are also worth weighing up, and the Poco M4 Pro 5G certainly stands up well against them.\nHowever, you don't have to spend all that much more cash to get improvements like an OLED screen and a superior camera setup.\n"
    },
    "Xiaomi 12 review: Small body, high price": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Xiaomi 12 is an attractive flagship phone that’s a little rough around the edges. While its small form, attractive design and fast charging ensure it plays well in the big leagues, its cameras, display and software experience are only ‘okay’. Given that this is a high-price flagship phone, we had hoped for better.\n\nPros\n\n+Feels great in the hand+Charges quickly+Some fun camera modes\n\nCons\n\n-Gets hot when gaming-No zoom camera-Irritating software issues\n",
        "review": "We thought the Xiaomi 12 would be a close rival to Samsung’s Galaxy S22, but it’s not. Rather, it’s a message from the rapidly-growing Chinese company to its stalwart Korean rival: “this is how you make a small-form flagship phone”.\nThe standard entry in Xiaomi’s 2022 family of flagship phones – launched alongside the Xiaomi 12 Pro – this handset is the company’s first major device to eschew its typical mantra, bigger is better. Instead of putting out a giant smartphone, the 12 has a relatively small form and lesser specs to match. The Pro does all the heavy lifting with a huge screen, powerful camera array and fast charging.\nIn that way, the Xiaomi 12 is comparable to the Samsung Galaxy S22: it too is a small-form alternative to its Plus and Ultra siblings, offering good specs in a phone that you don’t need to stretch your fingers to use. They both cost a similar amount.\nXiaomi beats Samsung in a few key ways though. The 12 has a curved-edge display that really makes the phone comfortable to hold, the charging speed on the Xiaomi 12 is dramatically faster than on the S22, and its battery is a lot bigger too.\nThat’s not to say it’s a perfect phone: the device has a few rough edges that cropped up now and then during our testing process.\nXiaomi offers a few fun camera modes, like Sky editing which lets you digitally replace the sky in photos, or a fantastic macro option for close-up pictures. However, it’s missing an arguably key flagship feature: a telephoto lens for zoom photography. This leaves only digital or ‘cropping’ zoom when you use the camera app, and it means the phone isn’t amazing if you want to close the distance for a photo.\nXiaomi is one of a few phone brands that often only offers zoom cameras on the most premium products, but it’s a shame the feature is missing here. At least that issue is an intentional one; there are a few other problems with the phone that don’t seem like features.\nFirst of these is the chipset – the Snapdragon 8 Gen 1 is very powerful, making it great for tasks that need lots of power, but it has a problem common in all the devices we’ve tested it in: it can get hot quickly. When taking the Xiaomi 12 through a few quick games of Call of Duty: Mobile or PUBG Mobile, the device warmed up to a noticeable extent. That was also the case when we first booted up the phone or charged it at all.\nThe Xiaomi 12 runs Android with the company’s MIUI laid over the top, which remains a divisive software. While it offers lots of customization and security tools, it has a few annoying features and bugs too – we found apps would frequently just close without our input, gesture navigation was surprisingly sensitive, and a security scan that’s done when a new app is installed always shows you an overlay above whatever else you were doing.\nNone of these problems ruin the experience of using the phone, but they’re all pretty annoying when you bump up against them.\nWe do need to point out that this isn’t the successor to the Xiaomi Mi 11, despite the name. That phone was bigger with a high-res display, which the Xiaomi 12 Pro has inherited - however, it does cost a fair amount more. The new Xiaomi costs the same as the older one, despite being smaller and having a lower-res display. So depending on what you’re looking for, you might find the 2021 flagship a better choice.\nSince Xiaomi steered its flagship series away from its mid-range roots towards a more premium market tier, it’s been putting out good phones, but nothing that really wowed us like some of its fantastic value-for-money mid-range offerings like the Mi 9 or Mi Note 10. \nThe Xiaomi 12 is the same: it’s a decent phone, with lots of useful features, and it’s a good rival to lots of similar-priced mobiles. In fact it's one of the best Android phones and certainly one of the best Xiaomi phones. But you’re getting what you pay for, and not a drop more.\n"
    },
    "Xiaomi 11T Pro review: A decent mid-ranger with a better sibling": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Xiaomi 11T Pro comes at a very competitive price, with a camera array, chipset and charging speed that are impressive for a mid-range phone, and it would be easy to recommend if it wasn’t for a few minor issues. The device gets hot easily, is quite big, picks up fingerprints readily on the rear, has a few too many software bugs. It’s still a worthy addition to the Mi 11 lineup, though the standard 11T is more.\n\nPros\n\n+Smooth and responsive to use+Cameras perform well+Incredibly fast to charge\n\nCons\n\n-Rear is a fingerprint magnet-Fingerprint scanner is hard to reach-Overheating issues\n",
        "review": "While the main numbered range of Xiaomi phones is where the company debuts its flashy new tech and features, the T line is often where the real action is. \nLaunching roughly six months after the Xiaomi Mi 11, the 11T Pro offers lots of the features of that premium phone in a device that’s more modestly priced, though with a few corners cut here and there to keep that price low. \nThat’s the whole point of the Mi T family, but while the Mi 10T Pro was an intriguing counterpoint to the Mi 10 and Mi 10 Pro, the 11T Pro is an impressive device that will easily tempt buyers away from the ‘standard’ Mi 11.\nThe Xiaomi 11T Pro – note the lack of the ‘Mi’, as Xiaomi has stopped using the duplicate Mi branding that we used to see in handsets from the company – is a flagship phone in the areas where it counts.\nIt has almost exactly the same camera array, the same chipset, a bigger battery and faster charging than the Mi 11. Sure, its screen is a tiny bit smaller, but due to the display having flat edges (not curved, as in the Mi 11) the viewable area is basically the same size.\nThat fast charging we mentioned is definitely the biggest new feature, as it’s a startling 120W using the in-box charger. That’s over twice as fast as the 55W charging of the Mi 11, and zooms past the Samsung Galaxy S21’s 25W or the iPhone 12’s 15W. It takes just over 15 minutes – that’s not a typo: fifteen – to power the phone to full at that speed.\nMany other features here were expected in the Mi 11, but are impressive here due to the lower price. The Snapdragon 888 chipset, for example, is most commonly found in premium phones, though some cheaper handsets have it too, and it provides oodles of processing power for gaming or other tasks.\nWell, in theory it does… but the 888’s oft-reported overheating issue rears its head here. The chipset has been known to overheat when pushed, which can in turn reduce its performance until it cools down, so if you use the phone heavily you might run into this issue.\nThat’s not the only minor annoyance the Xiaomi 11T Pro presents – another is that the material used for its rear easily picks up fingerprints. Within a few minutes of starting to use the device, our review unit looked as much like an impressionist painting as a smartphone.\nOh, and people with smaller hands might struggle to reach the side buttons on the phone, as it’s a pretty chunky device.\nOverall, though, we were impressed with the Xiaomi 11T Pro during our testing. It's easily one of the best Xiaomi phones, but it’s just a shame it won’t be the stand-out member of the Mi 11T line, as the non-Pro version is cheaper with relatively few downgrades.\n"
    },
    "Samsung Galaxy S20 Plus review: The Samsung Galaxy S20 Plus is the best of its siblings": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Samsung Galaxy S20 Plus was a nearly-perfect smartphone when it launched, connecting to more 5G networks and offering better cameras than ever, though you had to pay for the privilege, as this was the priciest Plus smartphone yet. If you don’t mind ho-hum design, the phone still handles anything you throw at it, and should last you years - especially assuming 5G networks stay compatible with the S20 Plus as they build out.\n\n\nPros\n\n+Powerful yet sleek+Much-improved zoom+More 5G connectivity\n\nCons\n\n-Ever-higher price-Improvements are mostly iterative-No more 3.5mm headphone jack\n",
        "review": "At launch, the Samsung Galaxy S20 Plus was the most impressive 'middle child' handset we'd ever tested -- and most likely the best pound-for-pound S20 phone, period. It’s a powerhouse that packs the best perks of its siblings, and strikes the perfect balance between them.\nThat is, it’s got a bigger display and more battery life than the Samsung Galaxy S20, but it’s not quite as large and pricey as the Samsung Galaxy S20 Ultra. If you want affordability, or the best of the best, go with one of the other two; however, we predict that for most folks the S20 Plus will hit the sweet spot.\nYou might not want to go with any of them though, as the Samsung Galaxy S22, Samsung Galaxy S22 Plus, and Samsung Galaxy S22 Ultra have all now been released. They're upgrades in some ways and - curiously - downgrades in others, at least in the case of the standard and Plus model, so it might not be as clear cut as the Samsung Galaxy S21 Plus being the best 'Plus' option.\nWe've given all three Samsung Galaxy S21 phones the full review treatment too including the S20 Plus's replacement, the Samsung Galaxy S21 Plus. \nRumors are already gathering about the Samsung Galaxy S22 as well meaning this phone could feel even older soon, although there’s no confirmation of a release date just yet.\nThe Samsung Galaxy S20 Plus is in many ways higher end than the standard Samsung Galaxy S21, but you might want to look at the Galaxy S21 Plus instead, and for the true top Samsung flagship the Samsung Galaxy S21 Ultra is the only choice.\nIn any case, leaving the ultra-premium S20 Ultra aside, the Galaxy S20 Plus was also 2020's first big 5G phone – and one that operates on both the mmWave and sub-6 frequencies. Crucially, the standard S20 only works on sub-6, which means some US carriers don’t even sell that phone. In turn, that means the S20 Plus is their most affordable S20 model.\nAdd to the mix some truly stellar cameras featuring amped-up zoom and top-tier specs, and the S20 Plus earns its place as the best of the S20 trio. The phone isn't perfect – there are plenty of nitpicks that we’ll get into below – but it's a great all-around choice with the best of 2020's top features, though you'll have to pay to get them.\nYes, the S20 Plus has gotten a price bump over the Samsung Galaxy S10 Plus, presumably due to the added 5G compatibility. It pushes the phone to new heights of flagship prices, which is frustrating – especially given the limited availability of the cheaper 4G model, and notably the Samsung Galaxy S21 Plus actually has a lower launch price. \nBut if the S20 Plus pushes up the price ceiling, at least it does so as one of the best phones on the market.\n"
    },
    "OnePlus Nord 2 review: The latest cheaper handset from OnePlus": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The OnePlus Nord 2 is an exciting addition to the mid-range phone market, with some high-end specs and a great experience so far. Whether this will be the best phone at this price point remains to be seen, but so far it seems like a top choice.\n\nPros\n\n+Strong performance+Fantastic fast charging+A good camera experience\n\nCons\n\n-Only 90Hz screen-Lacklustre design-No IP rating\n",
        "review": "Historically, OnePlus has been about making high-end phones for a lower price than the competition. The same can’t be said for the latest OnePlus 9 series, but the OnePlus Nord 2 is taking on that mantle.\nThe mid-range phone market is an extremely competitive space, with great options from the Google Pixel 4a to the Samsung Galaxy A52 5G, but the OnePlus Nord 2 features specs that allow it to hold its own in that space. \nIn fact, the OnePlus Nord 2 is one of the very best phones in this segment of the market. It features some impressive specs including a 50MP main rear camera, 65W fast-charging and a 6.43-inch 1080 x 2400 display with a 90Hz refresh rate.\nThat screen offers a good experience, although some will be disappointed that the company hasn’t stretched to a 120Hz refresh rate here. That said, it offers good picture quality at a suitable size for many people.\nOne odd quirk is that the company has moved to a MediaTek chipset for the very first time, but it was seemingly the right decision, as we’ve found it offered improved performance when compared to the original OnePlus Nord.\nThe other highlight of the OnePlus Nord 2 is strong battery life, as we found it would always last a full day of usage even when we were pushing the phone to its limits. If you find it doesn’t, there’s also 65W fast charging that sees your phone go from 0% to full in just 30 minutes.\nThe OnePlus Nord 2 doesn’t have any game-changing features, but as a total package it offers a top experience that many will enjoy considering its lower price than a lot of other phones right now.\nSo if you’re looking for a cheaper alternative to a flagship, you should consider the OnePlus Nord 2 alongside the tough competition (such as those phones mentioned above) and note that it has a great camera experience, strong battery life and more going for it.\nWhen we say 'cheaper', it's actually got even more affordable since it launched. This is mostly thanks to the Nord 2T coming along as a slight improvement in a few departments.\n"
    },
    "Samsung Galaxy S21 review: Not the best of the best, but Samsung's S21 is fantastically put together": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Galaxy S21 isn’t the star of Samsung’s S series in 2021, like we’ve been used to for most of the past decade, but it’s a solid smartphone choice with an impressive camera, powerful internals and great battery life. If you want the best of the best, look to the Galaxy S21 Ultra; but if you want a handset that’s cheaper than the Galaxy S20 was at launch, with a whole load of premium features, the Galaxy S21 is a delight to use, and will do you proud. \n\nPros\n\n+Fantastic, versatile camera+Cheaper than the Galaxy S20+Powerful and capable phone\n\nCons\n\n-No microSD support-Screen isn’t the best-No charger in the box\n",
        "review": "It's an odd handset on paper, but having spent a week working on this Samsung Galaxy S21 review, we’ve found it to be a highly capable phone that's a pleasure to use, despite a couple of specs being dropped from previous handsets, notably the Galaxy S20 from 2020.\nWhy does the Samsung Galaxy S21 have lesser specs than the Galaxy S20? Two reasons. The first is that Samsung wanted to drop the price of its handset – the S21 launched with a starting price of $799 / £769 / AU$1,249 compared to the Galaxy S20 5G’s $999 / £899 / AU$1,499.\nThe second is that the company is also putting a bigger focus on its Samsung Galaxy S21 Ultra – and unlike the Galaxy S20 Ultra in 2020, it’s a handset we’d readily recommend to those who are desperate to try the company’s latest innovations, and happy to pay for them. \nThat makes the S21 a significantly less exciting Galaxy S phone than we’re used to seeing, but make no mistake: the Galaxy S21 is still a fantastic handset choice, albeit with a few tweaked specs compared to the Galaxy S20 – and that price drop is likely to attract a lot more people to the S series.\nIf you want a larger screen but similar specs, there's also the Samsung Galaxy S21 Plus. That is a remarkably similar phone to this, and the big differences are the phone's size, its battery capacity and that it has a slightly more premium glass back.\nOr if you want a newer model there's now the Samsung Galaxy S22 line - but those phones will cost you more.\nBack to the S21, and the chipset is powerful, the camera software has improved over previous models, and the battery life is strong, giving you a solid day of use from a full charge, alongside effective fast-charging and wireless charging options.\nSamsung has opted for a lower-spec screen than the one on the S20, with a Full HD+ 6.2-inch display, but it offers a 120Hz refresh rate for super-smooth scrolling and graphics, plus fantastic colors, and strong brightness levels – and we didn’t notice the lower resolution in most of our testing.\nThe chipset – we’ve tested the Exynos 2100 version of the phone – is also powerful, delivering some fantastic results in real-world use as well as in benchmarking software.\nIf you already own a Samsung Galaxy S20, or if you can find that handset for a significant discount, you won’t want to opt for the Galaxy S21 – while the newer phone gains in some areas it loses in others, and overall there’s not much between the two phones – certainly not enough to justify paying a couple of hundred dollars or pounds more.\nConversely, if you’re after the top-end tech that Samsung is selling in the S21 line then you’ll want to check out the Samsung Galaxy S21 Ultra - or go for something newer with the S22, Galaxy S22 Plus, or Samsung Galaxy S22 Ultra.\nBut if you’re after a cheaper alternative to those phones, and which works fantastically well for everyday tasks, the Galaxy S21 is just that. \n"
    },
    "Google Pixel 6 review: The Google Pixel 6 redefines phone photo perfection": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Google Pixel 6 isn’t the most powerful phone on the market, but its new Tensor chipset elevates its photo-taking capabilities beyond that of rival handsets. While it lacks a telephoto lens, and its battery life isn’t anything to brag about, it’s a big phone with a 6.4-inch display, a radical new design, and a price that can undercut rival Android phones – although carrier-specific versions might be pricier.\n\nPros\n\n+Fantastic photos+Good price+Intriguing design\n\nCons\n\n-No zoom lens-Middling battery-Limited storage\n",
        "review": "The Google Pixel 6 was unveiled on October 19, 2021 alongside the Google Pixel 6 Pro, and each of these smartphones were released on October 25.\nPrices for the Google Pixel 6 typically start at $599 / £599 / AU$999 for 128GB of storage, while 256GB starts at $699 / AU$1,129, with that version not being available in that UK.\nThat starting price is lower than the launch price of the Google Pixel 5, which was available in only a single configuration (and a sub-flagship chipset) for $699 / £599 / AU$999. The Pixel 6 is priced notably below rival handsets at the lower end of the flagship spectrum: prices for the standard iPhone 13 start at $799 / £779 / AU$1,349, while the Samsung Galaxy S21 is priced almost identically at $799 / £769 / AU$1,249.\nSince launch we've often seen the Pixel 6 reduced as well. At the time of writing for example you can get it direct from Google for £449 in the UK. \nHowever, the price may also be higher in your region due to different versions sold by carriers. In the US, Google sells its own version of the Pixel 6 that only has sub-6 5G, while Verizon and AT&T sell a variant that supports sub-6 and mmWave for a higher price – $699 and $739, respectively. \nContrast that with the Google Pixel 6 Pro, whose prices start at $899 / £849 / AU$1,299 for 128GB of storage, climbing upwards thereafter. However, that price still sits below that of rival flagship phones. The Samsung Galaxy S22 Plus comes in at $999 / £949 / AU$1,549, while prices for the iPhone 13 Pro Max start at $1,099 / £1,049 / AU$1,849. In comparison, both new Google phones appear to be bargains, although bear in mind that they aren’t as technically powerful.\nPrices for both phones may drop soon too, as it's Amazon Prime Day on July 12 and 13 2022, and many smartphones often get discounted during this sale. So if you're reading this ahead of then, it's worth waiting a little longer before buying.\nThe Pixel 6 is available in three colors, with the 256GB storage model available in Stormy Black (grey/black) and Sorta Seafoam (blue/green), with Kinda Coral (pink/red) only available in the 128GB of storage option. To avoid any confusion, some US carriers have opted to sell only the former two colors – or just Stormy Black.\nIf you want a 512GB variant, you won't find one for the Pixel 6. The Pixel 6 Pro is available with that much storage in the US and Australia, but that's even limited to certain colors.\n"
    },
    "Asus ROG Phone 6 review: Supreme gaming, but it'll cost you": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Gaming phones are always powerful, but they're seldom polished. The ROG Phone 6 is both, matching best-in-class performance with effective cooling and a rich selection of accessories. While we wish Asus went a bit further with the camera and wireless charging, there are enough standout and unique highlights here to make it the best gaming phone available at launch.\n\nPros\n\n+Excellent battery life+Great selection of accessories+Powerful and stays cool+Bold, bright, smooth screen\n\nCons\n\n-No wireless charging-Weak camera mix for the price-Pricier than competition\n",
        "review": "Do you even need a gaming phone when handsets like the iPhone 13 Pro Max or Samsung Galaxy S22 Ultra are such capable pocket powerhouses? Asus thinks so, and the ROG Phone 6 is its latest attempt at giving you a smartphone by daylight, and handheld console by neon lights of your RGB-lit den. \nIf you're not a gamer, then the ROG Phone 6 isn't for you. It's that simple. Starting with its design, this phone looks like it could transform into a tiny robot and take over the world; you'll probably either love it or hate it. We love it.\nBoth the ROG Phone 6 and 6 Pro get a color screen around the back, a feature that was previously reserved for the Pro version. Also new, the ROG Phone 6 is available in both black and white – the latter looking particularly sleek when matched with the new selection of off-white accessories. \nGiven that the phone also sounds good and lasts a full day without a midday charge – thanks to its huge 6000mAh battery – it's safe to say our general impression of the ROG Phone 6 has been an excellent one. That said, it isn't perfect.\nWhile gaming phone cameras are usually mediocre to bad, the ROG Phone 6's is just good enough. This phone is pricey, so it's natural for us to expect a little more – possibly OIS on the main lens, a bit of telephoto reach or a wide/macro camera with autofocus.\nThe phone also misses out on wireless charging, which is becoming more ubiquitous, and is something of a must in the ROG Phone 6's price bracket.\nDespite those quibbles, the ROG Phone 6 is still the very best gaming phone you can buy. While it costs more than the Poco F4 GT, it's more powerful and features a richer accessory suite. The Red Magic 7 and 7 Pro are also cheaper alternatives but lack the polish Asus brings to the table.\n"
    },
    "Back 4 Blood review: Back 4 Blood is well worth the wait – but it's not Left 4 Dead 3": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Back 4 Blood captures much of what we all loved about Left 4 Dead while updating it with more modern gaming trends that helps keep the content fresh. But it might not be what some are looking for if you're hoping for a direct sequel to Left 4 Dead 2. \n\nPros\n\n+Online co-op is fantastic+Card system lets you really own a character+Campy dialogue and story get it just right+Difficulty offers excellent replay value\n\nCons\n\n-No mod support (yet?)-Not the greatest for solo players-Melee combat falls away toward the end of campaign-PvP is fairly underwhelming\n",
        "review": "Back 4 Blood is a spiritual successor to the acclaimed Left 4 Dead Xbox and PC franchise of the aughts, but it definitely deserves to stand on its own, in its own right, as one of the best games of the year – and in many ways, you're better off not thinking about the game's pedigree at all if you really want to enjoy all that it has to offer.\nIn terms of the best co-op games, we really can't think of another game right now that is as much fun to play with your friends, and the game's surprising degree of replayability is a testament to the thought and care that went into the game design and mechanics. It stays fresh to play, even if it's your umpteenth time through the campaign.\nIf you want to jump straight in – shotty in hand – without a thought for the story context or progression system, Back 4 Blood definitely gives you a steady flow of 'Ridden' to blast away at with a lot of level challenges. There's also mutation varieties, and general game mechanical chaos along the way to keep you satisfied, especially if you're playing through Back 4 Blood's online matchmaking or with your friends.\nEven if you're not necessarily a fan of first-person shooters, there really is nothing better in terms of simple pop-in/pop-out co-op action. There are many ways to play the game that don't hinge on your ability to no-scope a Ridden Ogre's weak points from across a map, and honestly you can play through the entire campaign without having to fire a gun even once – there's even an achievement for the most pacifist playthrough that is narratively possible. \nAnd while the core experience of Back 4 Blood is incredibly polished – in 30+ hours of playing, we encountered only one AI pathing bug – there are parts of the game that feel downright neglected. The solo campaign is a lot of fun and the AI teammates are more than competent, but even with downscaled difficulty, your squad pretty much becomes irrelevant towards the final acts.\nProbably more critically, the most common complaint we've heard from fellow players is that the PvP game mode is pretty basic, with little of the complexity that the Online Co-op Campaign and to a lesser extent the Solo Campaign modes demonstrate. For Left 4 Dead 2 players, this might be a deal breaker, and we wouldn't necessarily blame them.\nLikewise, Left 4 Dead 2 has remained popular for years after that game's release thanks to its active modding community. As of now, Back 4 Blood doesn't support modding, and it may never support it. For many potential players, this too might be reason enough to pass on Back 4 Blood.\nEven with these issues though, missing out on Back 4 Blood would be a huge mistake in our opinion. It isn't the Left 4 Dead 3 some were hoping for, but taken on its own, it's the best co-op experience you're going to find outside of an MMORPG and we can say that it is absolutely worth the decade-long wait.\n"
    },
    "Xiaomi Redmi Note 10 5G review: The Xiaomi Redmi Note 10 5G is classy but compromised": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Xiaomi Redmi Note 10 5G is a classy-looking budget phone that provides 5G connectivity and excellent battery life at an incredibly low price. You’ll have to make some sacrifices when it comes to display and camera quality in order to reap those 5G benefits, however, and it’s not the fastest performer for the money.\n\nPros\n\n+Classy design+Excellent battery life+5G connectivity at a low price\n\nCons\n\n-No ultra-wide lens-Washed out 90Hz LCD-Underwhelming performance\n",
        "review": "The Xiaomi Redmi Note 10 5G attempts to pull of the same trick as the Redmi Note 10 Pro - a phone which nailed the three core smartphone pillars of display, camera, and battery life for less than $300/£300. But the Redmi Note 10 5G attempts to do this at the sub-$250/£200 mark, all whilst adding 5G to the package.\nThat sound you can hear is the groan of scant resources being stretched thinly, as our Xiaomi Redmi Note 10 5G review will explain. While the Redmi Note 10 5G is an attractively built budget phone, it falls behind the likes of the Xiaomi Poco X3 NFC with the quality of its display, the level of its performance, and the flexibility of its camera system.\nIt’s a surprisingly stylish device though, with a pleasing matte finish and an industrial-looking camera module that makes it seem far more expensive than it is. Its display is a slightly washed out FHD+ LCD, but the main drawback here compared to some of its non–5G rivals is the provision of a mere 90Hz refresh rate rather than the full 120Hz.\nPerformance is merely okay, with a MediaTek Dimensity 700 5G chipset providing adequate day-to-day running alongside an underwhelming gaming experience.\nThe news is similarly mixed when it comes to the camera. While the Redmi Note 10 5G’s 48MP main sensor is capable of capturing adequate shots for the price, the complete lack of an ultra-wide assistant - let alone a telephoto lens - is a bit of a downer. The 2MP macro sensor that is there is scarcely worth the space.\nBy far the standout feature of the Xiaomi Redmi Note 10 5G is its stamina. With a 5,000mAh battery on board, alongside those otherwise modest specifications, it has the potential to last a full two days on a single charge.\nOverall, while it’s a competent package, potential buyers need to be sure of their priorities before committing. Like the Realme 8 5G, Xiaomi has essentially compromised in several key areas for the purpose of squeezing 5G in below the magic $200/£200 mark. So you need to be certain that next-gen network connectivity is a truly essential factor for you.\nYou won’t go far wrong if you choose the Xiaomi Redmi Note 10 5G as your next budget phone. It's arguably one of the best cheap phones and one of the best Xiaomi phones, just know that you can get a more rounded alternative if you’re happy to forgo 5G data speeds for another smartphone cycle.\n"
    },
    "Samsung Galaxy A52 5G review: A lot to like, but hard to love": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Samsung Galaxy A52 5G isn’t going to blow you away with top-end specs or a remarkably affordable price, but it’s still a solid choice for a mid-range handset that can compete with the likes of the Google Pixel 4a. It’s a difficult phone to love, but if you’re looking for a lot for a lower price point than most other Samsung devices, you may enjoy what the Galaxy A52 5G has to offer.\n\nPros\n\n+Solidly built+A good display+Decent battery life\n\nCons\n\n-Mediocre power-Extra cameras are only okay-Lacks exciting features\n",
        "review": "The Samsung Galaxy A52 5G is the company’s 2021 entry into the cheaper phone market, and the company has made steps to make this handset its best yet for an affordable price. The A52 5G isn’t the lowest price smartphone you’ve ever seen, but it’s certainly much cheaper than the company’s flagship offerings like the Galaxy S21 and Galaxy S21 Ultra.\nIf you're reading this Samsung Galaxy A52 5G review we should let you know that there's also a Galaxy A53 on the market, which is the 2022 version of the A52. It's got a few improved features but it's not a total overhaul.\nThe Galaxy A52 5G won’t be able to compete with the absolute best phones, but it also isn’t trying to do that. What Samsung is trying to do is make a conscious effort to bring features such as a high-refresh-rate screen and improved rear camera to its cheaper A series.\nSamsung’s playful design with bright color options makes a return on the Galaxy A52 5G, and we’ve found this to be a solidly built smartphone that will feel durable in the hand and offer some impressive specs inside.\nThe display is improved from previous Galaxy A50 models with the upgrade to a 120Hz refresh rate - that means you’ll find it has a smooth experience when scrolling through menus or playing mobile games. It’s a 6.5-inch screen with good brightness levels and enough detail for most people as well.\nThe camera has had some improvements too, but the highlight is the 64MP main shooter that can perform well in its automatic mode. There is little to get excited about here though, with a limited feature set on the rear shooter.\nWhen it comes to performance, we found the Galaxy A52 5G didn’t perform as well as some of its competitors, but it never caused us any headaches during our testing period. If you want top power, this won’t offer it, but it’s built to be able to run any apps or games you want to from the Google Play Store.\nThe Galaxy A52 5G also comes with 5G connectivity, so if you want to be able to make the most of next-gen internet you won’t have to opt for a flagship phone to be able to do so.\nSamsung hasn't changed the mid-range smartphone market with this latest iteration of the Galaxy A series staple, but it has offered a good choice for many people’s next smartphone. That’s especially true if you enjoy Samsung’s look and feel when it comes to Android phones, but you don’t want to spend lots on it.\n"
    },
    "Call of Duty: Warzone review: Call of Duty: Warzone is a smashing battle royale game": {
        "rating": "Rating: 5 out of 5 stars",
        "summary_pros_cons": "Call of Duty: Warzone is a new contender to the Battle Royale crown, but it’s still likely to give Fortnite more of a run for its money than Blackout ever could.\n\nPros\n\n+Huge, interesting map+Tight, responsive gunplay+Tense Gulag encounters+Contracts offer a new way to play\n\nCons\n\n-Technical hitches at launch-Uninventive weaponry-Killstreaks can be overpowered\n",
        "review": "Players can enter matches solo, as part of a duo, or with two squadmates, with the ability to auto-fill gaps in your lineup if you choose to do so. However you drop in, there’s a good chance you’ll sit mouth agape at the gorgeously rendered intro cutscene – pulling back the curtain on Warzone’s ridiculously large map, which dwarfs the offerings of its competitors in terms of scale and variety (although vehicles do help mitigate the gaps between areas somewhat).\nEvery single building has been custom-designed, eschewing the deja-vu of PUBG’s identikit house templates, or Fortnite’s entirely destructible structures. While it’s easy to get lost, there’s a magic to fleeing an enemy squad to find yourself wandering around a facsimile of Infinity Ward’s previous multiplayer maps, such as Vacant or Overgrown.\nOf course, stumbling down memory lane in the middle of a firefight is one thing, but this is far from a rehash. For one, players earn cash from looting and killing which can be used at Buy Stations to call in a killstreak, revive a fallen squadmate, or call in a custom loadout.\nGiven Blackout’s overwhelming number of weapon attachments, there’s a refreshing simplicity to Warzone’s reliance on stick weapon varients, with more advanced ‘named’ weapons – that come with preset scopes and doodads – available through supply crates littered around the map, the aforementioned loadout request, or a new feature called Contracts.\nThese Contracts come in three flavors, adding secondary objectives beyond simply survival – so you’ll either be holding territory (Domination style) for a period of time, hunting down a specific enemy, or looting a series of predetermined loot caches. With tangible rewards including high-level weapons and bonus cash, it promotes a less static style of play that constantly feels rewarding.\n"
    },
    "Xiaomi Black Shark 5 Pro review: Great for competitive gamers, but with a few rough edges": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "For gaming, the Xiaomi Black Shark 5 Pro is a champ. It has a top-end processor, useful gaming mode and retractable triggers that will deliver a huge edge in competitive games. However, its rough edges emerge when you try to use it as an everyday mobile. Battery life is disappointing, it overheats frequently, and the cameras are nothing to write home about either.\n\nPros\n\n+Useful retractable triggers+Charges quickly+Powerful processor\n\nCons\n\n-Lackluster battery life-Gets very hot-No headphone jack\n",
        "review": "If you’re reading this Xiaomi Black Shark 5 Pro review, we’re under the assumption that it’s because you’re in the market for a gaming phone. If you’re not looking for such a device, which comes with additional software and hardware tricks to make gaming a blast, then we advise you to look elsewhere.\nThis is because the Black Shark, like many other of the best gaming handsets, is great for playing mobile titles but suffers issues when used as an everyday smartphone. While this is a compromise that we’ve become used to, it’s best to avoid such devices if gaming isn’t a regular part of your life.\nThis is the most powerful member of the fifth generation of Black Shark phones. They’re manufactured by Xiaomi, although both the Chinese tech giant and its gaming sub-brand downplay the relationship between the two.\nThere’s a standard Black Shark 5, too, offering a lower-res main camera, slightly weaker chipset and lower storage and RAM configurations; but it costs less as a result. \nAs is the case with most gaming phones, the Xiaomi Black Shark 5 Pro’s performance power is its main selling point, since this ensures it can run top-end titles at their highest graphics settings without breaking a sweat. At the heart of the device sits a Snapdragon 8 Gen 1, supported by up to 12GB of RAM – a combination that, in our experience, delivered outstanding gaming performance.\nThis is helped by the presence of pop-up physical triggers along the right edge of the phone, which can be assigned a function for your game, to turn your smartphone into a device that more resembles a gaming controller. This setup delivers quite an advantage in games.\nThe pop-up triggers return from the Black Shark 4 Pro, but what didn’t ascend generations is the 3.5mm jack for wired audio. That’s a shame, since wired headphones and microphones can offer better latency and audio quality for gaming over wireless units. However, buy a USB-C adapter and you’ll still be able to plug in a set via the sole remaining port.\nOur mention earlier that the phone doesn’t break a sweat was with reference to the fact we experience no lag or stuttering. However, the Black Shark 5 Pro does suffer a few issues during intensive gaming. The main one is that, like other Snapdragon 8 phones, the device becomes incredibly hot – clearly, the built-in cooling system that Black Shark has gone with here isn’t sufficient to cope with the demands of intensive play. In addition, there’s significant battery drain from this top-end chipset; although the Black Shark Pro 5 didn’t last as long as we’d hoped for even with regular use.\nSo, the battery life on the Black Shark 5 Pro isn’t up to snuff; but there is a feature – another carry-over from the previous version – that makes up for it in part. This is 120W fast charging, which delivers the capability to power up the phone to full in just 15 minutes – which is incredibly impressive.\nAs we’ve alluded to in this two-minute review, the Black Shark 5 Pro is quite similar to its predecessor in a number of ways, but it does come with a few minor changes that we’d be remiss to ignore. \nThe new model sports a more understated, less “game-centric” design, as well as a better main camera, an improved macro camera and cleaner software – although there are some notable and curious downgrades, too, such as the 5 Pro’s use of an OLED display over the 4 Pro’s Super AMOLED and better range of storage and RAM options.\nSo if you already own Xiaomi’s previous Black Shark gaming device, the 5 Pro doesn’t offer much of an upgrade – and if you can find the previous model for a decent price, it’s definitely worth considering. But for everyone else in the market for a gaming device, you’d do well to check out the Black Shark 5 Pro.\n"
    },
    "Nubia Red Magic 7 review: Gaming wins meet UI lols and battery woes": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "A powerful gaming phone with a great screen and mighty speakers. In day-to-day use, some rough edges within the interface and middling battery life hold it back from besting the greatest gaming phones on the block – but it's still a good value smartphone for anyone who wants gaming grunt above all else.\n\nPros\n\n+Bold, smooth screen+Ample power for gaming+Range of accessories available\n\nCons\n\n-Translation quirks within the UI-Weak battery life-Bulky design\n",
        "review": "Red is a Chinese brand that's been making gaming phones for ages. It's part of Nubia, which was once part of ZTE – and may still be; the internet is undecided on that fact. \nWhy the history lesson? Because the Red Magic 7 feels like it's going through something of an identity crisis. Funny menu translations, some rough edges within the UI, and an underwhelming battery collide with what is otherwise an affordable gaming phone with tons of power and some neat gamer-tailored flourishes.\nNow, if you're in the market for a gaming phone, you should expect an angry-looking design – and the Red Magic's styling transcends angry. The glass back is blazoned with glyphs that showcase its specs. On its most premium RAM and storage version, there's a transparent section, under which sits an RGB-lit fan. It's a lot. \nThe Red Magic 7 is also big and bold with a cold, stark metal frame, prominent vents and flat sides. It's heavy, thick, and a handful, whether you're holding it like a phone or a controller.\nWith booming loudspeakers and that bold 6.8-inch 165Hz screen, the Red Magic 7 displays movies and games with impact – and thanks to stacks of power under the hood because of the Qualcomm Snapdragon 8 Gen 1, performance is on-point too.\nThe interface is the main area where the Red Magic 7 drops the ball. It runs Android, so app support is great, and Red's also added a bunch of widgets to the mix to help you quickly control its fan and access gaming features. That said, various English translations throughout the UI miss the mark, and there are also a few visual issues.\nThe battery will last about a day with medium to light operation, but only around 8 hours with heavier use, so gamers who don't have time for an afternoon charge should look at alternatives with bigger batteries like the ROG Phone 5.\nAt its price point, there are few phones with the same level of power and gaming-focused appeal that can compete with the Red Magic 7. \nThat being said, the Poco F4 GT is an excellent alternative, with pressable shoulder buttons that are better than the Red Magic 7's touch buttons in our opinion. Its smaller screen also makes it a bit more manageable – and it has a better battery – though we'd have to say the watching of anything on it isn't as immersive. Also, the styling isn't as gamer-oriented as that of the Red Magic 7.\nAlternatively, if you don't mind having 2021-grade internals, the Asus ROG Phone 5 and 5s Pro pack massive batteries and support for excellent accessories with Snapdragon 888-series power.\n"
    },
    "OnePlus Nord N20 5G review: $300 for everything but a decent camera": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "For less than $300, the OnePlus Nord N20 is an easily recommendable budget 5G phone. Slick performance and a bright, punchy OLED display compensate for the sub-par camera system. There are three rear cameras but two are almost redundant, so OnePlus would have been better off focusing on just one. Put that aside, though, and the Nord N20 gives a lot for very little money.\n\nPros\n\n+Stellar processing performance+OLED display worthy of a $600+ phone+Thin, light, and attractive design\n\nCons\n\n-Cameras are only average-The vibration motor is weak-Only one major software update\n",
        "review": "The OnePlus Nord N20 5G is the successor to the N10 5G, sitting just above the Nord N200 in the company's lineup as another mid-ranger from the company. It’s an attractive-looking phone, and it feels great in the hand.\nThe Nord line is OnePlus's attempt to offer phones that cost less than its flagship models, and the Nord N20 5G is a great option if the OnePlus 10 Pro costs too much for you.\nIt has a similar size to the Samsung Galaxy S21 Plus, meaning it's on the taller side. This means that reaching the extremities of the screen will be tricky if you’re employing a one-handed grip.\nFor your money you’re getting an exceptionally bright OLED display, solid performance in both the system and in games, 128GB of storage, and OnePlus’ take on the Android experience. Storage is also expandable on the Nord N20 via micro SD card – a luxury that few phones have afforded us in recent years.\nWith its decently sized 4500mAh battery, the Nord N20 easily achieves two-day battery life with about 50% charge left at the end of the first day if we started at 100%. And when the battery does get too low for comfort, the fast-charging tech on offer here will save the day. The included charger will juice the phone up by about 20% in 15 minutes. \nThanks to its combo of a Snapdragon 695 processor and 6GB of RAM, navigating the phone’s Oxygen OS interface is a smooth experience, and we were able to multitask between several open apps with very little slowdown. Even taking full-resolution 64MP or 108MP Extra HD photos didn’t cause the system to chug as it processed those big files. \nOne thing to note about the N20 is that it’s a T-Mobile exclusive in the US for now, with unlocked models coming out at a later point. T-Mobile's push service prompts you to install bloat apps multiple times during and after setup, but you can opt out of the majority of them. However, the phone will bug you multiple times during and after setup to install more “premium app suggestions” from the carrier. Most are benign like TikTok and Amazon Shopping, but others are ad-riddled news apps and ‘gacha’ games, which are initially free but quickly start to offer in-app purchases. Make sure you’re not just blindly clicking through the setup process and you’ll be fine. \nThe phone is also let down a bit by its underwhelming camera system, which impresses on the design front but which offers only average performance. Photos look very different in the viewfinder than they do after being processed by the phone, making it hard to know if a snap will get much better or much worse once you press the shutter, and we could have done without the gimmicky macro camera. OnePlus could have improved the photography experience dramatically by focusing its efforts on one 64MP camera, but as it is, the setup we’re stuck with leaves a lot to be desired. \nAnother pain point on this phone is its haptics. Over the last few years we’ve seen an increased focus on haptics in phones, such as Apple’s Taptic Engine for its iPhones, as well as in-game consoles like the Nintendo Switch and Playstation 5. Haptics on OnePlus phones, however, have always been a hit or miss affair, and on the Nord N20 they’re very much a miss, with some of the weakest and mushiest feedback we’ve ever felt. We occasionally mistyped due to the keyboard’s odd haptics, and it was hard to hear the vibration of the phone even when it was laid down on a table.\nThe Nord N20 also won’t get any major software beyond Android 12, which rules this phone out if you care about the upgrades coming up in Android 13.\n\nOverall though, the package on offer here represents good value for the money. If you’re looking for a cheap Android phone that will power through tasks with battery to spare, look no further than the Nord N20. \n"
    },
    "Google Pixel 5 review: The Google Pixel 5 is an affordable flagship with some compromises": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Google Pixel 5 loses some of the more advanced features of its predecessor in order to keep the cost down, and the result is a streamlined phone with great camera software and a clean Android interface. But without some of those premium perks, like a telephoto lens, that appear in other handsets at the same price tier, the Pixel 5 struggles to distinguish itself from the competition. It's a good handset at a consumer-pleasing price – but that's true of other 2020 phones, too.\n\nPros\n\n+Camera software is better than ever+Metal case is refreshing change from glass+Clean Android interface\n\nCons\n\n-No telephoto camera-Middling night photography-Not the most powerful of phones\n",
        "review": "The Google Pixel 5 represents a strategy change for the tech giant: the phone doesn't quite have the specs and features to compete with top-tier flagship devices, but instead is a more measured handset that costs less in turn.\nCompared to the Samsung Galaxy S21s of the world, the Pixel 5 focuses on what Pixel phones do best: offering users a great, simplified camera experience and a very clean Android interface, as we'll detail in this Google Pixel 5 review.\nIt's a tack that the Google Pixel 5a continues, and given the similarities between the phones, the only thing the Pixel 5 has over its cheaper sibling is a smaller size and more refined metal back - though that's still enough for it to rank among the best Google Pixel phones.\nIf you want a more flagship Pixel phone, you may want to wait for the Google Pixel 6 – Google officially revealed the design and confirmed it will pack the company's first in-house SoC, the Tensor chipset, and suggested it will be priced comparable to other top-tier phones. While we're excited for that phone, it still means that if you want a more humbly-designed phone at a lower price that still rocks the latest Android version, the Google Pixel 5 is a good, simplified phone choice.\n‘Simplified’ could apply to the whole phone, really: it’s got an all-in-one body that curves from the back around the sides, and which is metal, so you won’t have to worry about shattering it. Google has also gone back to a physical fingerprint sensor on the rear of the phone, which is far easier to find without looking than an in-screen scanner. And with the purest version of Android 11 on board, there’s no bloatware or operating system complications.\nSimplified can also mean lacking, though, and Google has cut some corners in designing the Pixel 5 to drive prices down to the level of more affordable flagships like the Samsung Galaxy S20 Fan Edition and OnePlus 9.\nIn most ways, that’s fine, but there are some compromises that keep it from feeling like an affordable slam-dunk. The Pixel 5’s chipset won’t quite keep up with the processors in the new S20 FE or OnePlus handset, and its two cameras are lacking serious zoom capability. \nBut it’s the uniqueness that we miss, too: fans of the Google Pixel 4’s Soli depth sensor, which enabled in-air gestures, will be sad to see it gone. In a rare move for a phone maker, Google abandoned tech instead of iterating on it; LG did the same thing when it abandoned its own depth sensor, which it introduced on the LG V50, when it brought out the LG V60.  \nPersonally, we don’t miss Soli, though we do miss what it could have become as a uniquely Google experience. But while some cutting-edge tech has been culled, it’s not a complete regression: the Pixel 5 has wireless charging, a 90Hz refresh rate display, and 5G, while its 4,000mAh battery is a lot bigger, and subsequently lasts far longer, than the 2,800mAh battery in the Pixel 4. \nUltimately, the Pixel 5 is a mixed bag, with some curious omissions in an otherwise solid phone. It’s designed to hit a sweet spot for a certain kind of consumer who’s willing to forego some flagship features to get a finely-tuned photo experience, and it does that – but it’s something that other phones, like the Google Pixel 4a 5G, which has virtually identical photo capability, offer at a notably lower price. \nBut the Google Pixel 5 does offer something that most other flagships don’t : it feels like one of the smallest phones on the market, despite having a not-so-small 6-inch OLED display, and it can comfortably be used with one hand. With the imminent arrival of the iPhone 12 mini, however, it's set to face some serious competition in the 'mini flagship' space.\n"
    },
    "Xiaomi Redmi Note 10 Pro review: The Xiaomi Redmi Note 10 Pro is a top phone at a low price": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Xiaomi Redmi Note 10 Pro is one of the best Android bargains going, assuming you can live without 5G. You get a great screen, fast performance, long battery life and a solid camera for under $300 (£249 / around AU$360).\n\nPros\n\n+Excellent stereo speakers+Big and bold 120Hz OLED screen+Long battery life\n\nCons\n\n-No 5G-Lacks stabilization for 4K video-No telephoto camera\n",
        "review": "As our Xiaomi Redmi Note 10 Pro review will explain, this is one of the biggest smartphone bargains around. It gets so close to the day-to-day experience of a $1000/£1000 phone you’d never guess it costs $279 / £249 (roughly AU$360).\nThere’s one missing feature that may put you off: 5G. This is a 4G phone. It will always be a 4G phone, so make sure you’re happy with lower-speed mobile internet for the duration of your ownership.\nVideo stabilization is the other issue. The Xiaomi Redmi Note 10 Pro can capture 4K video, but there is no stabilization above 1080p, rendering it next-to-useless in plenty of scenarios.\nThose are the Redmi Note 10 Pro’s bad bits. The rest is gold - so much so that this ranks among the best Xiaomi phones, and arguably also the best cheap phones from any brand.\nThe Redmi Note 10 Pro has a large 120Hz OLED screen. Its Snapdragon 732G brings the goods for gaming, and the phone has some of the best speakers we've heard at the price.\nYou get a solid 108MP camera. And while you shouldn’t put too much faith in that ultra-high megapixel count, it produces nice photos and has access to a good night mode.\nThere’s also a highly unusual, and unusually good, macro camera. Most budget phone macro cameras are barely worth using. This one is great for nature photography.\nThe Redmi Note 10 Pro's battery also lasts a long time, even if you use the 120Hz screen mode for smoother scrolling.\nThere are mountains of substance here, and even the build quality gets more attention than we’d expect. The Redmi Note 10 Pro has a Gorilla Glass back, not the plastic we now see even in alarmingly expensive Android phones.\nThe strongest competition at the price includes the Xiaomi Poco X3 NFC from the same company, which is heavier, thicker and has an LCD screen rather than an OLED. It’s a little less fancy, but is also a great buy. Or there’s the Realme X50 5G, which you should buy instead if you want 5G.\n"
    },
    "Doro 6880 phone review: The Doro 6880 is just one of three new phones aimed at the over 65’s": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Doro 6880 is a basic phone, but better for it if you need a simple way to make and receive calls along with texting. There’s an Assistance button too, plus solid battery life and a design that’s robust enough to survive the rigours of everyday use. It’s ideally suited to use around the home, but the clamshell design makes it a practical handset to slip into a pocket or bag, without any worry of pressing buttons or making calls by mistake. Crucially though, if you’ve got failing eyesight, hearing issues or problems with manual dexterity, the Doro 6880 is well worth a try as it addresses all of these things really nicely, thanks to a well-thought out design that will meet the needs of many seniors.\n\nPros\n\n+4G-enabled+Assistance button+Easy to use\n\nCons\n\n-Basic features-Low-resolution screen\n",
        "review": "The Doro 6880 is just one of three new mobile phones from the Swedish technology brand, which is joined by the budget Doro 5860 and a mid-priced Doro 6820. The company focuses its efforts on improving the life of seniors and the trio of new handsets are aimed firmly at the 65 and over age group. Doro’s 6880 model features a flip-up clamshell design, is 4G-enabled and boasts HD voice technology that delivers clear and extra loud sound. It also has compatibility with hearing aids, plus there’s an Assistance button located on the back of the phone, for anyone needing it. The 2.8-inch colour display is simple but effective, while a large keypad sits on the bottom of the fold out design. This features high-contrast keys that can be pressed with ease, while text size can also be adjusted. There’s a cradle charger for anyone wanting to keep it on a lounge table or beside the bed.\n"
    },
    "Realme 9 5G review: Elegance and 5G for cheap": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Realme 9 5G is a stylish, affordable budget 5G phone that exudes reassuring competence all round. The Poco M4 Pro 5G pips it in a couple of areas, but it’s a dependable pick nonetheless.\n\nPros\n\n+Tidy design+Competent main camera+Relatively clean software\n\nCons\n\n-No ultra-wide camera-Only 18W charging-LCD rather than OLED display\n",
        "review": "The Realme 9 5G slots in neatly below the Realme 9 Pro 5G, with a similar clean design and 5G connectivity at a more affordable price point.\nCompromises have been made in the process of squeezing in that 5G connectivity, as illustrated by the presence of a non–5G model available for the same money. You get an LCD display here rather than OLED, albeit a crisp, accurate, and fluid example. \nYou also get an 18W charger in place of the 4G model’s 33W equivalent, which means you’ll realistically need to charge it every night. Thankfully, a 5,000mAh cell should provide a full day of juice even for frequent phone fiddlers.\nAnother trade-off comes with a 50MP camera rather than the 4G model’s 108MP equivalent.You don’t get any form of ultra-wide camera in the 5G model either. Even so, the Realme 9 5G is capable of taking balanced, detailed snaps in good lighting. We like Realme’s natural way with colors, in particular.\nPerformance isn’t outstanding, but the Realme 9 5G’s Snapdragon 695 chip ensures a relatively pain-free navigation experience. Gamers might wish to look elsewhere, however, as that modest processor comes backed by a limited 4GB of RAM.\nRealme’s custom UI is one of the cleaner efforts on the budget market and is arguably more appealing than the MIUI software found on rival Poco and Redmi handsets.\nTalking of Poco, the Poco M4 Pro 5G appears to be the most direct rival to the Realme 9 5G. While the two phones share a price, 5G connectivity, and a very similar display, the Poco takes the edge in a couple of meaningful ways.\nThe Poco gives you an ultra-wide camera, stereo sound, and faster 33W charging. All in all, it feels like a slightly more generous package for your £249.\nIf you prefer Realme’s understated approach, the Realme 9 5G won’t let you down. But like every new phone at this price, it raises the question of whether 5G is really worth the inevitable compromises that come as part of the budget phone territory.\n"
    },
    "Motorola One Macro review: Can a focus on the little things lift this Moto above the rest?": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Moto One Macro has a great design, dependable battery, a good screen, nice software and a reasonable chipset. It is a very well thought-out device - but its main attraction, the macro camera, is a big let-down.\n\nPros\n\n+Good screen+Dependable battery life+Durable, fuss-free design\n\nCons\n\n-No NFC-Bad cameras-Rear is a fingerprint magnet\n",
        "review": "The Motorola One Macro is being sold at £179.99 / AU$299 (around $230), with no word on wider availability at the moment.\nIt is being sold in ‘Space Blue’ and ‘Ultra Violet’ colors and comes with one storage/RAM combination, of 64GB/4GB.\n"
    },
    "Oppo A5 2020 review: Add the Oppo A5 2020 to the list of best budget phones": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Oppo A5 2020 when judged against its price comes out very well indeed: for not much money at all, you get a device that is competent in most areas and really good in a couple.\n\nPros\n\n+Solid design+Superb battery life+Spacious screen\n\nCons\n\n-So-so performance-Unimpressive camera-Slow charging\n",
        "review": "Take a look at the Oppo A5 2020 and you can tell it's not a premium-level, flagship phone, and it's the same when you pick it up. At the same time it's fair to say that the handset looks more expensive than it actually is – sure, it's clad in plastic and looks unoriginal, but it's nicely curved and finished.\nBlack and white are your rather ho-hum color choices here, with Oppo attaching a plastic screen protector in the factory and bundling a silicone case with the phone too. So if you want some basic protection for your new handset, you won't necessarily have to go out and buy a separate case.\nWith that 6.5-inch screen and a thickness of 9.1mm, this is not a compact handset, though you can just about use it with one hand (if you have big-ish hands and dexterous fingers). It's good for getting a lot on screen at once, but it's not so good for stuffing into a small pocket.\nOppo has put the power button on the right here, with the volume controls on the left. The headphone jack (yes, there is one) is down at the bottom of the device, together with a speaker grille. Oppo has thankfully gone for USB-C as the data port, with some budget models still resorting to micro USB.\nThe fingerprint scanner is up on the back. The phone isn't dust or waterproof, but then you wouldn't really expect that from a phone at this price – corners have to be cut somewhere, so just make sure you don't drop it in the bath or leave it out in a sandstorm.\nWhile the design of the Oppo A5 2020 won't exactly set hearts racing, we've seen a lot worse down at the budget end of the Android market, so we can't really fault Oppo too much in this department. You're not going to be embarrassed to take this out in front of friends and family at least.\n"
    },
    "Moto G50 review: Dependable if unexciting": {
        "rating": "Rating: 3 out of 5 stars",
        "summary_pros_cons": "The Moto G50 is a dependable if mostly unremarkable phone. However, if you're looking for 5G connectivity and a 90Hz screen on a budget, you'll be fairly happy with these results.\n\nPros\n\n+5G support+Good battery life+90Hz screen\n\nCons\n\n-Mediocre camera-Unremarkable performance-Safe design\n",
        "review": "Theoretically the superior version of the Moto G30 if you were to listen to product names, the Moto G50 is another one of Motorola's cheap Android 11 phones for 2021, coming in at £199.99 (around $275 / AU$360).\nAs a 5G phone it's one of the cheapest ways to jump on the 5G bandwagon, but elsewhere its feature set is a little more unassuming.\nWhile everything about the Moto G50 is just fine - from its 90Hz screen to its Snapdragon 480 chipset and trio of main cameras - nothing actually stands out as much as we'd like it to.\nAt this price, that's less of an issue than you might think given the Moto G50 is solidly dependable in every way. Just don't expect to be wowed at any point. This is the phone to buy when you're on a budget and you don't mind not having a phone to show off to others.\nSolidly plastic is the best way to describe the style of the Moto G50. It has a plastic back and frame, and it's a fairly chunky device, offering dimensions of 164.9 x 74.9 x 9mm and weighing just under 200g.\nThe back of the phone houses a fingerprint sensor which is a little on the high side for those with small hands, but is otherwise fairly responsive. On the side there's a volume rocker, power button, and a Google Assistant button that, frustratingly, you can't remap. Your mileage will vary as to how much you use it, depending on how much you've ever used Google Assistant.\nThe main thing you'll be looking at is the 6.5-inch display. This sounds immediately attractive when you consider it offers a 90Hz refresh rate, but there's a catch, as its resolution is pretty low at 720 x 1600. In ordinary use this may well not bother you, but it's a clear example of a price cutting endeavor going on here.\nSimilarly, the camera setup might sound promising on paper but it's not so successful in reality. The front-facing camera is fine at 13MP, and carefully placed in a small notch, avoiding stealing any focus. However, the rear camera setup is restricted to a 48MP main sensor, a 5MP macro, and 2MP depth sensor. There's no ultra-wide lens here, and picture results are distinctly fine. Just fine.\nImages come out looking reasonably pleasant but there are issues with a certain lack of depth and also the restrictions that come from a digital-only zoom. Surprising at this price? Not really, but that doesn't mean we can't hope for more. This won't be a budget camera to wow photographers, and we're left wondering how come the cheaper Moto G30 manages to squeeze in an ultra-wide lens.\nMore pleasingly, the Moto G50 offers great battery life. With 5,000mAh to pack all the juice in and 15W charging, it does the job and you won't have to worry about recharging quite as often as with some other cheap phones.\nPerformance-wise, the Moto G50 maintains its steady if unremarkable attitude. Negotiating menus and opening apps is reasonably swift, with the only slowdown noticeable when loading up games such as Call of Duty: Mobile. It catches up in the end but there are minor issues here when opening a new map, for instance.\nBear in mind if you're a keen gamer, you've only got 64GB of storage to play with, so you may wish to take advantage of the ability to add a microSD card to bump up your storage space.\nStill, that's the thing about the Moto G50. It all works fairly well but never in a way that will wow you. The only thing that makes it truly stand out is the fact that it's such a cheap 5G phone, and we won't blame you if that's what swings it for you. After all, it's a great way of enjoying faster data speeds for far less money - and that alone is enough to see it rank among the best cheap phones.\n"
    },
    "Realme 8 5G review: 5G on a budget": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Realme 8 5G is exactly what you would expect before you unbox it, knowing the retail price and the manufacturer: a solid, inexpensive 5G phone. If that's what you're in the market for, then this handset is definitely going to appeal.\n\nPros\n\n+It has 5G+Large, bright screen+Very cheap\n\nCons\n\n-Rather basic design-No wireless charging-Average camera\n",
        "review": "The low-end, low-price smartphone market has never been busier, with the likes of Xiaomi and OnePlus joining seasoned budget phone makers Motorola and Nokia in pushing out super-cheap handsets that cover all the necessary basics without putting a huge dent in your bank balance.\nThen we have Realme, which already has a long line of solid, inexpensive phones behind it. New for 2021 is the Realme 8 5G, which offers more of the same: a respectable level of performance and an appealing design for not much money at all. In fact, you won't be able to find a cheaper 5G phone than this right now in some markets.\nOf course there are necessary compromises to get to this price point – you shouldn't expect top performance or the best camera capabilities from the Realme 8 5G. However, it's got enough to keep a lot of users happy, and for many people the actual cost of the phone is more important than extras such as wireless charging.\nThe need for 5G is an interesting one in 2021: most phones now come with the technology, even at the budget end of the market, but availability in terms of network coverage remains patchy around the world. Buying a 5G phone now protects you for the future, but it's hardly a necessity at the moment.\nIt's worth noting that there is a 4G version of the Realme 8 that actually costs more – it ditches the 5G but has a better screen and a better camera. You need to decide which smartphone features you want to spend your money on, and when you have, you'll find there's a phone out there for everyone.\nThere's no doubt that the highlights of this phone are the 5G and the affordable price, but we've also been impressed by the longevity of the 5,000mAh battery packed in here, and the screen quality and general performance are good for the price too. In other areas – like the camera – the Realme 8 5G does okay without really standing out from the crowd.\nWhether you're looking at budget phones or the iPhone 12 Pro Max, picking the right handset is about weighing up the features and performance against the price, and the Realme 8 5G definitely gives you a lot for your money, ranking among the best cheap phones – which is exactly as you would expect from the phone maker's track record.\n"
    },
    "Xiaomi Redmi Note 9S review: A new champion budget smartphone": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The Redmi Note 9S offers one of the most reliable experiences on a phone at its super-low price point. Its battery life is unmatched, the performance is always consistent, and the large display is a joy to use. \n\nPros\n\n+Impressive battery life+Reliable performance+Big and vibrant display\n\nCons\n\n-'Only' 60Hz display-Relatively slow charging-Bulky build\n",
        "review": "The Xiaomi Redmi Note 9S is available to buy only in the UK, at the time of writing, though that might change. It comes in two sizing versions - one with 4GB of RAM and 64GB of storage, and another 6GB / 128GB combo.\nIn the UK you can pick it up for £199 (roughly $250 / AU$370), so it's a rather cheap phone. That's for the 4GB / 64GB version, but for the 6GB / 128GB model you'll be paying £229 (around $280, AU$420). In any case, that's a price that ensures it ranks among the best cheap phones.\nBased on previous Xiaomi phones we wouldn't expect the Xiaomi Redmi Note 9S to make its way to the US, and Australian availability is uncertain because while many Xiaomi Mi phones are released there, not many Redmi phones are.\nSaying that, one of the few Redmi phones in Australia is the Redmi Note 8 Pro, so the Note 9S going on sale there wouldn't be totally shocking.\n"
    },
    "Moto G9 Power review: One of the best phones on a budget": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "The 'Moto' tells you you're getting a no-nonsense, dependable budget phone from Motorola, the 'Power' tells you this has one of the biggest batteries on the market – and that just about sums up what you can expect when it comes to the Moto G9 Power.\n\nPros\n\n+Long-lasting battery+Spacious screen+Very affordable\n\nCons\n\n-Average performance-On the bulky side-Only Android 10 for now\n",
        "review": "We more or less know what to expect from Motorola's budget Android phones at this point – solid build quality, value for money, and respectable performance.\nThese are the phones you get on your shortlist if you're prioritizing low cost over high benchmark scores, and would rather not spend four-figure sums on getting the very best components (screens, cameras and so on) that the smartphone market can offer right now.\nWhen it comes to the Moto G9 Power specifically, two features should catch your eye: the low, low price of this handset (check the widgets on this page for the latest deals), and the gigantic 6,000mAh battery capacity that is just about the biggest you'll find in terms of mainstream consumer handsets at the moment.\nWant a battery that will last and last, at a very affordable price point? The Moto G9 Power might be for you.\nInevitably, with a phone so cheap there are compromises. The internal specs of the G9 Power, including a Snapdragon 662 chipset and 4GB of RAM, are nothing to write home about – the phone will get you through day-to-day tasks well enough, and even run demanding games at lower quality settings, but this is not a handset that's going to impress you with its speediness.\nCamera quality is another area where you should temper your expectations, though we actually think the Moto G9 Power hits above its weight when it comes to the pictures that you can get from it (if the lighting is good and you have a steady hand).\nThe end results are significantly inferior to what you would get from the top-tier phones of today, but then you're paying significantly less for them – and for a lot of people who aren't producing enlarged canvas prints of their snaps, the Moto G9 Power is going to offer enough in the photography department.\nWe like the look of the phone too, especially considering its price, and it comes with a large (if low resolution) screen. While we should point out that there are a whole host of good, affordable handsets around at the moment – including the Moto G9 Play and Moto G9 Plus, by the way – the Moto G9 Power is one of the very best cheap phones.\n"
    },
    "Xiaomi Poco X3 NFC review: A lot of phone for not very much cash": {
        "rating": "Rating: 4 out of 5 stars",
        "summary_pros_cons": "Poco is back with another hot deal. The Poco X3 NFC comes with a few features you might expect of a pricier Android handset, such as decent gaming performance thanks to its Snapdragon G-series processor and a 120Hz screen, with excellent battery life sealing the deal. This is a great option for those on a budget.\n\nPros\n\n+Strong gaming performance+Excellent battery life+Great 120Hz wide color gamut screen\n\nCons\n\n-Struggling camera-Sometimes erratic backlight-It’s quite large, a little heavy\n",
        "review": "The Xiaomi Poco X3 NFC is all about value, like every Poco handset before it and almost every Xiaomi device. \nBut the strategy has changed since 2018’s Pocophone F1. The Poco X3 doesn’t come with a top-tier Snapdragon 8-series processor, because fitting one into a budget phone just doesn’t seem feasible anymore. \nHowever, the end result is similar. The Poco X3 NFC is probably the best phone for gaming at its price. It has a large, well-specced screen, loud stereo speakers, and its Qualcomm Snapdragon 732G processor handles titles such as Fortnite far better than the Snapdragon 665 and Exynos 9611 phones you might buy for the same cash.\nIt’s simply miles ahead. Even Realme, maker of some of 2020’s best budget phones, doesn’t have anything that can directly compete at launch.  Excellent battery life and a nerd-pleasing 120Hz display panel top off the Poco X3 sundae, and make this one of the best buys for techies on a tight budget. \nThere are a few bits to improve, however. Its screen has a situation-specific erratic backlight flicker, which we believe should be fixable via a firmware update. The odd glitch suggests the Poco X3 NFC is due a system stability update, too. \nOnly one issue is less likely to be fixed further down the road. The Poco X3 NFC has an impressive-sounding 64-megapixel main camera. It takes good shots, but suffers from significant purple fringing, more so than the majority of rival phones in this price range. \nStill, its digital 2x mode is better than most and while its low-light performance won’t worry the Google Pixel 4a, it’s at least on a par with the better budget Androids. \nThere are still reasons to step up to a phone such as the Realme X50 5G. It has 5G, its performance is a step up, and its glass back feels nicer. But at this level, such a leap in cost may not appear insignificant. \n"
    }
}